CREATE   proc [_birs].[CPC]
as
begin


drop table if exists  #t2

select    phonenumber, cast( id as nvarchar(36)) id, uf_source , UF_REGISTERED_AT into #t2 from stg._LCRM.lcrm_leads_full_calculated
where [Группа каналов]='CPC'	and  UF_REGISTERED_AT_date>='20230801'

drop table if exists  #lcrm

select a.*, b.UF_STAT_CAMPAIGN, b.UF_STAT_DETAIL_INFO into #lcrm from  #t2 a join stg._lcrm.lcrm_leads_full b on a.id=b.id
insert into #lcrm


select phone, id, source, created, STAT_CAMPAIGN,  STAT_INFO  from v_lead
where channel_group='CPC'	--and  UF_REGISTERED_AT_date>='20230801'
 


												  
drop table if exists  #t3
			  

SELECT  x.UF_REGISTERED_AT
, x.lcrm_id
, x.UF_STAT_CAMPAIGN
, x.UF_STAT_DETAIL_INFO
, x.uf_source
, x. phonenumber phonenumber 

,   b.[Источник] 
,   b.[Место cоздания] 
,   b.[Вид займа] 
,   b.Отказано 
,   b.Одобрено 
,   b.[Номер] 
,   1-b.isPts [isInstallment] 
,   b.[Верификация КЦ] 
,   b.[Заем выдан] 
,   b.[Выданная сумма] 
,   b.[Группа каналов] 
,   b.[Канал от источника] 

, ROW_NUMBER() over(partition by phonenumber order by [Заем выдан] desc, Одобрено desc, [Контроль данных] desc, [Предварительное одобрение] desc, [Верификация КЦ] desc) rn
into #t3
FROM


(
	SELECT phonenumber
		,id  lcrm_id
		,UF_REGISTERED_AT  UF_REGISTERED_AT
		,uf_source  uf_source
		,UF_STAT_CAMPAIGN  UF_STAT_CAMPAIGN
		,UF_STAT_DETAIL_INFO  UF_STAT_DETAIL_INFO
		, ROW_NUMBER() over(partition by phonenumber order by  UF_REGISTERED_AT) rn

	FROM #lcrm
 
		--order by 
	) x
left JOIN reports.dbo.dm_factor_analysis_001 b ON x.phonenumber = b.Телефон
	AND b.[Верификация КЦ] >= x.UF_REGISTERED_AT
	where rn=1
	--order by 	2

	select 
    a.[UF_REGISTERED_AT] 
,   a.lcrm_id 
,   a.UF_STAT_DETAIL_INFO 
,   a.UF_STAT_CAMPAIGN 
,   a.[Номер] 
,   dbo.to_md5(phonenumber, 1)   phonenumber
,   a.[Источник] 
,   a.[Вид займа] 
,   a.[Место cоздания] 
,   a.Отказано 
,   a.Одобрено 
,  a.  [isInstallment] 
,   a.[Верификация КЦ] 
,   a.[Заем выдан] 
,   a.[Выданная сумма] 

,   a.[Группа каналов] 
,   a.[Канал от источника] 
,   a.rn 

--,   a.[uf_source] 
--,   dbo.to_md5( a.[phonenumber], 1) [phonenumber] 
--,   a.[Дата] 
--,   a.[Время] 
--,   a.[Текущий статус] 
--,   a.[Место cоздания] 
--,   a.[Место создания 2] 
--,   a.[Автор] 
--,   a.[Причина отказа] 
--,   a.[офис ссылка] 
--,   a.[РО_регион] 
--,   a.[РП] 
--,   a.[Юрлицо] 
--,   a.[Регион] 
--,   a.[Партнер] 
--,   a.[Номер точки при создании] 
--,   a.[Юрлицо при создании] 
--,   a.[Номер партнера] 
--,   a.[Номер партнера CRM] 
--,   a.[Регион проживания] 
--,   a.[Вид займа] 
--,   a.[product] 
--,   a.[RBP] 
--,   a.[Категория повторного клиента] 
--,   a.[isSmartInstallment] 
--,   a.[Продукт] 
--,   a.[Признак Рефинансирование] 
--,   a.[Срок займа] 
--,   a.[Первичная сумма] 
--,   a.[Сумма одобренная] 
--,   a.[Стоимость ТС] 
--,   a.[Процентная ставка] 
--,   a.[Сумма заявки] 
--,   a.[Способ выдачи] 
--,   a.[Признак Комиссионный Продукт] 
--,   a.[Признак Коробочный Продукт] 
--,   a.[Признак Страховка] 
--,   a.[Сумма Дополнительных Услуг Carmoney Net] 
--,   a.[Сумма Дополнительных Услуг Carmoney] 
--,   a.[Сумма Дополнительных Услуг] 
--,   a.[Признак Каско] 
--,   a.[Признак Страхование Жизни] 
--,   a.[Признак РАТ] 
--,   a.[Признак Помощь Бизнесу] 
--,   a.[Признак Телемедицина] 
--,   a.[Признак Защита от потери работы] 
--,   a.[Признак Фарма] 
--,   a.[Признак Спокойная Жизнь] 
--,   a.[Признак РАТ Юруслуги] 
--,   a.[Сумма КАСКО] 
--,   a.[Сумма КАСКО Carmoney] 
--,   a.[Сумма КАСКО Carmoney Net] 
--,   a.[Сумма страхование жизни] 
--,   a.[Сумма страхование жизни Carmoney] 
--,   a.[Сумма страхование жизни Carmoney Net] 
--,   a.[Сумма РАТ] 
--,   a.[Сумма РАТ Carmoney] 
--,   a.[Сумма РАТ Carmoney Net] 
--,   a.[Сумма Помощь бизнесу] 
--,   a.[Сумма Помощь бизнесу Carmoney] 
--,   a.[Сумма Помощь бизнесу Carmoney Net] 
--,   a.[Сумма Телемедицина] 
--,   a.[Сумма Телемедицина Carmoney] 
--,   a.[Сумма Телемедицина Carmoney Net] 
--,   a.[Сумма Защита от потери работы] 
--,   a.[Сумма Защита от потери работы Carmoney] 
--,   a.[Сумма Защита от потери работы Carmoney Net] 
--,   a.[Сумма Фарма] 
--,   a.[Сумма Фарма Carmoney] 
--,   a.[Сумма Фарма Carmoney Net] 
--,   a.[Сумма Спокойная Жизнь] 
--,   a.[Сумма Спокойная Жизнь Carmoney] 
--,   a.[Сумма Спокойная Жизнь Carmoney Net] 
--,   a.[Сумма РАТ Юруслуги] 
--,   a.[Сумма РАТ Юруслуги Carmoney] 
--,   a.[Сумма РАТ Юруслуги Carmoney Net] 
--,   a.[Предварительное одобрение] 
--,   a.[Встреча назначена] 
--,   a.[Контроль данных] 
--,   a.[Верификация документов клиента] 
--,   a.[Одобрены документы клиента] 
--,   a.[Верификация документов] 
--,   a.[Одобрено] 
--,   a.[Договор зарегистрирован] 
--,   a.[Договор подписан] 
--,   a.[Заем погашен] 
--,   a.[Заем аннулирован] 
--,   a.[Аннулировано] 
--,   a.[Отказ документов клиента] 
--,   a.[Отказано] 
--,   a.[Отказ клиента] 
--,   a.[Забраковано] 
--,   a.[ПризнакЗаявка] 
--,   a.[ПризнакПредварительноеОдобрение] 
--,   a.[ПризнакВстречаНазначена] 
--,   a.[ПризнакКонтрольДанных] 
--,   a.[ПризнакКонтрольДанныхИзФактическихВстреч] 
--,   a.[ПризнакВерификацияДокументовКлиента] 
--,   a.[ПризнакОдобреныДокументовКлиента] 
--,   a.[ПризнакВерификацияДокументов] 
--,   a.[ПризнакОдобрено] 
--,   a.[ПризнакДоговорЗарегистрирован] 
--,   a.[ПризнакДоговорПодписан] 
--,   a.[ПризнакЗайм] 
--,   a.[ПризнакОтказано] 
--,   a.[ПризнакОтказКлиента] 
--,   a.[ЛагЗаявкаЗаймДней] 
--,   a.[ЛагКрупноЗаявкаЗайм] 
--,   a.[ПризнакЗаймДеньВДень] 
--,   a.[ПризнакЗаймНеДеньВДень] 
--,   a.[ЛагВстречаКонтрольДанныхВДнях] 
--,   a.[ЛагВстречаКонтрольДанныхДеньВДеньДней] 
--,   a.[ЛагВстречаКонтрольДанныхНеДеньВДеньДней] 
--,   a.[НеПрошлиКД] 
--,   a.[КДраньшеВстречиИЛИБезВстречи] 
--,   a.[КДБезНазначеннойВстречи] 
--,   a.[ЛагОдобреноЗаймДней] 
--,   a.[ЛагОдобреноЗайм_День_в_день] 
--,   a.[ЛагОдобреноЗайм_Не_День_в_день] 
--,   a.[ДИАПАЗОН_КД_ЗаймДней] 
--,   a.[ОдобреноОтКД_со_встр] 
--,   a.[ОдобреноОтКД_без_встр] 
--,   a.[ОдобреноНоЗаймНеВыдан] 
--,   a.[ЗаймОтОдобр_вст] 
--,   a.[ЗаймОтОдобр_без_вст] 
--,   a.[ВремяОтВстречаНазначенаДоКДМинут] 
--,   a.[Диапазон5] 
--,   a.[ВремяОтВерификацияКЦДоВыдачиЧасы] 
--,   a.[НеделяЗаявки] 
--,   a.[НеделяЗайма] 
--,   a.[МесяцВыдач] 
--,   a.[ГодВыдачи] 
--,   a.[МесяцЗаявки] 
----,   a.[Телефон] 
--,   a.[TTC_number] 
--,   a.[TTC] 
--,   a.[ДатаЗаявкиПолная] 
--,   a.[Дубль] 
--,   a.[Дубль_ClientGuid] 
--,   a.[ПризнакЗабраковано] 
--,   a.[Признак Отказ документов клиента] 
--,   a.[ГодЗаявки] 
--,   a.[ФИО] 
--,   a.[СуммарныйМесячныйДоход] 
--,   a.[Дубль_ClientGuidОдинДень] 
--,   a.[P2P] 
--,   a.[ПризнакP2P] 
--,   a.[Ссылка заявка] 
--,   a.[Ссылка клиент] 
--,   a.[LCRM ID] 
--,   a.[Тип трафика] 
--,   a.[Вебмастер] 
--,   a.[Приоритет обзвона] 
--,   a.[Кампания utm] 
--,   a.[Канал от источника лид] 
--
--,   a.[Exceptions info] 
--,   a.[TransitionsJSON] 
--,   a.[Дата отчета] 
--,   a.[rn] 

from 

#t3 a
--where rn=1

	--select distinct * from #t3


--	exec select_table '#t3'


	end