CREATE   proc [_birs].[verification]
@mode VARCHAR(MAX)
as
--begin

if @mode  = 'select_1'
begin   --select [Номер заявки], sum([Время Затрачено В работе]+[Время Затрачено Ожидание]) [Время], sign(sum([Доработка признак])) [Доработка признак]

--into #t1
--from analytics.dbo.[Отчет Время статусов верификации] 
--group by [Номер заявки]

--select a.*, b.[Одобрено месяц], b.[Вид займа], b.[Группа каналов], b.[Канал от источника], b.Дубль, b.[Признак Одобрено], b.[Признак Заем выдан],


--cast([Время]*24*60 as bigint) [Время мин]
--,
--case 
--when cast([Время]*24*60 as bigint)<=30 then '1) 0..30 мин'
--when cast([Время]*24*60 as bigint)<=50 then '2) 30..50 мин'
--when cast([Время]*24*60 as bigint)<=90 then '3) 50..90 мин'
--when cast([Время]*24*60 as bigint)>90 then '4) >1.5 ч'
--end [Время мин бакет]
--, case when b.[Группа каналов]='cpa' then [Канал от источника] else [Группа каналов] end канал
--, [Выданная сумма]
--from #t1 a
--left join mv_dm_Factor_Analysis b on a.[Номер заявки]=b.Номер
--where  b.[Одобрено месяц] is not null


;

with v as (
select 
[Номер]	
,sum(isnull([Время Затрачено В работе], 0) ) [Время В работе]		 
,sum(isnull([Время Затрачено Ожидание], 0) ) [Время Ожидание]		 
,sum(isnull([Время Затрачено Отложено], 0) ) [Время Отложено]		 
,sum(isnull([Время Затрачено В работе], 0)+ isnull([Время Затрачено Ожидание], 0) ) [Время]		 
, sign(sum([Доработка признак])) [Доработка признак]
--select top 100 * 	from  	  analytics.dbo.[Отчет Время статусов верификации]
from  	  analytics.dbo.[Отчет Время статусов верификации]
group by Номер	  )

select 
a.Номер
,a.ispts
,a.[Контроль данных]
,a.Одобрено
, a.[Вид займа]
, a.RBP
, case 
when  a.[Группа каналов]  = 'Триггеры' Then 'Органика + триггеры'
when  a.[Группа каналов]  = 'Органика' Then 'Органика + триггеры'
when  a.[Группа каналов]  = 'Банки' Then 'Банки + Телеком'
when  a.[Группа каналов]  = 'Телеком' Then 'Банки + Телеком'
else  a.[Группа каналов]  end  [Группа каналов] 
, case a.[Вид займа] when 'Первичный' Then 'Первичный' else 'Повторный' end  [Вид займа 2]
, case 
--when 24*60*b.[Время]   <=15 then '1) 0..15 мин'
when 24*60*b.[Время]   <=40 then '1) до..40 мин'
when 24*60*b.[Время]   > 40 then '2) 40+ мин'
when 24*60*b.[Время] is null then '?' end  [Время наше бакет]

, case 
when datediff(minute, [Контроль данных], Одобрено)   <=15 then '1) 0..15 мин'
when datediff(minute, [Контроль данных], Одобрено)   <=60 then '2) 15..60 мин'
when datediff(minute, [Контроль данных], Одобрено)   > 60 then '3) 60+ мин'
when datediff(minute, [Контроль данных], Одобрено) is null then '1) 0..15 мин' end  [Время общее бакет]
 ,case when [Заем выдан] 	  is not null then 1 else 0 end [Признак Заем выдан]
 , b.[Время]
 , [Время В работе]
 , [Время Ожидание]
 , [Время Отложено]
 , case 
--when 24*60*b.[Время]   <=15 then '1) 0..15 мин'
when 24*60*b.[Время]   <=30 then 1 else 0 end [За 30 минут] 
from reports.dbo.dm_factor_analysis_001	 a
left join v b on a.Номер=b.Номер
where --ispts=1 and 
Одобрено is not null	and cast(format(Одобрено, 'yyyy-MM-01') as date) >='20240101'	  and Дубль=0
--order by 1

end

if @mode  = 'select_2'
begin
select * from analytics.dbo.[Отчет Время статусов верификации]
end

----select [Номер заявки], sum([Время Затрачено В работе]+[Время Затрачено Ожидание]) [Время], sign(sum([Доработка признак])) [Доработка признак]

----into #t1
----from analytics.dbo.[Отчет Время статусов верификации] 
----group by [Номер заявки]

----select a.*, b.[Одобрено месяц], b.[Вид займа], b.[Группа каналов], b.[Канал от источника], b.Дубль, b.[Признак Одобрено], b.[Признак Заем выдан],


----cast([Время]*24*60 as bigint) [Время мин]
----,
----case 
----when cast([Время]*24*60 as bigint)<=30 then '1) 0..30 мин'
----when cast([Время]*24*60 as bigint)<=50 then '2) 30..50 мин'
----when cast([Время]*24*60 as bigint)<=90 then '3) 50..90 мин'
----when cast([Время]*24*60 as bigint)>90 then '4) >1.5 ч'
----end [Время мин бакет]
----, case when b.[Группа каналов]='cpa' then [Канал от источника] else [Группа каналов] end канал
----, [Выданная сумма]
----from #t1 a
----left join mv_dm_Factor_Analysis b on a.[Номер заявки]=b.Номер
----where  b.[Одобрено месяц] is not null


--;

--with v as (
--select 
--[Номер]	
--,sum(isnull([Время Затрачено В работе], 0) ) [Время В работе]		 
--,sum(isnull([Время Затрачено Ожидание], 0) ) [Время Ожидание]		 
--,sum(isnull([Время Затрачено Отложено], 0) ) [Время Отложено]		 
--,sum(isnull([Время Затрачено В работе], 0)+ isnull([Время Затрачено Ожидание], 0) ) [Время]		 
--, sign(sum([Доработка признак])) [Доработка признак]
----select top 100 * 	from  	  analytics.dbo.[Отчет Время статусов верификации]
--from  	  analytics.dbo.[Отчет Время статусов верификации]
--group by Номер	  )

--select 
--a.Номер
--,a.ispts
--,a.[Контроль данных]
--,a.Одобрено
--, a.[Вид займа]
--, a.RBP
--, case 
--when  a.[Группа каналов]  = 'Триггеры' Then 'Органика + триггеры'
--when  a.[Группа каналов]  = 'Органика' Then 'Органика + триггеры'
--when  a.[Группа каналов]  = 'Банки' Then 'Банки + Телеком'
--when  a.[Группа каналов]  = 'Телеком' Then 'Банки + Телеком'
--else  a.[Группа каналов]  end  [Группа каналов] 
--, case a.[Вид займа] when 'Первичный' Then 'Первичный' else 'Повторный' end  [Вид займа 2]
--, case 
----when 24*60*b.[Время]   <=15 then '1) 0..15 мин'
--when 24*60*b.[Время]   <=40 then '1) до..40 мин'
--when 24*60*b.[Время]   > 40 then '2) 40+ мин'
--when 24*60*b.[Время] is null then '?' end  [Время наше бакет]

--, case 
--when datediff(minute, [Контроль данных], Одобрено)   <=15 then '1) 0..15 мин'
--when datediff(minute, [Контроль данных], Одобрено)   <=60 then '2) 15..60 мин'
--when datediff(minute, [Контроль данных], Одобрено)   > 60 then '3) 60+ мин'
--when datediff(minute, [Контроль данных], Одобрено) is null then '1) 0..15 мин' end  [Время общее бакет]
-- ,case when [Заем выдан] 	  is not null then 1 else 0 end [Признак Заем выдан]
-- , b.[Время]
-- , [Время В работе]
-- , [Время Ожидание]
-- , [Время Отложено]
-- , case 
----when 24*60*b.[Время]   <=15 then '1) 0..15 мин'
--when 24*60*b.[Время]   <=30 then 1 else 0 end [За 30 минут] 
--from reports.dbo.dm_factor_analysis_001	 a
--left join v b on a.Номер=b.Номер
--where --ispts=1 and 
--Одобрено is not null	and cast(format(Одобрено, 'yyyy-MM-01') as date) >='20240101'	  and Дубль=0
----order by 1

--end