CREATE   proc 
[_birs].[Факторный анализ excel]
  @mode nvarchar(max) = 's'
as


begin

if @mode='u'
begin


drop table if exists #t2

;
	  DECLARE @rr FLOAT = (
		SELECT [Доля дня птс накоп]
		FROM [v_План по каналам_по_дням]
		WHERE Дата = cast(getdate() - 1 AS DATE)
		)

SELECT ПланФакт = case when cast(format([Дата займа/заявки], 'yyyy-MM-01') AS DATE) = cast(format(getdate() - 1, 'yyyy-MM-01') AS DATE) 
--and [Дата займа/заявки] < getdate() - 1

then 'ФАКТ' else 'RR' end
	,[Верификация КЦ день]
	,[Заем выдан день]
	,[Дата займа/заявки]
	,[Канал от источника]
	,[Группа каналов]
	,[Вид займа 3]
	,[Продукт для планирования]
	,[Тип продукта]
	,[Заявок]
	,[Предварительно одобрено]
	,[КД]
	,[Поступило на Call2]
	,[Получили accept Call2]
	,[Не застряли после Call2 accept]
	,[Одобрено]
	,[Заем выдан]
	,[Выданная сумма]
	,[Ставка умножить на сумму]
	,[Отказано]
	,[Источник]
INTO #t2
FROM [Analytics].[dbo].[v_факторный_анализ]
WHERE [Дата займа/заявки] < getdate() - 1

UNION ALL

SELECT ПланФакт = 'ПЛАН по вчера'
	,[Дата]								      
	,[Дата]
	,[Дата]
	,[Канал от источника]
	,[Группа каналов]
	,CASE 	   WHEN [Вид займа] = 'Новые'  	THEN 'Первичный'	  WHEN [Вид займа] = 'Повторные'  	THEN 'Повторный'  WHEN [Вид займа] = 'Докреды'  	THEN 'Докредитование' END
	,[продукт]
	,[Тип продукта]
	,[заявок ПТС]
	,[Предварительно одобрено ПТС]
	,[КД ПТС]
	,[Поступило на Call2 ПТС]
	,[Признак Call2 accept ПТС]
	,[Признак не застрял после Call2 accept ПТС]
	,[Одобрено ПТС]
	,[заем выдан ПТС]
	,[Выданная сумма ПТС]
	,[Ставка на сумму]
	,NULL
	,NULL

FROM [Analytics].[dbo].[v_План по каналам]
WHERE [Дата] between cast(format(getdate() - 1, 'yyyy-MM-01') AS DATE)  and   cast(getdate() - 1 AS DATE) 

UNION ALL

SELECT ПланФакт = 'ПЛАН'
	,[Дата]
	,[Дата]
	,[Дата]
	,[Канал от источника]
	,[Группа каналов]
	,CASE 
		WHEN [Вид займа] = 'Новые'
			THEN 'Первичный'
		WHEN [Вид займа] = 'Повторные'
			THEN 'Повторный'
		WHEN [Вид займа] = 'Докреды'
			THEN 'Докредитование'
		END
	,[продукт]
	,[Тип продукта]
	,[заявок ПТС]
	,[Предварительно одобрено ПТС]
	,[КД ПТС]
	,[Поступило на Call2 ПТС]
	,[Признак Call2 accept ПТС]
	,[Признак не застрял после Call2 accept ПТС]
	,[Одобрено ПТС]
	,[заем выдан ПТС]
	,[Выданная сумма ПТС]
	,[Ставка на сумму]
	,NULL
	,NULL
FROM [Analytics].[dbo].[v_План по каналам]

union all

SELECT ПланФакт = 'ПЛАН'
	,[Дата]
	,[Дата]
	,[Дата]  
    ,'error' 
    ,'error' 
    
      ,[Вид займа]
	  ,'error'
	  ,'Инстоллмент'
	,[заявок Инст]
	,[Предварительно одобрено Инст]
	,[КД Инст]
	,[Поступило на Call2 Инст]
	,[Признак Call2 accept Инст]
	,[Признак не застрял после Call2 accept Инст]
	,[Одобрено Инст]
	  
      
      ,[заем выдан Инст]
      ,[Выданная сумма Инст]
	  ,null
	  ,null
	  ,null

  FROM [Analytics].[dbo].[v_План по каналам_инст]
 

UNION ALL		  
SELECT ПланФакт = 'ПЛАН по вчера'
	,[Дата]
	,[Дата]
	,[Дата]  
    ,'error' 
    ,'error' 
    
      ,[Вид займа]
	  ,'error'
	  ,'Инстоллмент'
	,[заявок Инст]
	,[Предварительно одобрено Инст]
	,[КД Инст]
	,[Поступило на Call2 Инст]
	,[Признак Call2 accept Инст]
	,[Признак не застрял после Call2 accept Инст]
	,[Одобрено Инст]
	  
      
      ,[заем выдан Инст]
      ,[Выданная сумма Инст]
	  ,null
	  ,null
	  ,null

  FROM [Analytics].[dbo].[v_План по каналам_инст]
 	
WHERE [Дата] between cast(format(getdate() - 1, 'yyyy-MM-01') AS DATE)  and   cast(getdate() - 1 AS DATE) 

UNION ALL

SELECT ПланФакт = 'RR'
	,cast(format([Дата займа/заявки], 'yyyy-MM-01') AS DATE)
	,cast(format([Дата займа/заявки], 'yyyy-MM-01') AS DATE)
	,cast(format([Дата займа/заявки], 'yyyy-MM-01') AS DATE)
	,[Канал от источника]
	,[Группа каналов]
	,[Вид займа 3]
	,[Продукт для планирования]
	,[Тип продукта]
	,sum([Заявок]) / @rr [Заявок]
	,sum([Предварительно одобрено]) / @rr [Предварительно одобрено]
	,sum([КД]) / @rr [КД]
	,sum([Поступило на Call2]) / @rr [Поступило на Call2]
	,sum([Получили accept Call2]) / @rr [Получили accept Call2]
	,sum([Не застряли после Call2 accept]) / @rr [Не застряли после Call2 accept]
	,sum([Одобрено]) / @rr [Одобрено]
	,sum([Заем выдан]) / @rr [Заем выдан]
	,sum([Выданная сумма]) / @rr [Выданная сумма]
	,sum([Ставка умножить на сумму]) / @rr [Ставка умножить на сумму]
	,sum([Отказано]) / @rr [Отказано]
	,[Источник]
FROM [Analytics].[dbo].[v_факторный_анализ] a
WHERE cast(format([Дата займа/заявки], 'yyyy-MM-01') AS DATE) = cast(format(getdate() - 1, 'yyyy-MM-01') AS DATE)
	AND [Дата займа/заявки] < getdate() - 1
GROUP BY cast(format([Дата займа/заявки], 'yyyy-MM-01') AS DATE)
	,[Канал от источника]
	,[Группа каналов]
	,[Вид займа 3]
	,[Продукт для планирования]
	,[Тип продукта]
	,[Источник]


	--drop table if exists   _birs.[Факторный анализ excel кэш]
	--select * into _birs.[Факторный анализ excel кэш] from #t2

	delete from	 _birs.[Факторный анализ excel кэш]
	insert _birs.[Факторный анализ excel кэш]
	select * from #t2


end

if @mode='s'
begin

select 
    a.[ПланФакт] 
,   a.[Верификация КЦ день] 
,   a.[Заем выдан день] 
,   a.[Дата займа/заявки] 
,  case when a.[Группа каналов] ='Органика' then a.[Вид займа 3] else  a.[Канал от источника] end [Канал от источника]
,   a.[Группа каналов] 
,   case a.[Вид займа 3] 
when 'Первичный' then '1) Первичный'
when 'Повторный' then '2) Повторный'
when 'Докредитование' then '3) Докредитование'	  end  [Вид займа 3]
,   a.[Продукт для планирования] 
,   a.[Тип продукта] 
,   a.[Заявок] 
,   a.[Предварительно одобрено] 
,   a.[КД] 
,   a.[Поступило на Call2] 
,   a.[Получили accept Call2] 
,   a.[Не застряли после Call2 accept] 
,   a.[Одобрено] 
,   a.[Заем выдан] 
,   a.[Выданная сумма] 
,   a.[Ставка умножить на сумму] 
,   a.[Отказано] 
,   a.[Источник] 

from 

Analytics._birs.[Факторный анализ excel кэш] a

--exec select_table 'Факторный анализ excel кэш'	 , 'analytics'


end



end

	
