CREATE procedure [Risk].[report_portfolio_ar_proc]
as
begin
SET DATEFIRST 1	 ;
--ВОРОНКА
--Для выгрузки:
--	1. меняем дату отчета в блоке 0
--	2. добавляем новые периоды, в которых интересно отследить изменения в блоке 7
--	3. запускаем все 

--0. задаем дату начала выторки для отчетов
DECLARE @Date_rep date = '20231201';
SET XACT_ABORT  ON;
begin try
drop table if exists #smpl;
SELECT distinct
		GUID
		,number									--номер заявки
		,stage									--этап стратегии
		,Next_step
		,call_date								--дата-время вызова стратегии
		,request_amount							--запрошенная клиентом сумма
		,is_installment							--флаг инстолмента
	--	,strategy_version			--стратегия
		,client_type_1				--тип клиента call1
		,client_type_2				--тип клиента call2
		,Decision					--решение на этапе или заявке
		,Decision_Code							--код отказа если отказ
		,case
		when Decision_code = '100.0016.002' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0016.003' then 'Минимальные требования (заявитель)'
		when Decision_code = '100.0051.001' then 'Отказ по скору'
		when Decision_code = '100.0051.002' then 'Отказ по скору'
		when Decision_code = '100.0060.015' then 'Негативная информациия (БКИ)'
		when Decision_code = '100.0060.107' then 'Негативная информациия (БКИ)'
		when Decision_code = '100.0061.001' then 'Негативная информациия (БКИ)'
		when Decision_code = '100.0061.002' then 'Негативная информациия (БКИ)'
		when Decision_code = '100.0061.016' then 'Негативная информациия (БКИ)'
		when Decision_code = '100.0070.002' then 'Негативная информация (внутренние источники)'
		when Decision_code = '100.0070.007' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0070.207' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0080.005' then 'Негативная информациия (ФССП)'
		when Decision_code = '100.0081.006' then 'Негативная информациия (ФССП)'
		when Decision_code = '100.0081.007' then 'Негативная информациия (ФССП)'
		when Decision_code = '100.0082.001' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0100.001' then 'Минимальные требования (заявитель)'
		when Decision_code = '100.0100.002' then 'Минимальные требования (заявитель)'
		when Decision_code = '100.0100.005' then 'Минимальные требования (заявитель)'
		when Decision_code = '100.0100.041' then 'Минимальные требования (заявитель)'
		when Decision_code = '100.0100.113' then 'Минимальные требования (заявитель)'
		when Decision_code = '100.0110.008' then 'Негативная информация (внутренние источники)'
		when Decision_code = '100.0110.011' then 'Негативная информация (внутренние источники)'
		when Decision_code = '100.0120.001' then 'Негативная информация (внутренние источники)'
		when Decision_code = '100.0120.071' then 'Негативная информация (внутренние источники)'
		when Decision_code = '100.0120.091' then 'Негативная информация (внутренние источники)'
		when Decision_code = '100.0120.101' then 'Минимальные требования (заявитель)'
		when Decision_code = '100.0131.001' then 'Отказ по лимиту'
		when Decision_code = '100.0131.002' then 'Отказ по лимиту'
		when Decision_code = '100.0701.003' then 'Негативная информация (внутренние источники)'
		when Decision_code = '100.0701.004' then 'Негативная информация (внутренние источники)'
		when Decision_code = '100.0702.002' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0702.003' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0702.004' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0702.005' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0702.006' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0703.002' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0703.003' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0703.004' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0703.005' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0704.002' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0704.003' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0704.004' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0705.002' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0705.003' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0705.004' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0705.005' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0705.006' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0706.002' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0707.003' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0709.002' then 'Минимальные требования (заявитель)'
		when Decision_code = '100.0712.002' then 'Минимальные требования (заявитель)'
		when Decision_code = '100.0712.003' then 'Минимальные требования (заявитель)'
		when Decision_code = '100.0751.001' then 'Отказ по скору'
		when Decision_code = '100.0760.015' then 'Негативная информациия (БКИ)'
		when Decision_code = '100.0761.002' then 'Негативная информациия (БКИ)'
		when Decision_code = '100.0761.016' then 'Негативная информациия (БКИ)'
		when Decision_code = '100.0781.006' then 'Негативная информациия (ФССП)'
		when Decision_code = '100.0781.007' then 'Негативная информациия (ФССП)'
		when Decision_code = '100.0801.004' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0801.005' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0801.006' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0801.007' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0802.003' then 'Негативная информация (внутренние источники)'
		when Decision_code = '100.0802.004' then 'Негативная информация (внутренние источники)'
		when Decision_code = '100.0808.005' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0809.007' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0809.008' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0809.010' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0810.007' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0811.008' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0811.009' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0811.010' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0812.006' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0812.007' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0812.008' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0812.009' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0812.010' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0813.004' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0813.005' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0813.006' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0814.004' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0814.005' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0814.006' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0814.007' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0814.008' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0814.009' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0814.010' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0814.011' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0814.013' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0814.014' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0814.015' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0814.016' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0814.118' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0815.002' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0815.003' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0815.004' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0815.007' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0815.008' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0815.009' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0815.010' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0815.011' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0815.012' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0817.002' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0861.001' then 'Другое, в том числе брошенные'
		when Decision_code = '100.0951.001' then 'Отказ по скору'
		when Decision_code = '100.0960.015' then 'Негативная информациия (БКИ)'
		when Decision_code = '100.0961.002' then 'Негативная информациия (БКИ)'
		when Decision_code = '100.0961.016' then 'Негативная информациия (БКИ)'
		when Decision_code = '100.0961.017' then 'Негативная информациия (БКИ)'
		when Decision_code = '100.0981.006' then 'Негативная информациия (ФССП)'
		when Decision_code = '100.0981.007' then 'Негативная информациия (ФССП)'
		when Decision_code = '200.0060.015' then 'Негативная информациия (БКИ)'
		when Decision_code = '200.0060.107' then 'Негативная информациия (БКИ)'
		when Decision_code = '200.0061.001' then 'Негативная информациия (БКИ)'
		when Decision_code = '200.0061.002' then 'Негативная информациия (БКИ)'
		when Decision_code = '200.0061.016' then 'Негативная информациия (БКИ)'
		when Decision_code = '200.0760.015' then 'Негативная информациия (БКИ)'
		when Decision_code = '200.0761.002' then 'Негативная информациия (БКИ)'
		when Decision_code = '200.0761.016' then 'Негативная информациия (БКИ)'
		when Decision_code = '200.0960.015' then 'Негативная информациия (БКИ)'
		when Decision_code = '200.0961.002' then 'Негативная информациия (БКИ)'
		when Decision_code = '200.0961.016' then 'Негативная информациия (БКИ)'
		else 'Другое, в том числе брошенные'
	end as Decision_description
	,case
			when decision_code = '100.0711.002' then 'Подозрение на подделку паспорта/ генератор документов'
			when decision_code = '100.0711.003' then 'Признак применения фотошопа'
			when decision_code = '100.0711.004' then 'Негатив в метаданных'
			when decision_code = '100.0711.005' then 'Расхождение в данных паспорта'
			when decision_code = '100.0711.006' then 'Фото с экрана/скриншот'
			when decision_code = '100.0711.007' then 'Черно-белое фото'
			when decision_code = '100.0711.008' then 'Другой негатив'
			when decision_code = '100.0223.002' then 'Заявитель банкрот'
			when decision_code = '100.0817.002' then 'Заявитель банкрот'
			when decision_code = '100.0208.002' then 'Мобильный телефон клиента принадлежит 3-му лицу. Подозрение в мошенничестве'
			when decision_code = '100.0208.003' then 'Мобильный телефон клиента принадлежит 3-му лицу (близкому родственнику), заявку перезаводим'
			when decision_code = '100.0208.004' then 'Идентификация не пройдена (не может назвать свое ФИО, дату рождения)'
			when decision_code = '100.0208.005' then 'Отказ клиента, клиент не оформлял займ'
			when decision_code = '100.0208.006' then 'Кредит для 3-х лиц'
			when decision_code = '100.0208.008' then 'Клиент дает противоречивую инф-ю'
			when decision_code = '100.0208.009' then 'Клиент "Олень" (приведен 3-ми лицами)'
			when decision_code = '100.0208.010' then 'Клиент подтвердил, что обратился за кредитом под влиянием 3х лиц'
			when decision_code = '100.0208.011' then 'Клиент пьян'
			when decision_code = '100.0208.012' then 'Отвечает 3 лицо - представляется клиентом'
			when decision_code = '100.0211.004' then 'Негатив от КЛ (должник, алкоголик, наркоман)'
			when decision_code = '100.0813.004' then 'КЛ не знает клиента/номер не существует, клиент подтвердил номер'
			when decision_code = '100.0813.005' then 'Негатив от КЛ (должник, алкоголик, наркоман)'
			when decision_code = '100.0813.006' then 'КЛ не знает клиента/номер не существует, не удалось подтвердить номер'
			when decision_code = '100.0814.004' then 'Отказ клиента'
			when decision_code = '100.0814.005' then 'Мобильный телефон клиента принадлежит 3-му лицу (близкому родственнику)'
			when decision_code = '100.0814.006' then 'Идентификация не пройдена (не может назвать свое ФИО, дату рождения)'
			when decision_code = '100.0814.007' then 'Отказ клиента, клиент не оформлял займ'
			when decision_code = '100.0814.008' then 'Кредит для 3-х лиц'
			when decision_code = '100.0814.009' then 'Клиент дает противоречивую инф-ю'
			when decision_code = '100.0814.010' then 'Клиент "Олень" (приведен 3-ми лицами)'
			when decision_code = '100.0814.011' then 'Мобильный телефон клиента принадлежит 3-му лицу. Подозрение в мошенничестве'
			when decision_code = '100.0814.013' then 'Клиент пьян'
			when decision_code = '100.0814.014' then 'Отвечает 3-е лицо'
			when decision_code = '100.0814.015' then 'Клиент подтвердил, что обратился за кредитом под влиянием 3х лиц'
			when decision_code = '100.0814.016' then 'Телефон клиента не существует'
			when decision_code = '100.0201.008' then 'Долг Автокредит БОЛЕЕ 15%'
			when decision_code = '100.0202.003' then 'Имеются просрочки свыше 180 дней'
			when decision_code = '100.0202.005' then 'Текущая просрочка более 5 дней'
			when decision_code = '100.0110.006' then 'Историческая просрочка в компании >180 дней'
			when decision_code = '100.0110.007' then 'Активные клиенты без докреда'
			when decision_code = '100.0110.008' then 'Информация о наличии обращений КарМани в суд по клиенту'
			when decision_code = '100.0110.009' then 'Активные клиенты с красным предложением докреда'
			when decision_code = '100.0110.010' then 'Предыдущий займ открыт < 35 дней (для докредов)'
			when decision_code = '100.0120.006' then 'Активный клиент с недавно открытым договором с просрочкой и небольшая возможная сумма займа'
			when decision_code = '100.0120.008' then 'Активный договор беззалога'
			when decision_code = '100.0224.002' then 'Не подходит под условия докредитования/параллельный займ'
			when decision_code = '100.0112.003' then 'Подозрение в мошенничестве: другой человек в предыдущих заявках'
			when decision_code = '100.0112.004' then 'Ранее был отказ в течении 7 дней'
			when decision_code = '100.0203.001' then 'Подозрение в мошенничестве '
			when decision_code = '100.0203.006' then 'Текущая просрочка в Кармани у родственника'
			when decision_code = '100.0701.003' then 'У клиента есть активная одобренная заявка'
			when decision_code = '100.0701.004' then 'У клиента есть активный кредитный договор'
			when decision_code = '100.0802.003' then 'Подозрение в мошенничестве '
			when decision_code = '100.0802.004' then 'Текущая просрочка в Кармани у родственника'
			when decision_code = '100.0215.002' then 'Отказать'
			when decision_code = '100.0101.002' then 'Подозрение на подделку документов/фотошоп/непрофильные фото'
			when decision_code = '100.0101.003' then 'Расхождение данных в документах'
			when decision_code = '100.0101.004' then 'Документы недействительны, требуют замены'
			when decision_code = '100.0121.002' then 'Совпадение с базой мошенников '
			when decision_code = '100.0122.002' then 'Подозрение на подделку документов/фотошоп'
			when decision_code = '100.0122.003' then 'Фото клиента не соответствует фото в паспорте'
			when decision_code = '100.0706.002' then 'Совпадение с базой мошенников '
			when decision_code = '100.0707.002' then 'Подозрение на подделку документов/фотошоп'
			when decision_code = '100.0707.003' then 'Фото клиента не соответствует фото в паспорте'
			when decision_code = '100.0102.002' then 'ПТС взамен утраченного/утерянного менее 45 дней назад'
			when decision_code = '100.0016.003' then 'Паспорт не соответсвует маске (Дбрейн)'
			when decision_code = '100.0100.001' then 'Регион регистрации не удовлетворяет требованиям'
			when decision_code = '100.0100.002' then 'Возраст не удовлетворяет требованиям'
			when decision_code = '100.0100.003' then 'Паспорт недействителен'
			when decision_code = '100.0100.005' then 'Срок действия паспорта истек'
			when decision_code = '100.0100.041' then 'Регион проживания не удовлетворяет требованиям'
			when decision_code = '100.0100.113' then 'Паспорт недействителен'
			when decision_code = '100.0103.012' then 'Возраст клиента не соответствует требованиям'
			when decision_code = '100.0103.013' then 'У заявителя нет ТС в собственности'
			when decision_code = '100.0106.002' then 'Регион фактического проживания вне списка допустимых регионов'
			when decision_code = '100.0109.002' then 'Прописка нет /Фактический да (не  соответствует списку регионов расширения ) '
			when decision_code = '100.0109.004' then 'Прописка нет/Фактический нет '
			when decision_code = '100.0109.005' then 'Прописка да /Фактический нет '
			when decision_code = '100.0110.005' then 'Красная зона без CRM-предложений'
			when decision_code = '100.0120.101' then 'Активный кредитный продукт'
			when decision_code = '100.0160.000' then 'Сегмент Испытательный срок и б/у Авто'
			when decision_code = '100.0709.002' then 'Адрес фактического места жительства не соответствует минимальным требованиям'
			when decision_code = '100.0712.002' then 'Возраст клиента не соответствует требованиям'
			when decision_code = '100.0712.003' then 'Адрес регистрации вне зоны присутствия бизнеса'
			when decision_code = '100.0090.002' then 'Авто под обременением (реестр залогов)'
			when decision_code = '100.0103.004' then 'Коммерческий транспорт (желтые номера)'
			when decision_code = '100.0103.006' then 'Отечественные авто (категория B), возраст более 13 лет'
			when decision_code = '100.0103.007' then 'Иностранные авто (категория B), возраст более 20 лет'
			when decision_code = '100.0103.008' then 'Газель, Соболь (грузовая) категории В, возраст  более 11 лет'
			when decision_code = '100.0103.009' then 'ТС категории А, прицеп'
			when decision_code = '100.0103.011' then 'Самоходная машина, возраст более 25 лет'
			when decision_code = '100.0205.002' then 'Авто в залоге '
			when decision_code = '100.0214.001' then 'Авто с серьезными повреждениями / не на ходу'
			when decision_code = '100.0214.004' then 'Авто с низкой ликвидностью'
			when decision_code = '100.0214.006' then 'Авто не проходит на минимальную сумму кредита'
			when decision_code = '100.0235.004' then 'ТС было в тотале восстановлено'
			when decision_code = '100.0490.002' then 'Авто под обременением (реестр залогов)'
			when decision_code = '100.0123.007' then 'Условия рефинансируемого договора не соответствуют требованиям по продукту'
			when decision_code = '100.0060.015' then 'Просрочка >=30 дней и [сумма просрочки > 50 000 или (Кол-во счето в прорсочке >=4 и доля счетов в просрочке >=50%)] (ЭКС и НБКИ)'
			when decision_code = '100.0060.018' then 'Доля просроченных займов и микрокредит или сумма просрочки (ЭКС и НБКИ)'
			when decision_code = '100.0060.107' then 'Банкротство'
			when decision_code = '100.0060.118' then 'Доля просроченных займов и микрокредит или сумма просрочки (ЭКС и НБКИ)'
			when decision_code = '100.0061.001' then 'Более 10 счетов клиента в просрочке'
			when decision_code = '100.0061.002' then 'Новый клиент И Более 20 активных кредитов (стандартная воронка)'
			when decision_code = '100.0061.003' then 'Более 10 счетов клиента в просрочке НБКИ'
			when decision_code = '100.0061.004' then 'Новый клиент И Более 20 активных кредитов НБКИ И  НЕ расширенная воронка'
			when decision_code = '100.0061.015' then 'Просрочка >=30 дней НБКИ И [ Сумма просроченных платежей НБКИ > 50 000 ИЛИ (Кол-во счетов в просрочке НБКИ >=4 И доля счетов в просрочке НБКИ >=50%) ]  (стандартная воронка)'
			when decision_code = '100.0061.016' then '([OKB score <480 И Есть микрокредит И доля просроченных договоров >0,163] ИЛИ сумма просроченных договоров >=50 000) (стандартная воронка)'
			when decision_code = '100.0061.017' then '([OKB score <500 И Есть микрокредит НБКИ И доля просроченных договоров НБКИ >0,163] ИЛИ сумма просроченных договоров НБКИ >=50 000) (стандартная воронка)'
			when decision_code = '100.0760.015' then 'Просрочка >=30 дней И [ Сумма просроченных платежей > 90 000 ИЛИ (Кол-во счетов в просрочке >=7 И доля счетов в просрочке >=50%) ] (оверрайдная воронка)'
			when decision_code = '100.0761.002' then '[ (OKB score < 460 И  у клиента более 24 активных кредитов) ИЛИ (OKB score [460; 540) И у клиента более 34 активных кредитов) ИЛИ (OKB score >= 540 И у клиента более 54 активных кредитов)] И оверрайдная воронка'
			when decision_code = '100.0761.016' then '([OKB score <460 И Есть микрокредит И доля просроченных договоров >0,2] ИЛИ сумма просроченных договоров >=80 000) И оверрайдная воронка'
			when decision_code = '100.0960.015' then 'Просрочка >=30 дней И [ Сумма просроченных платежей > 80 000  ИЛИ (Кол-во счетов в просрочке >=5 И доля счетов в просрочке >=50%) ] (расширенная воронка)'
			when decision_code = '100.0961.002' then '[ (OKB score < 500 И  у клиента более 24 активных кредитов) ИЛИ (OKB score [500; 580) И у клиента более 34 активных кредитов) ИЛИ (OKB score >= 580 И у клиента более 54 активных кредитов)] И расширенная воронка'
			when decision_code = '100.0961.004' then '[ (OKB score < 500 И  у клиента более 24 активных кредитов НБКИ) ИЛИ (OKB score [500; 580) И у клиента более 34 активных кредитов НБКИ) ИЛИ (OKB score >= 580 И у клиента более 54 активных кредитов НБКИ)] И расширенная воронка'
			when decision_code = '100.0961.015' then 'Просрочка НКБИ >=30 дней И [ Сумма просроченных платежей НБКИ > 80 000  ИЛИ (Кол-во счетов в просрочке НБКИ >=5 И доля счетов в просрочке НБКИ >=50%) ] И расширенная воронка'
			when decision_code = '100.0961.016' then '([OKB score <480 И Есть микрокредит И доля просроченных договоров >0,2] ИЛИ сумма просроченных договоров >=80 000) И расширенная воронка'
			when decision_code = '100.0961.017' then '([OKB score <500 И Есть микрокредит НБКИ И доля просроченных договоров НБКИ >0,2] ИЛИ сумма просроченных договоров НБКИ >=80 000) И расширенная воронка'
			when decision_code = '200.0060.015' then 'Просрочка >=30 дней и [сумма просрочки > 50 000 или (Кол-во счето в прорсочке >=4 и доля счетов в просрочке >=50%)] (ЭКС)'
			when decision_code = '200.0060.018' then 'Доля просроченных займов и микрокредит или сумма просрочки (ЭКС)'
			when decision_code = '200.0060.107' then 'Банкротство'
			when decision_code = '200.0060.118' then 'Доля просроченных займов и микрокредит или сумма просрочки (ЭКС)'
			when decision_code = '200.0061.001' then 'Более 10 договоров в просрочке ЭКС'
			when decision_code = '200.0061.002' then 'Новый клиент И более 20 активных кредитов ЭКС И НЕ расширенная воронка'
			when decision_code = '200.0061.016' then '([OKB score <480 И Есть микрокредит ЭКС И доля просроченных договоров ЭКС >0,163] ИЛИ сумма просроченных договоров ЭКС >=50 000) (стандартная воронка)'
			when decision_code = '200.0760.015' then 'Просрочка >=30 дней по данным одного из БКИ И [ Сумма просроченных платежей > 90 000 ИЛИ (Кол-во счетов в просрочке >=7 И доля счетов в просрочке >=50%) ] И оверрайдная воронка'
			when decision_code = '200.0761.002' then '[ (OKB score < 460 И  у клиента более 24 активных кредитов ЭКС) ИЛИ (OKB score [460; 540) И у клиента более 34 активных кредитов ЭКС) ИЛИ (OKB score >= 540 И у клиента более 54 активных кредитов ЭКС)] И оверрайдная воронка'
			when decision_code = '200.0761.016' then '([OKB score <460 И Есть микрокредит ЭКС И доля просроченных договоров ЭКС >0,2] ИЛИ сумма просроченных договоров ЭКС >=80 000) И оверрайдная воронка'
			when decision_code = '200.0960.015' then 'Просрочка >=30 дней ЭКС И [Сумма просроченных платежей ЭКС > 80 000  ИЛИ (Кол-во просроченных счетов ЭКС >=5 И доля просроченных счетов в просрочке ЭКС >=50%) ] И расширенная воронка)'
			when decision_code = '200.0961.002' then '[ (OKB score < 500 И  у клиента более 24 активных кредитов ЭКС) ИЛИ (OKB score [500; 580) И у клиента более 34 активных кредитов ЭКС) ИЛИ (OKB score >= 580 И у клиента более 54 активных кредитов ЭКС)] И расширенная воронка'
			when decision_code = '200.0961.016' then '([OKB score <480 И Есть микрокредит ЭКС И доля просроченных договоров ЭКС >0,2] ИЛИ сумма просроченных договоров ЭКС >=80 000) И расширенная воронка'
			when decision_code = '100.0090.003' then 'Авто в розыске'
			when decision_code = '100.0406.002' then 'Ограничение на автомобиль по данным ГИБДД и задолженность/исполнительное производство по данным ФССП'
			when decision_code = '100.0406.007' then 'Негативные факторы (дубликат ПТС и частая смена собственников и недавняя регистрация)'
			when decision_code = '100.0406.008' then 'Авто постановлено на учет в день обращения или позднее (сравнение даты постановки на учет из заявки с датой заявки)'
			when decision_code = '100.0406.010' then 'ТС снято с учета'
			when decision_code = '100.0480.001' then 'Ограничение на автомобиль по данным ГИБДД и по данным ФССП есть ИП, закрытое по ст. 46 в последние 6 мес'
			when decision_code = '100.0080.005' then 'Конфискация по УКРФ, а также иные типы Конфискаций'
			when decision_code = '100.0080.006' then 'Сумма ИП по обязательствам кредитного характера >50 000 руб'
			when decision_code = '100.0080.007' then 'Общая задолженность по исполнительным производствам превышает 300 000 рублей'
			when decision_code = '100.0081.006' then 'Сумма ИП по обязательствам кредитного характера > 0 (стандартная воронка)'
			when decision_code = '100.0081.007' then 'Общая задолженность по исполнительным производствам ФССП превышает >50000 (стандартная воронка)'
			when decision_code = '100.0081.008' then 'Есть ИП, закрытые в связи с невозможностью взыскания в течение последнего года'
			when decision_code = '100.0781.006' then 'Сумма ИП по обязательствам кредитного характера > 50 000 И оверрайдная воронка'
			when decision_code = '100.0781.007' then 'Оббщая задолженность по исполнительным производствам ФССП превышает 120 000 рублей И оверрайдная воронка'
			when decision_code = '100.0981.006' then 'Сумма ИП по обязательствам кредитного характера > 20 000 И расширенная воронка'
			when decision_code = '100.0981.007' then 'Оббщая задолженность по исполнительным производствам ФССП превышает 80 000 рублей И расширенная воронка'
			when decision_code = '100.0070.002' then 'Черный список ФЛ (внутренний и Финмониторинг)'
			when decision_code = '100.0110.011' then 'Максимальная историческая просрочка клиента по Installment (при наличии) >45 дней ИЛИ Максимальная историческая просрочка клиента по ПТС >90 дней'
			when decision_code = '100.0120.001' then 'Повторное обращение после жесткого отказа по клиенту (cooling 30 дней)'
			when decision_code = '100.0120.002' then 'Повторное обращение после жесткого отказа по машине (cooling 30 дней)'
			when decision_code = '100.0120.004' then 'Более 3х заявок в день'
			when decision_code = '100.0120.071' then 'Отказ по повторному обращению в течение 7 дней после отказа по клиенту (cooling 7 дней)'
			when decision_code = '100.0120.072' then 'Отказ по повторному обращению в течение 7 дней после отказа по машине (cooling 7 дней)'
			when decision_code = '100.0120.091' then 'Отказ по повторному обращению в течение 90 дней после жесткого отказа по клиенту (cooling 90 дней)'
			when decision_code = '100.0120.092' then 'Повторное обращение после жесткого отказа по машине (cooling 90 дней)'
			when decision_code = '100.0120.102' then 'Отказ по перезаводам: более 3х отказных заявок в день'
			when decision_code = '100.0120.104' then 'Отказ по перезаводам: более 5ти заявок в день'
			when decision_code = '100.0070.107' then 'Сервис kad.arbitr вернул информацию о наличии банкротного дела по Заявителю (поиск по ИНН)'
			when decision_code = '100.0070.207' then 'Банкротство'
			when decision_code = '100.0082.001' then 'Заявитель в Федеральном розыске'
			when decision_code = '100.0070.007' then 'Банкротство'
			when decision_code = '100.0080.008' then 'Обращение взыскания на заложенное имущество'
			when decision_code = '100.0124.002' then 'Много документов не с оригинала'
			when decision_code = '100.0124.003' then 'Партнерская заявка - типаж БОМЖ, ЦЫГАНЕ, НАРКОМАН'
			when decision_code = '100.0124.004' then 'Фото документов скачены из интернета'
			when decision_code = '100.0213.004' then 'Другое'
			when decision_code = '100.0213.006' then 'Инвалидность (нерабочая группа)'
			when decision_code = '100.0213.007' then 'Ранее был отказ в течение 7 дней'
			when decision_code = '100.0213.009' then 'Подозрение в мошенничестве: геолокация'
			when decision_code = '100.0213.011' then 'Негатив по соц. сетям (алкоголик, наркоман и прочее)'
			when decision_code = '100.0213.012' then 'Негатив по соц сетям - подписан на запрещенные сообщества'
			when decision_code = '100.0213.013' then 'Типаж БОМЖ, ЦЫГАНЕ, НАРКОМАН'
			when decision_code = '100.0213.014' then 'Занятость не удовлетворяет требованиям'
			when decision_code = '100.0213.015' then 'Сегодня оформлен займ, VIN совпадает'
			when decision_code = '100.0213.016' then 'Вне зоны действия бизнеса проживает/ работает'
			when decision_code = '100.0213.017' then 'Клиент выдает себя за 3е лицо'
			when decision_code = '100.0213.018' then 'Подозрение на подделку документов/фотошоп'
			when decision_code = '100.0815.002' then 'Инвалидность (нерабочая группа)'
			when decision_code = '100.0815.003' then 'Негатив по соц. сетям (алкоголик, наркоман и прочее)'
			when decision_code = '100.0815.004' then 'Негатив по соц сетям - подписан на запрещенные сообщества'
			when decision_code = '100.0815.005' then 'Есть активный кредитный договор'
			when decision_code = '100.0815.007' then 'Есть активная одобренная заявка'
			when decision_code = '100.0815.008' then 'Типаж БОМЖ, ЦЫГАНЕ'
			when decision_code = '100.0815.009' then 'Подозрение в мошенничестве: геолокация'
			when decision_code = '100.0815.010' then 'Занятость не удовлетворяет требованиям'
			when decision_code = '100.0815.011' then 'Вне зоны действия бизнеса проживает/ работает'
			when decision_code = '100.0815.012' then 'Клиент выдает себя за 3е лицо'
			when decision_code = '100.0815.013' then 'Подозрение на подделку документов/фотошоп'
			when decision_code = '100.0051.004' then 'Нет кредитной истории И QIWI скор > 0.42'
			when decision_code = '100.0051.001' then 'Новый клиент И ОКБ<410 (стандартная воронка)'
			when decision_code = '100.0051.002' then 'Повторный клиент И ОКБ<410'
			when decision_code = '100.0751.001' then 'ОКБ<390 (оверрайдная воронка)'
			when decision_code = '100.0951.001' then 'ОКБ<410 И расширенная воронка'
			when decision_code = '100.0130.001' then 'Максимально возможная сумма кредита <50 000 руб.'
			when decision_code = '100.0130.003' then 'Максимально возможная сумма кредита <50 000 руб.'
			when decision_code = '100.0130.021' then 'Нет ни одного предложения без комиссионных продуктов'
			when decision_code = '100.0130.041' then 'Нет ни одного предложения без комиссионных продуктов'
			when decision_code = '100.0131.001' then 'Максимально возможный лимит 0'
			when decision_code = '100.0131.002' then 'входящий DTI >= cut_off (зависит от типа клиента)'
			when decision_code = '100.0210.004' then 'Рабочий телефон кукушка'
			when decision_code = '100.0210.005' then 'Негативная информация от работодателя '
			when decision_code = '100.0210.006' then 'Занятость опровергли /не работает / уволили'
			when decision_code = '100.0206.002' then 'Ограничения ТС по клиенту=собственнику из списка'
			when decision_code = '100.0206.004' then 'Ограничения на ТС по прошлому собственнику из списка'
			when decision_code = '100.0206.005' then 'ЗАЛОГ был в тотале восстановлен'
			when decision_code = '100.0206.006' then 'ТС в угоне/розыске'
			when decision_code = '100.0206.007' then 'Совокупность условных негативов'
			when decision_code = '100.0206.008' then 'Постановка авто день в день'
			when decision_code = '100.0206.010' then 'ТС снято с учета'
			when decision_code = '100.0708.003' then 'Фамилия и/или имя на карте (в заявке) не соответствуют данным паспорта'
			when decision_code = '100.0114.002' then 'Документы недействительны, требуют замены'
			when decision_code = '100.0114.003' then 'Паспорт иностранного государства'
			when decision_code = '100.0114.004' then 'Подозрение на подделку документов/фотошоп'
			when decision_code = '100.0115.002' then 'Адрес регистрации не соответствует минимальным требованиям/отсутствует'
			when decision_code = '100.0115.003' then 'Документы недействительны, требуют замены'
			when decision_code = '100.0115.004' then 'Подозрение на подделку документов/фотошоп'
			when decision_code = '100.0116.002' then 'Документы недействительны, требуют замены'
			when decision_code = '100.0116.003' then 'Подозрение на подделку документов/фотошоп'
			when decision_code = '100.0702.002' then 'Документы недействительны, требуют замены'
			when decision_code = '100.0702.003' then 'Расхождение данных в документах'
			when decision_code = '100.0702.004' then 'Фото не с оригинала документа '
			when decision_code = '100.0702.005' then 'Подозрение на подделку документов/фотошоп'
			when decision_code = '100.0702.006' then 'Паспорт иностранного государства'
			when decision_code = '100.0703.002' then 'Адрес регистрации не соответствует минимальным требованиям/отсутствует'
			when decision_code = '100.0703.003' then 'Документы недействительны, требуют замены'
			when decision_code = '100.0703.004' then 'Расхождение данных в документах'
			when decision_code = '100.0703.005' then 'Фото не с оригинала документа '
			when decision_code = '100.0703.006' then 'Подозрение на подделку документов/фотошоп'
			when decision_code = '100.0204.002' then 'Анкета найдена, есть негатив из списка'
			when decision_code = '100.0117.003' then 'ПТС взамен утраченного/утерянного менее 45 дней назад'
			when decision_code = '100.0117.004' then 'Некорректный VIN, номер кузова в ПТС или отсутствует'
			when decision_code = '100.0117.005' then 'Клиент не является собственником авто'
			when decision_code = '100.0117.006' then 'Подозрение на подделку документов/фотошоп'
			when decision_code = '100.0212.001' then 'Негативная информация, компания ликвидирована, банкрот'
			when decision_code = '100.0230.009' then 'Негативная информация от работодателя '
			when decision_code = '100.0230.010' then 'Занятость опровергли /не работает / уволили'
			when decision_code = '100.0231.008' then 'Негативная информация - компания не работает/фиктивная компания'
			when decision_code = '100.0232.010' then 'Негативная информация от работодателя '
			when decision_code = '100.0232.011' then 'Занятость опровергли /не работает / уволили'
			when decision_code = '100.0233.010' then 'Негативная информация от работодателя '
			when decision_code = '100.0233.011' then 'Занятость опровергли /не работает / уволили'
			when decision_code = '100.0808.005' then 'Негативная информация, компания ликвидирована, банкрот'
			when decision_code = '100.0809.007' then 'Декрет '
			when decision_code = '100.0809.008' then 'Негативная информация от работодателя '
			when decision_code = '100.0809.010' then 'Занятость опровергли /не работает / уволили'
			when decision_code = '100.0810.007' then 'Негативная информация - компания не работает/фиктивная компания'
			when decision_code = '100.0811.008' then 'Декрет '
			when decision_code = '100.0811.009' then 'Негативная информация от работодателя '
			when decision_code = '100.0811.010' then 'Занятость опровергли /не работает / уволили'
			when decision_code = '100.0812.006' then 'Телефон не актуален'
			when decision_code = '100.0812.007' then 'Телефон принадлежит другой компании'
			when decision_code = '100.0812.008' then 'Декрет '
			when decision_code = '100.0812.009' then 'Негативная информация от работодателя '
			when decision_code = '100.0812.010' then 'Занятость опровергли /не работает / уволили'
			when decision_code = '100.0118.002' then 'Некорректный VIN, номер кузова в ПТС или отсутствует (для ЭПТС)'
			when decision_code = '100.0118.003' then 'Подозрение на подделку документов/фотошоп'
			when decision_code = '100.0301.002' then 'Автомобиль с серьезными повреждениями кузова/Ошибки на приборке/Тс не на ходу'
			when decision_code = '100.0301.003' then 'Признаки исправления подручными средствами VIN кода /маркировочных таблиц'
			when decision_code = '100.0301.004' then 'ТС с низкой ликвидностью '
			when decision_code = '100.0301.005' then 'Прочий негатив'
			when decision_code = '100.0301.006' then 'Фотошоп фото автомобиля'
			when decision_code = '100.0302.005' then 'Инвалидность (нерабочая группа)'
			when decision_code = '100.0302.006' then 'Клиент "Олень" (приведен 3-ми лицами)'
			when decision_code = '100.0302.007' then 'Визуальный андеррайтинг клиента.  Клиент не подходит по статусу ТС (дорогое авто и неопрятный человек, алкоголик итд)'
			when decision_code = '100.0302.008' then 'Фотошоп фото клиента'
			when decision_code = '100.0302.009' then 'Фото в паспорте не соответствует фото клиента/фото клиента на фоне авто'
			when decision_code = '100.0302.010' then 'Типаж БОМЖ, ЦЫГАНЕ, НАРКОМАН'
			when decision_code = '100.0302.011' then 'КОБАЛЬТ - совпадение с базой мошенников'
			when decision_code = '100.0221.002' then 'Регион проживания клиента отсутствует в списке допустимых'
			when decision_code = '100.0221.003' then 'Регион авто не соответствует региону прописки клиента'
			when decision_code = '100.0110.902' then 'Регион проживания клиента отсутствует в списке допустимых'
			when decision_code = '100.0110.903' then 'Регион авто не соответствует региону прописки клиента'
			when decision_code = '100.0216.006' then 'Лимит по оценке верификатора ниже текущей задолженности в справке'
			when decision_code = '100.0216.007' then 'Клиент не удовлетворяет требованиям по рефинансированию'
			when decision_code = '100.9999.999' then 'Отказ по списку заявок'
			when decision_code = '100.0710.002' then 'Подозрение на подделку/фотошоп'
			when decision_code = '100.0120.903' then 'Фото клиента не соответствует фото клиента с паспортом (другой человек на фото с паспортом)'
			when decision_code = '100.0120.904' then 'Подозрение на подделку документов/фотошоп'
			when decision_code = '100.0120.905' then 'Типаж БОМЖ, ЦЫГАНЕ, НАРКОМАН'
			when decision_code = '100.0120.906' then 'Непрофильное фото'
			when decision_code = '100.0120.907' then 'Фото сделано с экрана/взято из соц.сетей'
			when decision_code = '100.0705.002' then 'Фото клиента не соответствует фото клиента с паспортом (другой человек на фото с паспортом)'
			when decision_code = '100.0705.003' then 'Подозрение на подделку документов/фотошоп'
			when decision_code = '100.0705.004' then 'Типаж БОМЖ, ЦЫГАНЕ'
			when decision_code = '100.0705.005' then 'Непрофильное фото'
			when decision_code = '100.0705.006' then 'Фото с экрана/фотокопии'
			when decision_code = '100.0119.003' then 'Фото клиента не соответствует фото в паспорте'
			when decision_code = '100.0119.004' then 'Фото не с оригинала документа '
			when decision_code = '100.0119.005' then 'Подозрение на подделку документов/фотошоп'
			when decision_code = '100.0704.002' then 'Фото клиента не соответствует фото в паспорте'
			when decision_code = '100.0704.003' then 'Фото не с оригинала документа '
			when decision_code = '100.0704.004' then 'Подозрение на подделку документов/фотошоп'
			when decision_code = '100.0218.001' then 'Кредитные платежи более 50 000'
			when decision_code = '100.0218.002' then 'Любая задолженность  свыше 300 000'
			when decision_code = '100.0801.004' then 'Наличие задолженности по обязательствам кредитного характера (любая сумма)'
			when decision_code = '100.0801.005' then 'Задолженность по всем обязательствам свыше 50 000 руб.'
			when decision_code = '100.0801.006' then 'Обращение взыскания (арест) на имущество Заявителя/наличие уголовной статьи'
			when decision_code = '100.0801.007' then 'Наличие ИП, закрытых по ст. 46.1.3, 46.1.4, в течение последнего года'
			when decision_code is not null then 'что-то'
			else 'Потеряшки'
		end as Decision_description_detal
		,APR						--
		,ProductTypeCode
		,ProductTypeCode_real
		,declineOverrideCategory
	into #smpl
	from stg._loginom.originationlog with(nolock)
	where	call_date >= @Date_rep 
			and (
				number<>'19061300000088' 
				and number <> '19061300000089' 
				and number <> '20101300041806' 
				and number <> '21011900071506' 
				and number <> '21011900071507'
				)
			and username = 'service'
	;


drop table if exists #app_ls;
select number
		,leadsource
		,request_amount
		,row_number() over (partition by number order by Stage_date DESC) as rn
	into #app_ls
	from stg._loginom.application with (nolock)  
	where number in (select distinct number from #smpl)
		and Stage = 'Call 1'



		
--2. расчетные показатели по заявке и входящий DTI
drop table if exists #calc_lim_call_1;
select *
		,case
			when incoming_DTI is null 
				then '00.нд'
			when incoming_DTI < 0.5
				then '01.[0; 0,5)'
			when incoming_DTI >= 0.5
					and incoming_DTI < 0.8
				then '02.[0,5; 0,8)'
			when incoming_DTI >= 0.8
				then '03.[0,8; inf)'
			else '11.error'
		end as incoming_DTI_group
		,row_number() over (partition by number, stage order by call_date DESC) as rn
	into #calc_lim_call_1
	from stg._loginom.calculated_term_and_amount_installment with (nolock)  
	where number in (select distinct number from #smpl)
		and Stage in ('Call 1', 'Call 2')

--5. Соберем общий датасет БЕЗ ДУБЛЕЙ
drop table if exists #stages;
select 
--		ag.guid
--		,
		num.number
--		,cast(isnull(c1.call_date, pre.call_date) as smalldatetime) as call_date
		,cast(c1.call_date as smalldatetime) as call_date
		,c1.client_type_1
		,declineOverrideCategory
		,case 
			when c5.Decision_Code  is not null then c5.Decision_Code
			when c3.Decision_Code  is not null then c3.Decision_Code
			when c2.Decision_Code  is not null then c2.Decision_Code
			when c15.Decision_Code is not null then c15.Decision_Code
			when c12.Decision_Code is not null then c12.Decision_Code
			when c1.Decision_Code is not null then c1.Decision_Code
			else ''
--			else pre.Decision_Code
		end as Decision_Code
		,case 
			when c5.decision = 'Accept' then 'Одобрено'
			when c5.Decision_description  is not null then c5.Decision_description
			when c3.Decision_description  is not null then c3.Decision_description
			when c2.Decision_description  is not null then c2.Decision_description
			when c15.Decision_description is not null then c15.Decision_description
			when c12.Decision_description is not null then c12.Decision_description
			when c1.Decision_description is not null then c1.Decision_description
--			when pre.Decision_description is not null then pre.Decision_description
			else 'потеряшки'
		end as Decision_description		
				,case 
			when c5.decision = 'Accept' then 'Одобрено'
			when c5.Decision_description_detal  is not null then c5.Decision_description_detal
			when c3.Decision_description_detal  is not null then c3.Decision_description_detal
			when c2.Decision_description_detal  is not null then c2.Decision_description_detal
			when c15.Decision_description_detal is not null then c15.Decision_description_detal
			when c12.Decision_description_detal is not null then c12.Decision_description_detal
			when c1.Decision_description_detal is not null then c1.Decision_description_detal
--			when pre.Decision_description_detal is not null then pre.Decision_description_detal
			else 'потеряшки'
		end as Decision_description_detal	
		,cl.incoming_DTI_group
		,ls.leadsource
		,case
				when ls.leadsource = 'bankiru-installment-ref' or ls.leadsource = 'bankiru-deepapi' then 'Банки ру'
				else 'Другие'
			end as Banki_ru
--CALL 1
		,case
			when c1.number is not null then 1
			else 0
		end as Call1_incoming
		,case
			when c1.decision = 'Accept' then 1
			else 0
		end as Call1_accept
--CALL 1.2
		,case
			when c12.number is not null then 1
			else 0
		end as Call12_incoming
		,case
			when c12.decision = 'Accept' then 1
			else 0
		end as Call12_accept
		,c12.fl_autoapp_JS
--CALL 1.5
		,case
			when c15.number is not null then 1
			else 0
		end as Call15_incoming
		,case
			when c15.decision = 'Accept' then 1
			else 0
		end as Call15_accept
--CALL 2
		,case
			when c2.number is not null then 1
			else 0
		end as Call2_incoming
		,case
			when c2.decision = 'Accept' then 1
			else 0
		end as Call2_accept
--CALL 3
		,case
			when c3.number is not null then 1
			else 0
		end as Call3_incoming
		,case
			when c3.decision = 'Accept' then 1
			else 0
		end as Call3_accept
--CALL 5
		,case
			when c5.number is not null then 1
			else 0
		end as Call5_incoming
		,case
			when c5.decision = 'Accept' then 1
			else 0
		end as Call5_accept
		,case when cr.external_id is not null then 1 else 0 end as fl_loan
		,case when cr.external_id is not null then cast(cr.amount as float) else 0 end as loan_amount
		,case 
			when c5.productTypeCode  is not null then c5.productTypeCode
			when c3.productTypeCode  is not null then c3.productTypeCode
			when c2.productTypeCode  is not null then c2.productTypeCode
			when c15.productTypeCode is not null then c15.productTypeCode
			when c12.productTypeCode is not null then c12.productTypeCode
			else c1.productTypeCode
		end as product
		,ls.Request_amount
		,cr.pdn as pdn_fact
		, case
				when cr.pdn <= 0.5
					then '1. <=0,5]'
				when cr.pdn > 0.5 and cr.pdn <= 0.8
					then '2. 0,5 - 0,8]'
				when cr.pdn > 0.8
					then '3. > 0,8'
				else 'Ошибка'
			end as pdn_fact_bucket
			,[Дубль]
	into #stages
	from 
	(select distinct /*tmp.guid, */tmp.number ,[Дубль]
						from #smpl as tmp
							left join reports.dbo.dm_Factor_Analysis as dbl
								on tmp.number = dbl.[Номер]
						where tmp.Is_installment=1 
							and tmp.stage = 'Call 1' 
--							and tmp.call_date >= @Date_rep
							--and dbl.[Дубль] = 0
					) as num
--CALL 1
			left join 
					(select number
							,stage
							,call_date
							,decision
							,Decision_Code
							,Decision_description
							,Decision_description_detal
							,declineOverrideCategory
							,client_type_1
							,productTypeCode
							,row_number() over(partition by number order by call_date DESC) as rn
						from #smpl
						where stage = 'Call 1'
					) as c1
				on num.number = c1.number
					and c1.rn = 1
--CALL 1.2
			left join 
					(select number
							,stage
							,decision
							,Decision_Code
							,Decision_description
							,Decision_description_detal
							,productTypeCode
							,case 
									when Decision = 'Accept' and Next_step = 'Call 5' then 1 
									else 0 
								end as fl_autoapp_JS
							,row_number() over(partition by number order by call_date DESC) as rn
						from #smpl
						where stage = 'Call 1.2'
					) as c12
				on num.number = c12.number
					and c12.rn = 1
--CALL 1.5
			left join 
					(select number
							,stage
							,decision
							,Decision_Code
							,Decision_description
							,Decision_description_detal
							,productTypeCode
							,row_number() over(partition by number order by call_date DESC) as rn
						from #smpl
						where stage = 'Call 1.5'
					) as c15
				on num.number = c15.number
					and c15.rn = 1
--CALL 2
			left join 
					(select number
							,stage
							,decision
							,Decision_Code
							,Decision_description
							,Decision_description_detal
							,productTypeCode
							,row_number() over(partition by number order by call_date DESC) as rn
						from #smpl
						where stage = 'Call 2'
					) as c2
				on num.number = c2.number
					and c2.rn = 1
--CALL 3
			left join 
					(select number
							,stage
							,decision
							,Decision_Code
							,Decision_description
							,Decision_description_detal
							,productTypeCode
							,row_number() over(partition by number order by call_date DESC) as rn
						from #smpl
						where stage = 'Call 3'
					) as c3
				on num.number = c3.number
					and c3.rn = 1
--CALL 5
			left join 
					(select number
							,stage
							,decision
							,Decision_Code
							,Decision_description
							,Decision_description_detal
							,productTypeCode
							,row_number() over(partition by number order by call_date DESC) as rn
						from #smpl
						where stage = 'Call 5'
					) as c5
				on num.number = c5.number
					and c5.rn = 1
--выдачи
			left join dwh2.risk.credits as cr with(nolock)
				on num.Number = cr.external_id
							left join #app_ls as ls
				on num.number = ls.number
					and ls.rn = 1
								left join #calc_lim_call_1 as cl
				on num.Number = cl.Number
					and cl.rn = 1
					and cl.stage = 'Call 1'
			left join #calc_lim_call_1 as cl2
				on num.Number = cl2.Number
					and cl2.rn = 1
					and cl2.stage = 'Call 2'


drop table if exists #stage1;
--6. Итогвый датасет дял построения отчета
select 
		datepart(ww, call_date) as week_of_year
		,concat( format( DATEADD(d, 1 - DATEPART(w, call_date), call_date), 'dd.MM' ), ' - ' ,-- Начало недели (понедельник)
FORMAT(DATEADD(day,6,DATEADD(d, 1 - DATEPART(w, call_date), call_date)), 'dd.MM')) AS [week]   -- Конец недели (воскресенье)

--		,guid
		,number
		,product
		,cast(call_date as date) as dt
		,call_date
		,Decision_Code
		,case when Call5_accept=1 then 'Одобрено' else Decision_description end as Decision_description
		,case when Call5_accept=1 then 'Одобрено' else Decision_description_detal end as Decision_description_detal
		,incoming_DTI_group
		,client_type_1
		,leadsource
		,Banki_ru
		,case
				when leadsource = 'bankiru-installment-ref' then 'Old'
				when leadsource = 'bankiru-deepapi' then 'API'
				else ''
			end as Banki_Type
		,pdn_fact_bucket
--		,sum(Precall_incoming) as Precall_incoming
--		,sum(Precall_accept) as Precall_accept
		,sum(Call1_incoming) as Call1_incoming
		,sum(Call1_accept) as Call1_accept
		,sum(Call12_incoming) as Call12_incoming
		,sum(Call12_accept) as Call12_accept
		,sum(Call15_incoming) as Call15_incoming
		,sum(Call15_accept) as Call15_accept
		,sum(Call2_incoming) as Call2_incoming
		,sum(Call2_accept) as Call2_accept
		,sum(Call3_incoming) as Call3_incoming
		,sum(Call3_accept) as Call3_accept
		,sum(Call5_incoming) as Call5_incoming
		,sum(Call5_accept) as Call5_accept
		,sum(fl_loan) as cnt_loan
		,sum(cast(loan_amount as float)) as sum_loans
		,max(call_date) over () as date_upd
/*		,FSSP_CR
		,FSSP_ALL*/
		,[declineOverrideCategory]
		,[Дубль]
	into #stage1
	from #stages
	group by 	
		datepart(ww, call_date)
--		,guid
		,number
		,product
		,call_date
		,cast(call_date as date)
		,Decision_Code
		,Decision_description
		,incoming_DTI_group
		,client_type_1
		,leadsource
		,Banki_ru
		,case
				when leadsource = 'bankiru-installment-ref' then 'Old'
				when leadsource = 'bankiru-deepapi' then 'API'
				else ''
			end 
		,pdn_fact_bucket
		,concat( format( DATEADD(d, 1 - DATEPART(w, call_date), call_date), 'dd.MM' ), ' - ' ,-- Начало недели (понедельник)
FORMAT(DATEADD(day,6,DATEADD(d, 1 - DATEPART(w, call_date), call_date)), 'dd.MM'))
		,case when Call5_accept=1 then 'Одобрено' else Decision_description end
		,[declineOverrideCategory]
		,[Дубль]
		,case when Call5_accept=1 then 'Одобрено' else Decision_description_detal end 
;


	
drop table if exists #add_param;
select distinct  t.number
--		,okbscore
--		,active_summa
--		,active_summa_total
--		,isnull(SUM_DQ_PMTS, SUM_DQ_PMTS_EQUI) as SUM_DQ_PMTS
--		,isnull(CNT_DQ_ACCS, CNT_DQ_ACCS_EQUI) as CNT_DQ_ACCS
--		,isnull(CNT_DQ_ACCS_R, CNT_DQ_ACCS_R_EQUI) as CNT_DQ_ACCS_R
		,case when a.max_CNT_DQ_ACCS=0 then 1 else 0 end as no_daley
--		,case when isnull( max(IsDecl30_any) over( partition by t.number),max(t.IsDecl30_equi) over( partition by t.number)) =0 then 1 else 0 end  as noDecl30_any		--наличие просрочки 30+
--		,micro_ever				--наличие кредитов МФО
--		,Reg_number
--		,Region
--		,rn = row_number() over(partition by number, stage order by call_date)
,fl_check= cast(null as varchar(100))
,bki=1
--,EqxScore= cast( null as int)
	into #add_param
	from Stg._loginom.Origination_equifax_aggregates_4 t with(nolock)
	left join (select distinct t.number, max(CNT_DQ_ACCS) as max_CNT_DQ_ACCS from stg._loginom.originationlog as t with(nolock) 
	join #stage1 a 
	on t.number=a.number
where t.stage in ('Call 1', 'Call 2') and CNT_DQ_ACCS is not null
group by t.number,CNT_DQ_ACCS 
having max(CNT_DQ_ACCS)<1) a
on t.number=a.number
	where t.number in (select distinct number from #stage1)

	/*
isFullAutoApprove на колл 1.2
, IsDocumentalVerification с колл 1
, .auto_approve_fl с колл 2
, sSimplifiedVerification до 15 мая берется с колл 2
. после 15 мая с колл 1
*/
select distinct  t.number
,fl_check= cast(null as varchar(100))
,EqxScore= cast( null as int)
	into #fl_check
	from #stage1 t


update t 
set 
	fl_check= case
when isFullAutoApprove = 1 then 'Автоодобрение'
when o.IsDocumentalVerification = 1 and (isFullAutoApprove = 0 or isFullAutoApprove is null) then 'Проверка документов'
when w.decision = 'Decline' then 'Проверка документов'
when o.IsDocumentalVerification = 0 and o.IsSimplifiedVerification = 1 then 'Упрощенная верификация'
else 'Полная верификация' end 
from #fl_check t
join [Stg].[_loginom].[Originationlog] c with (nolock)
on t.number=c.number
left join (select number, last_name, IsDocumentalVerification, IsSimplifiedVerification, uw_segment, client_type_1 from [Stg].[_loginom].[Originationlog] with (nolock) where stage = 'Call 1' ) o
on o.number = c.number
left join (select number, decision from [Stg].[_loginom].[Originationlog] with (nolock) where stage = 'Call 1.5' ) w
on w.number = c.number
left join (select distinct [Номер заявки], fl_kd = 1 from [reports].[dbo].[dm_FedorVerificationRequests_without_coll] where [Статус] = 'Контроль данных') f
on f.[Номер заявки] = c.number
where call_date >= @Date_rep and is_installment = 1 and stage = 'Call 1.2' and c.decision = 'Accept'
and c.number <> 19061300000088 and upper(o.last_name) not like 'ТЕСТ%' and fl_kd = 1

update t 
set 
	t.EqxScore= a.EqxScore
from #fl_check t
join stg._loginom.originationlog as a with(nolock)
on t.number=a.number
where a.EqxScore is not null

/*
drop table if exists #mpl;
select distinct 
t.dt,t.incoming_DTI_group
,mpl= case when t.incoming_DTI_group='01.[0; 0,5)' then sum(a.sum_loans)*1.0/sum(t.sum_loans) 
 when t.incoming_DTI_group='02.[0,5; 0,8)' then sum(b.sum_loans)*1.0/sum(t.sum_loans) 
 when t.incoming_DTI_group='03.[0,8; inf)' then sum(c.sum_loans)*1.0/sum(t.sum_loans) 
else null end 
	--into #mpl
	from #stage1 t
	left join #stage1 a 
	on t.number =a.number and a.incoming_DTI_group='01.[0; 0,5)'
		left join #stage1 b 
	on t.number =a.number and b.incoming_DTI_group='02.[0,5; 0,8)'
		left join #stage1 c 
	on t.number =a.number and c.incoming_DTI_group='03.[0,8; inf)'
	group by t.dt,t.incoming_DTI_group
*/
--drop table [RiskDWH].risk.v_portfolio_ar_test
--drop table if exists #sum_mpl;
--select distinct 
--t.dt,sum(t.sum_loans) as sum_mpl
--into #sum_mpl
--	from #stage2 t
--	group by t.dt

drop table if exists #stage2;
select t.* 
	, [no_daley] = case when (no_daley=1) and bki =1 then 1 else 0 end
	, [no_daley_apr] = case when (no_daley=1) and Call5_accept= 1 then 1 else 0 end
	, [no_daley_loan] =case when (no_daley=1) and cnt_loan =1  then 1 else 0 end
	, [start_exp_fun] = cast ('20240709' as date)
	, [end_exp_fun] = cast ('20240911' as date)
	, [fl_check] = b.fl_check
	, [bki] = a.bki
	, [EqxScore] = b.EqxScore
--	, [sum_mpl] = c.[sum_mpl]
	, fpd0
	, fpd15
	, fpd30
	, PDLTerm
	,cast(case when fpd0 is not null then 1 else 0 end as int) as fpd0_base
	,cast(case when fpd15 is not null then 1 else 0 end as int) as fpd15_base
	,cast(case when fpd30 is not null then 1 else 0 end as int) as fpd30_base
	,credit_type
	,startdate
	,concat( format( DATEADD(d, 1 - DATEPART(w, startdate), startdate), 'dd.MM' ), ' - ' ,-- Начало недели (понедельник)
FORMAT(DATEADD(day,6,DATEADD(d, 1 - DATEPART(w, startdate), startdate)), 'dd.MM')) AS [week_loan]
	,datepart(ww, startdate) as week_of_year_loan
	,amount
	,cast(case when fpd0 is not null then amount else 0 end  as int) as fpd0_amount
	,cast(case when fpd15 is not null then amount else 0 end as int) as fpd15_amount
	,cast(case when fpd30 is not null then amount else 0 end as int) as fpd30_amount
	,fpd0 * amount as sum_fpd0
	,fpd15 * amount as sum_fpd15
	,fpd30 * amount as sum_fpd30
	,DATEPART(hour, call_date) as call_date_h
	,MAX_CREDIT_LIMIT_INST =cast(null as float)
	,MAX_CREDIT_LIMIT_PDL =cast(null as float)
	,Income_amount =cast(null as float)
	,Request_amount =cast(null as float)
	,Region = cast(null as varchar(100))
	,APR = cast(null as float)
	,case when Call5_accept=1 then 'Одобрено' else Decision_description_detal end as reasonDescription_new
	,case when Call5_accept=1 then 'Одобрено' else category end as category_new
	,case when Call5_accept=1 then 'Одобрено' else checkType end as checkType_new
	into #stage2
from #stage1 t 
left join ( select distinct  t.number,bki,no_daley
		from #add_param t
		join #stage1 a
		on t.number=a.number
		) a
on t.number=a.number
left join ( select distinct  t.number,fl_check,EqxScore
		from #fl_check t
		join #stage1 a
		on t.number=a.number
		) b
on t.number=b.number
--left join ( select distinct  t.dt,sum_mpl
--		from #stage1 t
--		join #sum_mpl a
--		on t.dt=a.dt
--		) c
--on t.dt=c.dt
left join (select t.number,startdate,fpd0, fpd15, fpd30
from [dwh2].[dbo].[dm_OverdueIndicators] t with (nolock) 
join  #stage1 a
		on t.number=a.number) d
on t.number = d.number
left join (select external_id,PDLTerm,credit_type,amount
from dwh2.risk.credits cr with (nolock)
join #stage1 a
		on cr.external_id=a.number
) e
on t.number = e.external_id
left join stg.[_loginom].Origination_dict_reason_codes f with(nolock)
on t.decision_code=f.reasonCode 

update t set
fpd0 =null
,fpd0_base  =null
,sum_fpd0 = null
,fpd0_amount = null
from  #stage2 t
where credit_type = 'PDL' and dateadd(dd, PDLTerm, t.startdate) >getdate()	
or credit_type = 'INST' and dateadd(dd, 14, t.startdate) > getdate()

update t set
fpd15 =null
,fpd15_base  =null
,sum_fpd15 = null
,fpd15_amount = null
from  #stage2 t
where credit_type = 'PDL' and dateadd(dd, PDLTerm+15, t.startdate) >getdate()	
or credit_type = 'INST' and dateadd(dd, 14+15, t.startdate) > getdate()

update t set
fpd30 =null
,fpd30_base  =null
,sum_fpd30 = null
,fpd30_amount = null
from  #stage2 t
where credit_type = 'PDL' and dateadd(dd, PDLTerm+30, t.startdate) >getdate()	
or credit_type = 'INST' and dateadd(dd, 14+30, t.startdate) > getdate()

update t set 
t.MAX_CREDIT_LIMIT_INST =a.MAX_CREDIT_LIMIT_INST 
from  #stage2 t
join stg._loginom.calculated_term_and_amount_installment a with (nolock)
on t.number=a.number
where a.MAX_CREDIT_LIMIT_INST is not null

update t set 
t.MAX_CREDIT_LIMIT_PDL =a.MAX_CREDIT_LIMIT_PDL 
from  #stage2 t
join stg._loginom.calculated_term_and_amount_installment a with (nolock)
on t.number=a.number
where a.MAX_CREDIT_LIMIT_PDL is not null

update t set
t.Income_amount=a.Income_amount
from #stage2 t
join  [Stg].[_loginom].[Originationlog] a with(nolock)
on t.number = a.number
where a.Income_amount is not null

update t set
t.Request_amount=a.request_amount
from #stage2 t
join  [Stg].[_loginom].[Originationlog] a with(nolock)
on t.number = a.number
where a.Request_amount is not null

update t set
t.Region=a.Region
from #stage2 t
join  [Stg].[_loginom].[Originationlog] a with(nolock)
on t.number = a.number
where a.Region is not null

update t set
t.APR=a.APR
from #stage2 t
join  [Stg].[_loginom].[Originationlog] a with(nolock)
on t.number = a.number
where a.APR is not null

/*
update t set
t.sum_mpl =a.sum_amount
from [RiskDWH].risk.v_portfolio_ar_test t
join (select startdate,sum(amount) sum_amount from [RiskDWH].risk.v_portfolio_ar_test group by startdate) a
on t.startdate=a.startdate
*/
--ALTER TABLE [Reports].risk.v_portfolio_ar ADD Request_amount float null;

--ALTER TABLE [RiskDWH].risk.v_portfolio_ar DROP COLUMN date_upd
--drop table [Reports].risk.v_portfolio_ar
--select * into  [Reports].risk.v_portfolio_ar from  #stage2
begin tran
truncate table [Reports].risk.v_portfolio_ar;
--select * from [Reports].risk.v_portfolio_ar
insert into [Reports].risk.v_portfolio_ar
(
	 [week_of_year]
, [week_of_year_loan]
, [week]	
, [number]	
, [product]	
, [dt]
, [call_date]
, [Decision_Code]	
, [Decision_description]	
, [incoming_DTI_group]	
, [client_type_1]	
, [leadsource]	
, [Banki_ru]	
, [Banki_Type]	
, [pdn_fact_bucket]	
, [Call1_incoming]	
, [Call1_accept]	
, [Call12_incoming]	
, [Call12_accept]	
, [Call15_incoming]	
, [Call15_accept]	
, [Call2_incoming]	
, [Call2_accept]	
, [Call3_incoming]	
, [Call3_accept]	
, [Call5_incoming]	
, [Call5_accept]	
, [cnt_loan]	
, [sum_loans]	
, [date_upd]	
, [no_daley]	
, [no_daley_apr]	
, [no_daley_loan]	
, [start_exp_fun]	
, [end_exp_fun]	
, [fl_check]	
, [bki]	
, [EqxScore]
, [fpd0]	
, [fpd15]	
, [fpd30]	
, [PDLTerm]	
, [fpd0_base]	
, [fpd15_base]	
, [fpd30_base]	
, [credit_type]	
, [startdate]	
, [week_loan]	
, [amount]	
, [fpd0_amount]	
, [fpd15_amount]	
, [fpd30_amount]	
, [sum_fpd0]
, [sum_fpd15]	
, [sum_fpd30]
, [declineOverrideCategory]
, [call_date_h]
, [Дубль]
, [MAX_CREDIT_LIMIT_INST]
, [MAX_CREDIT_LIMIT_PDL]
, [Decision_description_detal]
, [Income_amount]
, [Request_amount]
, [Region]
, [APR]
, [reasonDescription_new]
, [category_new]
, [checkType_new]
)
select  
[week_of_year]
, [week_of_year_loan]
, [week]	
, [number]	
, [product]	
, [dt]
, [call_date]
, [Decision_Code]	
, [Decision_description]	
, [incoming_DTI_group]	
, [client_type_1]	
, [leadsource]	
, [Banki_ru]	
, [Banki_Type]	
, [pdn_fact_bucket]	
, [Call1_incoming]	
, [Call1_accept]	
, [Call12_incoming]	
, [Call12_accept]	
, [Call15_incoming]	
, [Call15_accept]	
, [Call2_incoming]	
, [Call2_accept]	
, [Call3_incoming]	
, [Call3_accept]	
, [Call5_incoming]	
, [Call5_accept]	
, [cnt_loan]	
, [sum_loans]	
, [date_upd]	
, [no_daley]	
, [no_daley_apr]	
, [no_daley_loan]	
, [start_exp_fun]	
, [end_exp_fun]	
, [fl_check]	
, [bki]	
, [EqxScore]	
, [fpd0]	
, [fpd15]	
, [fpd30]	
, [PDLTerm]	
, [fpd0_base]	
, [fpd15_base]	
, [fpd30_base]	
, [credit_type]	
, [startdate]	
, [week_loan]	
, [amount]	
, [fpd0_amount]	
, [fpd15_amount]	
, [fpd30_amount]	
, [sum_fpd0]
, [sum_fpd15]	
, [sum_fpd30]
, [declineOverrideCategory]
, [call_date_h]
, [Дубль]
, [MAX_CREDIT_LIMIT_INST]
, [MAX_CREDIT_LIMIT_PDL]
, [Decision_description_detal]
, [Income_amount]
, [Request_amount]
, [Region]
, [APR]
, [reasonDescription_new]
, [category_new]
, [checkType_new]
from  #stage2

drop table [dwh2].risk.v_portfolio_ar
select * into [dwh2].risk.v_portfolio_ar
from [Reports].risk.v_portfolio_ar

commit tran
end try
begin catch
	if @@TRANCOUNT>0
		rollback tran
	;throw
end catch
end





/*
select a.Call_date,*
 from [RiskDWH].risk.v_portfolio_ar t
join Stg._loginom.Originationlog a with (nolock) 
on t.number=a.number
where userName='service' and stage = 'Call 1'
and cast(dt as date) >'20241205'
order by a.call_date desc
*/
