
-- =============================================
-- Author:		Курдин С.В.
-- Create date: 2019-05-20
-- Description:	Создание основной таблицы для отчета по ВЕРИФИКАЦИИ

-- exec [etl].[base_etl_report_Verification_mfo]
-- =============================================

CREATE PROCEDURE [etl].[base_etl_report_Verification_mfo]
	-- Add the parameters for the stored procedure here

AS
BEGIN  --auxtab_RequestMFO_1c

	SET NOCOUNT ON;

--24.03.2020
	SET DATEFIRST 1;


declare @DateStart datetime,
		@DateStart2 datetime,
		@GetDate2000 datetime,
		@GetDate2000Start datetime
--		@GetDate2000Fin datetime
set @DateStart=	dateadd(month,-1,dateadd(month,datediff(month,0,dateadd(day,-1,Getdate())),0));	--dateadd(MONTH,datediff(MONTH,0,dateadd(month,-1,Getdate())),0);
--dateadd(day,-datediff(day,cast('20170101' as datetime),getdate()),getdate())
--dateadd(month,datediff(month,0,GetDate()),-720);
--dateadd(day,datediff(day,0,GetDate()-2),0);
set	@DateStart2=dateadd(year,2000,@DateStart);
set @GetDate2000=dateadd(year,2000,getdate());
set @GetDate2000Start=dateadd(MONTH,datediff(MONTH,0,dateadd(month,0,@GetDate2000)),0);

/*
if OBJECT_ID('[Reports].[dbo].[report_Verification_mfo]') is not null
drop table [Reports].[dbo].[report_Verification_mfo];

-- Создание вспомогательной таблицы "Комментарии к заявке"
create table [Reports].[dbo].[report_Verification_mfo]
(
[НаименованиеПараметра] nvarchar(255) null
,[Неделя] int  null
,[Параметр1] nvarchar(255) null
,[Параметр2] nvarchar(255) null
,[Параметр3] nvarchar(255) null
,[Параметр4] nvarchar(255) null
,[Параметр5] nvarchar(255) null
,[Параметр6] nvarchar(255) null
,[Параметр7] nvarchar(255) null

,[НаименованиеЛиста] nvarchar(255) null
,[Сумма] decimal(15,2) null
,[Год] int null
,[Докредитование] nvarchar(255) null
,[Параметр8] nvarchar(255) null

,[Регион] nvarchar(255) null

,[Параметр9] nvarchar(255) null --,[ДопПараметр_1]
,[ДатаЧислом] int null --Дата отчета
,[ПериодУчета] int null --

,[Точка] nvarchar(255) null
,[ПовторностьNew] nvarchar(255) null 
,[Срок] int null
,[РОРегион] nvarchar(255) null
,[Дивизион] nvarchar(255) null
,[Исполнитель] nvarchar(255) null  -- Исполнитель
,[Параметр11] nvarchar(255) null --,[ДопПараметр_2]
,[ВремяРасссмотрения] numeric(15,10) null  -- ВремяРассмотрения
,[КредитныйПродукт] nvarchar(255)  null

,[Параметр13] nvarchar(255) null  -- Отказ причина
,[Параметр14] nvarchar(255) null  -- Отказ причина по коду
,[Параметр15] nvarchar(255) null  -- Отказ по факторам

,[ПериодичностьОтчета] nvarchar(255) null

,[Дата] datetime null 
,[Колво] decimal(15,2)  null
,[ДатаОперации] datetime null 

,[ДеньМесяца] int null
,[Сумма2] decimal(15,2)  null
,[ПервичнаяСумма] decimal(15,2)  null
);
*/
--DWH-1764
TRUNCATE TABLE [Reports].[dbo].[report_Verification_mfo]


;with TableVerifSource as  -- основная таблица (1)
(
select
rts.[ЗаявкаСсылка_Исх] 
,rts.[ЗаявкаНомер_Исх]
,rts.[СтатусНаим_Исх]
,rts.[СтатусНаим_След]

,dateadd(MONTH,datediff(MONTH,0,rts.[Период_Исх]),0) as [ДатаСобытия]
,rts.[Период_Исх]
,rts.[Период_След]
,N'Кол-во заявок' as [ДопПараметр_1]

,zl.[Регион] as [Регион]
,zl.[РОРегион]
,rts.[ИсполнительСсылка_След] as [ИсполнительСсылка]
,rts.[ИсполнительНаим_След] as [Исполнитель]

,1 as [Колво]

,cast(rts.[Период_След] as decimal(15,10)) - cast(rts.[Период_Исх] as decimal(15,10)) as [СрВремяРасссмотрения]
-- ,cast((datediff(second,rts.[Период_Исх],rts.[Период_След])) as numeric(15,10))/86400 as [СрВремяРасссмотрения]
,case  when zl.[ПервичнаяСумма]<>0 then zl.[ПервичнаяСумма] else zl.[СуммаЗаявки] end as [ПервичнаяСумма]
,zl.[СуммаЗаявки]
,zl.[СуммаДоговора]
,zl.[ПризнакАннулирования]
,zl.[ЕстьОсновнаяЗаявка]

,rts.[СостояниеЗаявки]
,rts.[СтатусДляСостояния]
,rts.[ЗаявкаДата_Исх]


from [dwh_new].[dbo].[mt_requests_transition_mfo] rts
left join (select [ЗаявкаСсылка] as [Ссылка] ,[ЗаявкаНомер] ,[СуммаЗаявки] ,[ЕстьОсновнаяЗаявка] 
				  ,[ЗаявкаРегион] as [Регион] ,[ЗаявкаРОРегион] as [РОРегион] 
				  ,[СуммаДоговора] ,[ПервичнаяСумма] ,[ЗаявкаПризнакАннулирования] as [ПризнакАннулирования]
		   from [dwh_new].[dbo].[mt_requests_loans_mfo]) zl
on rts.[ЗаявкаСсылка_Исх]=zl.[Ссылка]
where rts.[Период_Исх] between @DateStart and dateadd(SECOND,-1,dateadd(day,datediff(day,0,Getdate()),0)) --конец предыдущего дня
--where rts.[СтатусНаим_Исх] in (N'Верификация КЦ' ,N'Контроль данных' ,N'Верификация документов клиента' ,N'Верификация документов' ,N'Восстановлено рассмотрение') 
--	  and rts.[СтатусНаим_След] in (N'Предварительное одобрение' ,N'Контроль данных' ,N'Одобрены документы клиента' ,N'Одобрено' ,N'Отложено рассмотрение' 
--									,N'Отказ документов клиента' ,N'Отказ документов' ,N'Отказано' ,N'Заявка аннулирована')
--	  and zl.[ЕстьОсновнаяЗаявка] is null
)
--select * from TableVerifSource
,	TableVerif as 
(
select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,[СтатусНаим_Исх] ,[СтатусНаим_След] 
		--,[НаименованиеПараметра] 
		,[ДатаСобытия] ,[Период_Исх] ,[Период_След]
		,[ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
		,[СуммаДоговора] as [ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка] ,[СостояниеЗаявки] ,[СтатусДляСостояния] ,[ЗаявкаДата_Исх] 
from TableVerifSource
--where not [НаименованиеПараметра] is null
)

,	RequestStatusPeriod as
(
select [Период_Исх] as [Период] ,[ЗаявкаСсылка_Исх] as [ЗаявкаСсылка] ,[СтатусНаим_Исх] as [СтатусНаим]
	   ,rank() over(partition by [ЗаявкаСсылка_Исх], [СтатусНаим_Исх] order by [Период_Исх] desc) as [rank]
from TableVerifSource
where [СтатусНаим_Исх] in (N'Восстановлено рассмотрение', N'Отложено рассмотрение')
)

------------ Одобренные заявки
,	ApprovedRequest as
(
select [ЗаявкаСсылка_Исх] as [ЗаявкаСсылка]
from [dwh_new].[dbo].[mt_requests_transition_mfo]
where [СтатусСсылка_След] in (0xB35F4DD3132676754B1711F049B4CB3A -- Договор подписан 
				  ,0xACF78A666F79C8774A4022BCA68DF223 -- Заем погашен 
				  ,0x8069339A0F2B117A47D4E49CAD9D3260 -- Заем аннулирован 
				  ,0xA398265179685AF34EED1A6B6349A87B) -- Заем выдан
group by [ЗаявкаСсылка_Исх]
)
------------ Аннулированные заявки все
,	CancelledRequestAll as
(
select [ЗаявкаСсылка_Исх] 
		--,[ЗаявкаНомер_Исх] ,[СтатусНаим_Исх] ,[СтатусНаим_След] 
		--,N'Кол-во заявок аннулированных по сроку' as [НаименованиеПараметра] ,[ДатаСобытия] ,[Период_Исх] ,[Период_След]
		--,N'' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
		--,[СуммаДоговора] as [ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка]
from TableVerifSource
where [СтатусНаим_След] = N'Заявка аннулирована'
)


------------ ПРЕДВАРИТЕЛЬНЫЙ ЭТАП // Кол-во заявок
,	t10 as
(
select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,[СтатусНаим_Исх] ,[СтатусНаим_След] 
		,N'ПРЕДВАРИТЕЛЬНЫЙ ЭТАП' as [НаименованиеПараметра] ,[ДатаСобытия] ,case when rsp.[Период] is not null then rsp.[Период] else [Период_Исх] end as [Период_Исх] ,[Период_След]
		,N'Кол-во заявок' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
		,[ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка] 
from TableVerif tv 
	left join (select [Период] ,[ЗаявкаСсылка] ,[СтатусНаим] from RequestStatusPeriod where [rank]=1 and [СтатусНаим]=N'Верификация КЦ') rsp
	on tv.[ЗаявкаСсылка_Исх]=rsp.[ЗаявкаСсылка]
where [СтатусНаим_Исх]=N'Верификация КЦ'
)

------------ ПРЕДВАРИТЕЛЬНЫЙ ЭТАП по Одобренным заявки// Кол-во заявок
,	t11 as
(
select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,[СтатусНаим_Исх] ,[СтатусНаим_След] 
		,N'ПРЕДВАРИТЕЛЬНЫЙ ЭТАП_ОдобреныЗаявки' as [НаименованиеПараметра] ,[ДатаСобытия] ,[Период_Исх] ,[Период_След]
		,N'Кол-во заявок' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
		,[ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка] 
from TableVerif 
where [СтатусНаим_Исх]=N'Верификация КЦ' 
	  and [ЗаявкаСсылка_Исх] in (select * from ApprovedRequest)
)

------------ ПРЕДВАРИТЕЛЬНЫЙ ЭТАП // Кол-во одобренных заявок
,	t12 as
(
select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,[СтатусНаим_Исх] ,[СтатусНаим_След] 
		,N'ПРЕДВАРИТЕЛЬНЫЙ ЭТАП' as [НаименованиеПараметра] ,[ДатаСобытия] ,[Период_Исх] ,[Период_След]
		,N'Кол-во одобренных' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
		,[ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка]  
from TableVerif where [СтатусНаим_След]=N'Предварительное одобрение'
)

------------ КОНТРОЛЬ ДАННЫХ // Кол-во заявок
,	t20 as
(
select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,[СтатусНаим_Исх] ,[СтатусНаим_След] 
		,N'КОНТРОЛЬ ДАННЫХ' as [НаименованиеПараметра] ,[ДатаСобытия] 
		,case when rsp.[Период] is not null then rsp.[Период] else [Период_Исх] end as [Период_Исх] ,[Период_След]
		,N'Кол-во заявок' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
		,[ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка]
from TableVerif tv 
	left join (select [Период] ,[ЗаявкаСсылка] ,[СтатусНаим] from RequestStatusPeriod where [rank]=1 and [СтатусНаим]=N'Контроль данных') rsp
	on tv.[ЗаявкаСсылка_Исх]=rsp.[ЗаявкаСсылка]
where cast([ЗаявкаДата_Исх] as date) < '2019-10-01' and  [СтатусНаим_Исх]=N'Контроль данных' and [ЕстьОсновнаяЗаявка] is null and [ПризнакАннулирования]=N''

 union all
/*
  select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,[СтатусНаим_Исх] ,[СтатусНаим_След] 
		,N'КОНТРОЛЬ ДАННЫХ' as [НаименованиеПараметра] ,[ДатаСобытия] 
		
		,[Период_Исх] as [Период_Исх]  --,case when rsp.[Период] is not null then rsp.[Период] else [Период_Исх] end as [Период_Исх]  
		,[Период_След]
		,N'Кол-во заявок' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
		,[ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка] --,[СостояниеЗаявки] ,[СтатусДляСостояния]
 from TableVerif tv 
	--left join (select [Период] ,[ЗаявкаСсылка] ,[СтатусНаим] from RequestStatusPeriod where [rank]=1 and [СтатусНаим]=N'Верификация документов клиента') rsp
	--on tv.[ЗаявкаСсылка_Исх]=rsp.[ЗаявкаСсылка]
 
 where cast([ЗаявкаДата_Исх] as date)>='2019-10-01' and [ЕстьОсновнаяЗаявка] is null and [ПризнакАннулирования]=N'' --and [СтатусНаим_Исх]=N'Верификация документов клиента' 
		and [СтатусДляСостояния]=N'Контроль данных' and [СостояниеЗаявки]='В работе' 
*/
select tv2.[ЗаявкаСсылка_Исх] ,tv2.[ЗаявкаНомер_Исх] ,tv2.[СтатусНаим_Исх] ,tv2.[СтатусНаим_След] ,tv2.[НаименованиеПараметра] ,tv2.[ДатаСобытия] 
		
		,tv2.[Период_Исх] ,tv2.[Период_След]
		,tv2.[ДопПараметр_1] ,tv2.[Регион] ,tv2.[РОРегион] ,tv2.[ИсполнительСсылка] ,tv2.[Исполнитель] ,1 as [Колво] ,tv2.[ПервичнаяСумма] 
		,sum(tv2.[СрВремяРасссмотрения]) as [СрВремяРасссмотрения]
		,tv2.[ЗаявкаСумма] ,tv2.[ПризнакАннулирования] ,tv2.[ЕстьОсновнаяЗаявка] --,[СостояниеЗаявки] ,[СтатусДляСостояния]
 
from (select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,N'' as [СтатусНаим_Исх] ,N'' as [СтатусНаим_След] 
			,N'КОНТРОЛЬ ДАННЫХ' as [НаименованиеПараметра] ,[ДатаСобытия] 
		
			,cast([Период_Исх] as date) as [Период_Исх]  --,case when rsp.[Период] is not null then rsp.[Период] else [Период_Исх] end as [Период_Исх]  
			,cast([Период_След] as date) as [Период_След]
			,N'Кол-во заявок' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,0 as [Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
			,[ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка] ,[СостояниеЗаявки] ,[СтатусДляСостояния]
	  from TableVerif tv 
	  where cast([ЗаявкаДата_Исх] as date)>='2019-10-01' and [ЕстьОсновнаяЗаявка] is null and [ПризнакАннулирования]=N'' --and [СтатусНаим_Исх]=N'Верификация документов клиента' 
			and [СтатусДляСостояния]=N'Контроль данных' and [СостояниеЗаявки]='В работе' 
			and not [ЗаявкаНомер_Исх] in (select numer from [Reports].[dbo].[dm_Verification_001_Exception])) tv2

group by tv2.[ЗаявкаСсылка_Исх] ,tv2.[ЗаявкаНомер_Исх] ,tv2.[СтатусНаим_Исх] ,tv2.[СтатусНаим_След] ,tv2.[НаименованиеПараметра] ,tv2.[ДатаСобытия] 
		 ,tv2.[Период_Исх] ,tv2.[Период_След] ,tv2.[ДопПараметр_1] ,tv2.[Регион] ,tv2.[РОРегион] ,tv2.[ИсполнительСсылка] ,tv2.[Исполнитель] ,tv2.[ПервичнаяСумма] 
		 ,tv2.[ЗаявкаСумма] ,tv2.[ПризнакАннулирования] ,tv2.[ЕстьОсновнаяЗаявка] 
)

------------ КОНТРОЛЬ ДАННЫХ // УНИКАЛЬНОЕ Кол-во заявок
,	t2u as
(
/* select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,[СтатусНаим_Исх] ,[СтатусНаим_След] 
		,N'КОНТРОЛЬ ДАННЫХ' as [НаименованиеПараметра] ,[ДатаСобытия] 

		,case when rsp.[Период] is not null then rsp.[Период] else [Период_Исх] end as [Период_Исх] 
		,[Период_След]
		,N'Кол-во заявок_уник' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
		,[ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка] 
 from TableVerif tv 
	left join (select [Период] ,[ЗаявкаСсылка] ,[СтатусНаим] from RequestStatusPeriod where [rank]=1 and [СтатусНаим]=N'Верификация документов клиента') rsp
	on tv.[ЗаявкаСсылка_Исх]=rsp.[ЗаявкаСсылка]
 
 where cast([ЗаявкаДата_Исх] as date) < '2019-10-01' 
		and  [СтатусНаим_Исх]=N'Контроль данных' 
			and [ЕстьОсновнаяЗаявка] is null and [ПризнакАннулирования]=N''

 union all
 */
select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,[СтатусНаим_Исх] ,[СтатусНаим_След] 
		,N'КОНТРОЛЬ ДАННЫХ' as [НаименованиеПараметра] ,[ДатаСобытия] 
		
		,[Период_Исх]  
		,[Период_След]
		,N'Кол-во заявок_уник' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
		,[ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка] --,[СостояниеЗаявки] ,[СтатусДляСостояния]
 from TableVerif tv
 
 where cast([Период_Исх] as date)>='2019-10-01' and [ЕстьОсновнаяЗаявка] is null and [ПризнакАннулирования]=N'' --and [СтатусНаим_Исх]=N'Верификация документов клиента' 
		and not [ЗаявкаНомер_Исх] in (select numer from [Reports].[dbo].[dm_Verification_001_Exception])
		and exists (select max([Период_След]) ,[ЗаявкаСсылка_Исх] ,[СтатусДляСостояния] 
						   from TableVerif tv0 
						   where [СтатусДляСостояния]=N'Контроль данных' and [СостояниеЗаявки]='В работе' and [СтатусНаим_След]=N'Верификация документов клиента'
								  and tv.[Период_След]=tv0.[Период_След] and tv.[ЗаявкаСсылка_Исх]=tv0.[ЗаявкаСсылка_Исх] and tv.[СтатусДляСостояния]=tv0.[СтатусДляСостояния]
						   group by [ЗаявкаСсылка_Исх] ,[СтатусДляСостояния])

)

------------ КОНТРОЛЬ ДАННЫХ по Одобренным заявки// Кол-во заявок
 ,	t21 as
 (
 select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,[СтатусНаим_Исх] ,[СтатусНаим_След] 
		,N'КОНТРОЛЬ ДАННЫХ_ОдобреныЗаявки' as [НаименованиеПараметра] ,[ДатаСобытия] ,[Период_Исх] ,[Период_След]
		,N'Кол-во заявок' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
		,[ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка] 
 from TableVerif 
 where [СтатусНаим_Исх]=N'Контроль данных' and [ЕстьОсновнаяЗаявка] is null
 	  and [ЗаявкаСсылка_Исх] in (select * from ApprovedRequest)
	  and not [ЗаявкаНомер_Исх] in (select numer from [Reports].[dbo].[dm_Verification_001_Exception])
 )

 ------------ КОНТРОЛЬ ДАННЫХ // Кол-во одобренных заявок
,	t22 as
(
select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,[СтатусНаим_Исх] ,[СтатусНаим_След] 
		,N'КОНТРОЛЬ ДАННЫХ' as [НаименованиеПараметра] ,[ДатаСобытия] ,[Период_Исх] ,[Период_След]
		,N'Кол-во одобренных' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
		,[ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка]   
from TableVerif where [СтатусДляСостояния]=N'Контроль данных' and [СостояниеЗаявки]='В работе' and [СтатусНаим_След]=N'Верификация документов клиента' and [ЕстьОсновнаяЗаявка] is null
					  and not [ЗаявкаНомер_Исх] in (select numer from [Reports].[dbo].[dm_Verification_001_Exception]) 
)
--select * from t22

------------ ВЕРИФИКАЦИЯ ДОКУМЕНТОВ КЛИЕНТА // Кол-во заявок
,	t3 as
(
 select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,[СтатусНаим_Исх] ,[СтатусНаим_След] 
		,N'ВЕРИФИКАЦИЯ ДОКУМЕНТОВ КЛИЕНТА' as [НаименованиеПараметра] ,[ДатаСобытия] 

		,case when rsp.[Период] is not null then rsp.[Период] else [Период_Исх] end as [Период_Исх] 
		,[Период_След]
		,N'Кол-во заявок' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
		,[ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка] 
 from TableVerif tv 
	left join (select [Период] ,[ЗаявкаСсылка] ,[СтатусНаим] from RequestStatusPeriod where [rank]=1 and [СтатусНаим]=N'Верификация документов клиента') rsp
	on tv.[ЗаявкаСсылка_Исх]=rsp.[ЗаявкаСсылка]
 
 where cast([Период_Исх] as date) < '2019-10-01' and  [СтатусНаим_Исх]=N'Верификация документов клиента' and [ЕстьОсновнаяЗаявка] is null and [ПризнакАннулирования]=N''

 union all
 /*
  select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,[СтатусНаим_Исх] ,[СтатусНаим_След] 
		,N'ВЕРИФИКАЦИЯ ДОКУМЕНТОВ КЛИЕНТА' as [НаименованиеПараметра] ,[ДатаСобытия] 
		
		,[Период_Исх] as [Период_Исх]  --,case when rsp.[Период] is not null then rsp.[Период] else [Период_Исх] end as [Период_Исх]  
		,[Период_След]
		,N'Кол-во заявок' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
		,[ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка] --,[СостояниеЗаявки] ,[СтатусДляСостояния]
 from TableVerif tv 
	--left join (select [Период] ,[ЗаявкаСсылка] ,[СтатусНаим] from RequestStatusPeriod where [rank]=1 and [СтатусНаим]=N'Верификация документов клиента') rsp
	--on tv.[ЗаявкаСсылка_Исх]=rsp.[ЗаявкаСсылка]
 
 where cast([ЗаявкаДата_Исх] as date)>='2019-10-01' and [ЕстьОсновнаяЗаявка] is null and [ПризнакАннулирования]=N'' --and [СтатусНаим_Исх]=N'Верификация документов клиента' 
		and [СтатусДляСостояния]=N'Верификация документов клиента' and [СостояниеЗаявки]='В работе' 
*/
 select tv2.[ЗаявкаСсылка_Исх] ,tv2.[ЗаявкаНомер_Исх] ,tv2.[СтатусНаим_Исх] ,tv2.[СтатусНаим_След] ,tv2.[НаименованиеПараметра] ,tv2.[ДатаСобытия] 
		
		,tv2.[Период_Исх] ,tv2.[Период_След]
		,tv2.[ДопПараметр_1] ,tv2.[Регион] ,tv2.[РОРегион] ,tv2.[ИсполнительСсылка] ,tv2.[Исполнитель] ,1 as [Колво] ,tv2.[ПервичнаяСумма] 
		,sum(tv2.[СрВремяРасссмотрения]) as [СрВремяРасссмотрения]
		,tv2.[ЗаявкаСумма] ,tv2.[ПризнакАннулирования] ,tv2.[ЕстьОсновнаяЗаявка] --,[СостояниеЗаявки] ,[СтатусДляСостояния]
 
from (select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,N'' as [СтатусНаим_Исх] ,N'' as [СтатусНаим_След] 
			,N'ВЕРИФИКАЦИЯ ДОКУМЕНТОВ КЛИЕНТА' as [НаименованиеПараметра] ,[ДатаСобытия] 
		
			,[Период_Исх]  --,case when rsp.[Период] is not null then rsp.[Период] else [Период_Исх] end as [Период_Исх]  
			,[Период_След]
			,N'Кол-во заявок' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,0 as [Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
			,[ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка] ,[СостояниеЗаявки] ,[СтатусДляСостояния]
	  from TableVerif tv 
	  where cast([Период_Исх] as date)>='2019-10-01' and [ЕстьОсновнаяЗаявка] is null and [ПризнакАннулирования]=N'' --and [СтатусНаим_Исх]=N'Верификация документов клиента' 
			and [СтатусДляСостояния]=N'Верификация документов клиента' and [СостояниеЗаявки]='В работе') tv2

group by tv2.[ЗаявкаСсылка_Исх] ,tv2.[ЗаявкаНомер_Исх] ,tv2.[СтатусНаим_Исх] ,tv2.[СтатусНаим_След] ,tv2.[НаименованиеПараметра] ,tv2.[ДатаСобытия] 
		 ,tv2.[Период_Исх] ,tv2.[Период_След] ,tv2.[ДопПараметр_1] ,tv2.[Регион] ,tv2.[РОРегион] ,tv2.[ИсполнительСсылка] ,tv2.[Исполнитель] ,tv2.[ПервичнаяСумма] 
		 ,tv2.[ЗаявкаСумма] ,tv2.[ПризнакАннулирования] ,tv2.[ЕстьОсновнаяЗаявка] 

)

------------ ВЕРИФИКАЦИЯ ДОКУМЕНТОВ КЛИЕНТА // УНИКАЛЬНОЕ Кол-во заявок
,	t3u as
(
/* select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,[СтатусНаим_Исх] ,[СтатусНаим_След] 
		,N'ВЕРИФИКАЦИЯ ДОКУМЕНТОВ КЛИЕНТА' as [НаименованиеПараметра] ,[ДатаСобытия] 

		,case when rsp.[Период] is not null then rsp.[Период] else [Период_Исх] end as [Период_Исх] 
		,[Период_След]
		,N'Кол-во заявок_уник' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
		,[ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка] 
 from TableVerif tv 
	left join (select [Период] ,[ЗаявкаСсылка] ,[СтатусНаим] from RequestStatusPeriod where [rank]=1 and [СтатусНаим]=N'Верификация документов клиента') rsp
	on tv.[ЗаявкаСсылка_Исх]=rsp.[ЗаявкаСсылка]
 
 where cast([ЗаявкаДата_Исх] as date) < '2019-10-01' and  [СтатусНаим_Исх]=N'Верификация документов клиента' and [ЕстьОсновнаяЗаявка] is null and [ПризнакАннулирования]=N''

 union all
 */
select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,[СтатусНаим_Исх] ,[СтатусНаим_След] 
		,N'ВЕРИФИКАЦИЯ ДОКУМЕНТОВ КЛИЕНТА' as [НаименованиеПараметра] ,[ДатаСобытия] 
		
		,[Период_Исх]  
		,[Период_След]
		,N'Кол-во заявок_уник' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
		,[ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка] --,[СостояниеЗаявки] ,[СтатусДляСостояния]
 from TableVerif tv
 
 where cast([Период_Исх] as date)>='2019-10-01' and [ЕстьОсновнаяЗаявка] is null and [ПризнакАннулирования]=N'' --and [СтатусНаим_Исх]=N'Верификация документов клиента' 
		and exists (select max([Период_След]) ,[ЗаявкаСсылка_Исх] ,[СтатусДляСостояния] 
						   from TableVerif tv0 
						   where [СтатусДляСостояния]=N'Верификация документов клиента' and [СостояниеЗаявки]='В работе' and [СтатусНаим_След]<>N'Отложено рассмотрение'
								  and tv.[Период_След]=tv0.[Период_След] and tv.[ЗаявкаСсылка_Исх]=tv0.[ЗаявкаСсылка_Исх] and tv.[СтатусДляСостояния]=tv0.[СтатусДляСостояния]
						   group by [ЗаявкаСсылка_Исх] ,[СтатусДляСостояния])

)

------------ ВЕРИФИКАЦИЯ ДОКУМЕНТОВ КЛИЕНТА по Одобренным заявки// Кол-во заявок
,	t31 as
(
select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,[СтатусНаим_Исх] ,[СтатусНаим_След] 
		,N'ВЕРИФИКАЦИЯ ДОКУМЕНТОВ КЛИЕНТА_ОдобреныЗаявки' as [НаименованиеПараметра] ,[ДатаСобытия] ,[Период_Исх] ,[Период_След]
		,N'Кол-во заявок' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
		,[ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка]  
from TableVerif 
where [СтатусНаим_След]=N'Одобрены документы клиента' and [ЕстьОсновнаяЗаявка] is null 
	  and [ЗаявкаСсылка_Исх] in (select * from ApprovedRequest)
)

------------ ВЕРИФИКАЦИЯ ДОКУМЕНТОВ КЛИЕНТА // Кол-во одобренных заявок
,	t32 as
(
select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,[СтатусНаим_Исх] ,[СтатусНаим_След] 
		,N'ВЕРИФИКАЦИЯ ДОКУМЕНТОВ КЛИЕНТА' as [НаименованиеПараметра] ,[ДатаСобытия] ,[Период_Исх] ,[Период_След]
		,N'Кол-во одобренных' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
		,[ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка]   
from TableVerif where [СтатусНаим_След]=N'Одобрены документы клиента' and [ЕстьОсновнаяЗаявка] is null 
)

------------ ВЕРИФИКАЦИЯ ДОКУМЕНТОВ // Кол-во заявок
,	t4 as
(
 select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,[СтатусНаим_Исх] ,[СтатусНаим_След] 
		,N'ВЕРИФИКАЦИЯ ДОКУМЕНТОВ' as [НаименованиеПараметра] ,[ДатаСобытия] ,case when rsp.[Период] is not null then rsp.[Период] else [Период_Исх] end as [Период_Исх] ,[Период_След]
		,N'Кол-во заявок' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
		,[ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка]  
from TableVerif tv 
	left join (select [Период] ,[ЗаявкаСсылка] ,[СтатусНаим] from RequestStatusPeriod where [rank]=1 and [СтатусНаим]=N'Верификация документов') rsp
	on tv.[ЗаявкаСсылка_Исх]=rsp.[ЗаявкаСсылка]
 where cast([ЗаявкаДата_Исх] as date)<'2019-10-01' and  [СтатусНаим_Исх]=N'Верификация документов' and [ЕстьОсновнаяЗаявка] is null 

union all
/*
 select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,[СтатусНаим_Исх] ,[СтатусНаим_След] 
		,N'ВЕРИФИКАЦИЯ ДОКУМЕНТОВ' as [НаименованиеПараметра] ,[ДатаСобытия] 
		,[Период_Исх] as [Период_Исх] 
		,[Период_След]
		,N'Кол-во заявок' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
		,[ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка]  
from TableVerif tv 
	--left join (select [Период] ,[ЗаявкаСсылка] ,[СтатусНаим] from RequestStatusPeriod where [rank]=1 and [СтатусНаим]=N'Верификация документов') rsp
	--on tv.[ЗаявкаСсылка_Исх]=rsp.[ЗаявкаСсылка]
 where  cast([ЗаявкаДата_Исх] as date)>='2019-10-01' and [ЕстьОсновнаяЗаявка] is null 
		and [СтатусДляСостояния]=N'Верификация документов' and [СостояниеЗаявки]='В работе' 
*/ 
 select tv2.[ЗаявкаСсылка_Исх] ,tv2.[ЗаявкаНомер_Исх] ,tv2.[СтатусНаим_Исх] ,tv2.[СтатусНаим_След] ,tv2.[НаименованиеПараметра] ,tv2.[ДатаСобытия] 
		
		,tv2.[Период_Исх] ,tv2.[Период_След]
		,tv2.[ДопПараметр_1] ,tv2.[Регион] ,tv2.[РОРегион] ,tv2.[ИсполнительСсылка] ,tv2.[Исполнитель] ,1 as [Колво] ,tv2.[ПервичнаяСумма] 
		,sum(tv2.[СрВремяРасссмотрения]) as [СрВремяРасссмотрения]
		,tv2.[ЗаявкаСумма] ,tv2.[ПризнакАннулирования] ,tv2.[ЕстьОсновнаяЗаявка] --,[СостояниеЗаявки] ,[СтатусДляСостояния]
 
from (select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,N'' as [СтатусНаим_Исх] ,N'' as [СтатусНаим_След] 
			,N'ВЕРИФИКАЦИЯ ДОКУМЕНТОВ' as [НаименованиеПараметра] ,[ДатаСобытия] 
		
			,[Период_Исх]  --,case when rsp.[Период] is not null then rsp.[Период] else [Период_Исх] end as [Период_Исх]  
			,[Период_След]
			,N'Кол-во заявок' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,0 as [Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
			,[ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка] ,[СостояниеЗаявки] ,[СтатусДляСостояния]
	  from TableVerif tv 
	  where cast([Период_Исх] as date)>='2019-10-01' and [ЕстьОсновнаяЗаявка] is null and [ПризнакАннулирования]=N'' --and [СтатусНаим_Исх]=N'Верификация документов клиента' 
			and [СтатусДляСостояния]=N'Верификация документов' and [СостояниеЗаявки]='В работе') tv2

group by tv2.[ЗаявкаСсылка_Исх] ,tv2.[ЗаявкаНомер_Исх] ,tv2.[СтатусНаим_Исх] ,tv2.[СтатусНаим_След] ,tv2.[НаименованиеПараметра] ,tv2.[ДатаСобытия] 
		 ,tv2.[Период_Исх] ,tv2.[Период_След] ,tv2.[ДопПараметр_1] ,tv2.[Регион] ,tv2.[РОРегион] ,tv2.[ИсполнительСсылка] ,tv2.[Исполнитель] ,tv2.[ПервичнаяСумма] 
		 ,tv2.[ЗаявкаСумма] ,tv2.[ПризнакАннулирования] ,tv2.[ЕстьОсновнаяЗаявка]  
 
  
)

------------ ВЕРИФИКАЦИЯ ДОКУМЕНТОВ // УНИКАЛЬНОЕ Кол-во заявок
,	t4u as
(
/* select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,[СтатусНаим_Исх] ,[СтатусНаим_След] 
		,N'ВЕРИФИКАЦИЯ ДОКУМЕНТОВ КЛИЕНТА' as [НаименованиеПараметра] ,[ДатаСобытия] 

		,case when rsp.[Период] is not null then rsp.[Период] else [Период_Исх] end as [Период_Исх] 
		,[Период_След]
		,N'Кол-во заявок_уник' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
		,[ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка] 
 from TableVerif tv 
	left join (select [Период] ,[ЗаявкаСсылка] ,[СтатусНаим] from RequestStatusPeriod where [rank]=1 and [СтатусНаим]=N'Верификация документов клиента') rsp
	on tv.[ЗаявкаСсылка_Исх]=rsp.[ЗаявкаСсылка]
 
 where cast([ЗаявкаДата_Исх] as date) < '2019-10-01' and  [СтатусНаим_Исх]=N'Верификация документов клиента' and [ЕстьОсновнаяЗаявка] is null and [ПризнакАннулирования]=N''

 union all
 */
select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,[СтатусНаим_Исх] ,[СтатусНаим_След] 
		,N'ВЕРИФИКАЦИЯ ДОКУМЕНТОВ' as [НаименованиеПараметра] ,[ДатаСобытия] 
		
		,[Период_Исх]  
		,[Период_След]
		,N'Кол-во заявок_уник' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
		,[ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка] --,[СостояниеЗаявки] ,[СтатусДляСостояния]
 from TableVerif tv
 
 where cast([Период_Исх] as date)>='2019-10-01' and [ЕстьОсновнаяЗаявка] is null and [ПризнакАннулирования]=N'' --and [СтатусНаим_Исх]=N'Верификация документов клиента' 
		and exists (select max([Период_След]) ,[ЗаявкаСсылка_Исх] ,[СтатусДляСостояния] 
						   from TableVerif tv0 
						   where [СтатусДляСостояния]=N'Верификация документов' and [СостояниеЗаявки]='В работе'and [СтатусНаим_След]<>N'Отложено рассмотрение'
								  and tv.[Период_След]=tv0.[Период_След] and tv.[ЗаявкаСсылка_Исх]=tv0.[ЗаявкаСсылка_Исх] and tv.[СтатусДляСостояния]=tv0.[СтатусДляСостояния]
						   group by [ЗаявкаСсылка_Исх] ,[СтатусДляСостояния])

)

------------ ВЕРИФИКАЦИЯ ДОКУМЕНТОВ по Одобренным заявки// Кол-во заявок
 ,	t41 as
 (
 select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,[СтатусНаим_Исх] ,[СтатусНаим_След] 
		,N'ВЕРИФИКАЦИЯ ДОКУМЕНТОВ_ОдобреныЗаявки' as [НаименованиеПараметра] ,[ДатаСобытия] ,[Период_Исх] ,[Период_След]
		,N'Кол-во заявок' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
		,[ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка] 
 from TableVerif 
 where [СтатусНаим_След]=N'Одобрено' and [ЕстьОсновнаяЗаявка] is null 
 	  and [ЗаявкаСсылка_Исх] in (select * from ApprovedRequest)
 )

------------ ВЕРИФИКАЦИЯ ДОКУМЕНТОВ // Кол-во одобренных заявок
 ,	t42 as
 (
 select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,[СтатусНаим_Исх] ,[СтатусНаим_След] 
		,N'ВЕРИФИКАЦИЯ ДОКУМЕНТОВ' as [НаименованиеПараметра] ,[ДатаСобытия] ,[Период_Исх] ,[Период_След]
		,N'Кол-во одобренных' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
		,[ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка]  
 from TableVerif where [СтатусНаим_Исх]=N'Верификация документов' and [СтатусНаим_След]=N'Одобрено' and [ЕстьОсновнаяЗаявка] is null 
 )

 --------------------------------------------------------------------------
,	CancelledRequestRegl as  -- аннулированные заявки по регламенту (9)
(
select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,[СтатусНаим_Исх] ,[СтатусНаим_След] 
		,N'Кол-во заявок аннулированных по сроку' as [НаименованиеПараметра] ,[ДатаСобытия] ,[Период_Исх] ,[Период_След]
		,N'' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
		,[СуммаДоговора] as [ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка]
from TableVerifSource
where [СтатусНаим_След] = N'Заявка аннулирована'
		and [ЗаявкаСсылка_Исх] in (select [ЗаявкаСсылка_Исх]
								   from [dwh_new].[dbo].[mt_requests_transition_mfo]
								   where [СтатусСсылка_След]=0x8D0D358E813B836A4F34C2C81F9ADC1D		
										 and [ПричинаСсылка_След] =0xBE43244BC8057B3F4C5A9ACD752A2BD2  -- причина по регламенту
								   )
)
--------------------------------------------------------------------------
,	CancelledRequestMistake as  -- аннулированные заявки по ошибке (10)
(
select [ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,[СтатусНаим_Исх] ,[СтатусНаим_След] 
		,N'Кол-во заявок аннулированных по ошибкам' as [НаименованиеПараметра] ,[ДатаСобытия] ,[Период_Исх] ,[Период_След]
		,N'' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[ПервичнаяСумма] ,[СрВремяРасссмотрения]
		,[СуммаДоговора] as [ЗаявкаСумма] ,[ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка]
from TableVerifSource
where [СтатусНаим_След] = N'Заявка аннулирована' 
and [ПризнакАннулирования]<>N'' --and [ЕстьОсновнаяЗаявка] is not null
--		and [ЗаявкаСсылка_Исх] in (select [Заявка]
--									   from [C1-VSR-SQL05].[MFO_NIGHT01].[dbo].[РегистрСведений_ГП_СписокЗаявок]
--									   where [Статус]=0x8D0D358E813B836A4F34C2C81F9ADC1D		
--											 and [Причина] in (0x874A88E37367A1534FCE4812FCB1C6AB  --Ошибка данных
--																,0xB0574DE49B4FF0124B1C48841A6DA00A  --Ошибка в заполненных данных
--																,0xBFAD48710C5AAB5549067F46A5A1DDD9 --Техническая ошибка
--																)
--									   )
),
--------------------------------------------------------------------------
QuantityOfLoan as  -- Количество выданных займов (11)
(
select [ДоговорСсылка] as [ЗаявкаСсылка_Исх] ,[ДоговорНомер] as [ЗаявкаНомер_Исх] 
		,N'' as [СтатусНаим_Исх] ,N'' as [СтатусНаим_След] 
		,N'Кол-во выданных займов' as [НаименованиеПараметра] 
		,[ДатаВыдачиДоговора] as [ДатаСобытия] ,[ДатаВыдачиДоговора] as [Период_Исх] ,[ДатаВыдачиДоговора] as [Период_След]
		,N'' as [ДопПараметр_1] 
		,[ДоговорРегион] as [Регион] ,[ДоговорРОРегион] as [РОРегион] 
		,null as [ИсполнительСсылка] ,null as [Исполнитель] ,1 as [Колво] ,[ПервичнаяСумма] as [ПервичнаяСумма] , null as [СрВремяРасссмотрения]
		,[СуммаДоговора] as [ЗаявкаСумма] ,null as [ПризнакАннулирования] ,null as [ЕстьОсновнаяЗаявка]
from [dwh_new].[dbo].[mt_requests_loans_mfo]
where not [ДатаВыдачиДоговора] is null and [ДатаВыдачиДоговора] between @DateStart and dateadd(SECOND,-1,dateadd(day,datediff(day,0,Getdate()),0)) 
)
,	tab_VerificationRepMFO_1c as
(
select distinct
datepart(dd,vrf1.[Период_Исх]) as [ДеньМесяца]
,datepart(wk,vrf1.[Период_Исх]) as [Неделя]
,datepart(yyyy,vrf1.[Период_Исх]) as [Год]
,dateadd(MONTH,datediff(MONTH,0,vrf1.[Период_Исх]),0) as [ДатаЧислом]
,dateadd(MONTH,datediff(MONTH,0,vrf1.[Период_Исх]),0) as [ПериодУчета]

,vrf1.[ЗаявкаСсылка_Исх] 
,vrf1.[ЗаявкаНомер_Исх]
,vrf1.[СтатусНаим_Исх]
,vrf1.[СтатусНаим_След]

,vrf1.[НаименованиеПараметра]

,N'' as [Параметр1]
,N'' as [Параметр2]
,N'' as [Параметр3]
,N'' as [Параметр4]
,N'' as [Параметр5]
,N'' as [Параметр6]
,N'' as [Параметр7]
,N'Верификация_отчет' as [НаименованиеЛиста]
,vrf1.[Колво]

,N'' as [Докредитование]
,N'' as [Параметр8]
,vrf1.[Регион]
,vrf1.[ДопПараметр_1]

,vrf1.[РОРегион]
,N'' as [Дивизион]
,vrf1.[Исполнитель]
,N'' as [ДопПараметр_2]
,vrf1.[СрВремяРасссмотрения] as [ВремяРасссмотрения]
,N'' as [Параметр13]
,N'' as [Параметр14]
,N'' as [Параметр15]
,N'' as [Параметр16]
,N'' as [Параметр17]
,N'' as [Параметр18]
,N'' as [Параметр19]
,vrf1.[ДатаСобытия]
,vrf1.[ПервичнаяСумма]
,vrf1.[ЗаявкаСумма] as [Сумма]
--,rts.[ЗаявкаСсылка_Исх] 
--,rts.[ЗаявкаНомер_Исх]
--,rts.[СтатусНаим_Исх]
--,rts.[СтатусНаим_След]
--,zl.[ЕстьОсновнаяЗаявка]
--,rts.[Период_Исх]
--,rts.[Период_След]
 ,vrf1.[ПризнакАннулирования] 
 ,vrf1.[ЕстьОсновнаяЗаявка]
from (
	 select  distinct *	from t10 

	 union all

	 select  distinct *	from t11 

	 union all

	 select  distinct *	from t12 

	 union all

	 select  distinct *	from t20  

	 union all

	 select  distinct  * from t2u

	 union all

	 select  distinct  * from t21 

	 union all

	 select  distinct  * from t22 

	 union all

	 select  distinct  * from t3   

	 union all
	 
	 select  distinct  * from t3u

	 union all

	 select  distinct *	from t31

	 union all

	 select  distinct *	from t32

	 union all

	 select  distinct *	from t4

	 union all

	 select  distinct *	from t4u

	 union all

	 select  distinct *	from t41

	 union all

	 select  distinct  * from t42

	 union all

	 select  distinct  * from CancelledRequestRegl 

	 union all

	 select  distinct  * from CancelledRequestMistake 

	 union all

	 select  distinct  * from QuantityOfLoan 
) vrf1
)
,	TableVerifSource_2 as
(
select * from TableVerifSource 
where [СтатусНаим_Исх] in (N'Верификация КЦ') 
	  or [СтатусНаим_След] in (N'Отказано' ,N'Отказ документов клиента')
)
--select * from TableVerifSource_2
,	RequestForVerification as  -- Заявки на верификацию (1)
(
select  tvs.[ПризнакАннулирования] ,tvs.[ЕстьОсновнаяЗаявка],
		tvs.[ЗаявкаСсылка_Исх] ,tvs.[ЗаявкаНомер_Исх] ,tvs.[СтатусНаим_Исх] ,tvs.[СтатусНаим_След] 
		,N'Общее кол-во заявок на верификацию' as [НаименованиеПараметра] ,tvs.[ДатаСобытия] ,tvs.[Период_Исх] ,tvs.[Период_След]
		,N'' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[СрВремяРасссмотрения] ,[СуммаЗаявки] ,[ПервичнаяСумма]
from TableVerifSource_2  tvs
left join (select [ЗаявкаСсылка_Исх] ,[СтатусНаим_Исх] ,[Период_Исх] ,rank() over (partition by [ЗаявкаСсылка_Исх] ,[СтатусНаим_Исх] order by [Период_Исх] desc) as [rank]
		   from TableVerifSource_2) tvs1
on tvs.[ЗаявкаСсылка_Исх] = tvs1.[ЗаявкаСсылка_Исх] and tvs.[Период_Исх] = tvs1.[Период_Исх] 
where tvs.[СтатусНаим_Исх] = N'Верификация КЦ' and tvs1.[rank]=1
		and [ПризнакАннулирования]=N''
		and [ЕстьОсновнаяЗаявка] is null
)

,	FailuresOfVerifiers as -- отказы со стороны верификаторов (2)
(
select [ПризнакАннулирования] ,[ЕстьОсновнаяЗаявка] ,tvs.[ЗаявкаСсылка_Исх] ,[ЗаявкаНомер_Исх] ,tvs.[СтатусНаим_Исх] ,[СтатусНаим_След] 
		,N'Кол-во отказов со стороны верификаторов' as [НаименованиеПараметра] ,[ДатаСобытия] ,tvs.[Период_Исх] ,[Период_След]
		,N'' as [ДопПараметр_1] ,[Регион] ,[РОРегион] ,[ИсполнительСсылка] ,[Исполнитель] ,[Колво] ,[СрВремяРасссмотрения] ,[СуммаЗаявки] ,[ПервичнаяСумма]
from TableVerifSource_2 tvs
left join (select [ЗаявкаСсылка_Исх] ,[СтатусНаим_Исх] ,[Период_Исх] ,rank() over (partition by [ЗаявкаСсылка_Исх] ,[СтатусНаим_Исх] order by [Период_Исх] desc) as [rank]
		   from TableVerifSource_2) tvs1
on tvs.[ЗаявкаСсылка_Исх] = tvs1.[ЗаявкаСсылка_Исх] and tvs.[Период_Исх] = tvs1.[Период_Исх] 
where [СтатусНаим_След] in (N'Отказано' ,N'Отказ документов клиента')
		and tvs1.[rank]=1
--		and [ПризнакАннулирования]=N''
--		and [ЕстьОсновнаяЗаявка] is null
)

,	tab_ApprovalTakeRateMFO_1c as
(
select distinct
datepart(dd,vrf2.[Период_Исх]) as [ДеньМесяца]
,datepart(wk,vrf2.[Период_Исх]) as [Неделя]
,datepart(yyyy,vrf2.[Период_Исх]) as [Год]
,cast(dateadd(MONTH,datediff(MONTH,0,vrf2.[Период_Исх]),0) as datetime) as [ДатаЧислом]
,cast(dateadd(MONTH,datediff(MONTH,0,vrf2.[Период_Исх]),0) as datetime) as [ПериодУчета]

,vrf2.[ЗаявкаСсылка_Исх] 
,vrf2.[ЗаявкаНомер_Исх]
,vrf2.[СтатусНаим_Исх]
,vrf2.[СтатусНаим_След]

,vrf2.[НаименованиеПараметра]

,N'' as [Параметр1]
,N'' as [Параметр2]
,N'' as [Параметр3]
,N'' as [Параметр4]
,N'' as [Параметр5]
,N'' as [Параметр6]
,N'' as [Параметр7]
,N'ApprovalTakeRate' as [НаименованиеЛиста]
,vrf2.[Колво]

,N'' as [Докредитование]
,N'' as [Параметр8]
,vrf2.[Регион]
,vrf2.[ДопПараметр_1]

,vrf2.[РОРегион]
,N'' as [Дивизион]
,vrf2.[Исполнитель]
,N'' as [ДопПараметр_2]
,vrf2.[СрВремяРасссмотрения] as [ВремяРасссмотрения]
,N'' as [Параметр13]
,N'' as [Параметр14]
,N'' as [Параметр15]
,N'' as [Параметр16]
,N'' as [Параметр17]
,N'' as [Параметр18]
,N'' as [Параметр19]
,vrf2.[ДатаСобытия]
,vrf2.[СуммаЗаявки]  
,vrf2.[ПервичнаяСумма]
--,rts.[ЗаявкаСсылка_Исх] 
--,rts.[ЗаявкаНомер_Исх]
--,rts.[СтатусНаим_Исх]
--,rts.[СтатусНаим_След]
--,zl.[ЕстьОсновнаяЗаявка]
--,rts.[Период_Исх]
--,rts.[Период_След]
from (
	  select  distinct *
	  from RequestForVerification  -- Заявки на верификацию (1)

	  union all

	  select distinct  *
	  from FailuresOfVerifiers -- отказы со стороны верификаторов (2)

-- 	  union all
-- 	  select distinct  *
-- 	  from QuantityOfLoan  -- Количество выданных займов (3)

	  ) vrf2
)
--select * from tab_ApprovalTakeRateMFO_1c
,	---------------------------------
  t1 as(
select [НаименованиеПараметра] ,[Неделя]
		,[Параметр1]
		,[Параметр2],[Параметр3],[Параметр4],[Параметр5],[Параметр6],[Параметр7]
		,[НаименованиеЛиста] 
		,[Колво]
		,[Год] 
		,[ДопПараметр_1]
		,datediff(day,0,dateadd(day,datediff(day,0,Getdate()),-1))+2 as [ДатаЧислом]
		,datediff(day,0,dateadd(day,datediff(day,0,[ПериодУчета]),0))+2 as [ПериодУчета]

		,[Исполнитель]
		,isnull([ВремяРасссмотрения],0) as [ВремяРасссмотрения]

		,datediff(day,0,dateadd(day,datediff(day,0,[ДатаСобытия]),0))+2 as [ДатаСобытия] 
		,[ДеньМесяца]
		,[Сумма]
		,[ПервичнаяСумма]

from tab_VerificationRepMFO_1c
 )
  --select * from t1 
,	t2 as
 (
select [НаименованиеПараметра] ,[Неделя]
		,[НаименованиеЛиста] 
		,[Колво]
		,[Год]
		,[ДопПараметр_1] 
		,datediff(day,0,dateadd(day,datediff(day,0,Getdate()),-1))+2 as [ДатаЧислом]
		,datediff(day,0,dateadd(day,datediff(day,0,[ПериодУчета]),0))+2 as [ПериодУчета]

		,[Исполнитель]
		,isnull([ВремяРасссмотрения],0) as [ВремяРасссмотрения]

		,datediff(day,0,dateadd(day,datediff(day,0,[ДатаСобытия]),0))+2 as [ДатаСобытия] 
		,[ДеньМесяца]
		,[СуммаЗаявки] as [Сумма]
		,[ПервичнаяСумма]
		--,[ЗаявкаНомер_Исх] as [Параметр1]

 from tab_ApprovalTakeRateMFO_1c
)
  --select * from t2

insert into [Reports].[dbo].[report_Verification_mfo] ([НаименованиеПараметра] ,[Неделя] ,[Параметр1] ,[Параметр2] ,[Параметр3] ,[Параметр4]
														,[Параметр5] ,[Параметр6] ,[Параметр7] 
														,[НаименованиеЛиста] ,[Сумма] 
														,[Год] ,[Докредитование] ,[Параметр8] ,[Регион] ,[Параметр9] 
														,[ДатаЧислом] ,[ПериодУчета] ,[Точка] ,[ПовторностьNew] ,[Срок] 
														,[РОРегион] ,[Дивизион] ,[Исполнитель] ,[Параметр11] ,[ВремяРасссмотрения] 
														,[КредитныйПродукт]	,[Параметр13] ,[Параметр14] ,[Параметр15] ,[ПериодичностьОтчета] 
														,[Дата] ,[Колво] ,[ДатаОперации] ,[ДеньМесяца] ,[Сумма2] ,[ПервичнаяСумма])

select [НаименованиеПараметра] ,[Неделя]
		,N'' as [Параметр1] ,N'' as [Параметр2],N'' as [Параметр3],N'' as [Параметр4],N'' as [Параметр5],N'' as [Параметр6],N'' as [Параметр7]
		,t1.[НаименованиеЛиста] 
		,sum(isnull(t1.[Колво],0)) as [Сумма] 
		,t1.[Год] ,N'' as [Докредитование] ,N'' as [Параметр8] ,N'' as [Регион] ,[ДопПараметр_1] as [Параметр9]
		,t1.[ДатаЧислом]
		,t1.[ПериодУчета]
		,N'' as [Точка] ,N'' as [ПовторностьNew] ,N'' as [Срок] 
		,N'' as [РОРегион] ,N'' as [Дивизион] ,t1.[Исполнитель] as [Исполнитель] ,N'' as [Параметр11] 
		,sum(isnull(t1.[ВремяРасссмотрения],0)) as [ВремяРасссмотрения]
		,N'' as [КредитныйПродукт] ,N'' as [Параметр13] ,N'' as [Параметр14] ,N'' as [Параметр15] ,N'' as [ПериодичностьОтчета] ,N'' as [Дата] 
		,sum(isnull(t1.[Сумма],0)) as [Колво]
		,t1.[ДатаСобытия] as [ДатаОперации]
		,t1.[ДеньМесяца]
		,sum(isnull(t1.[Сумма],0)) as [Сумма2]
		,sum(isnull(t1.[ПервичнаяСумма],0)) as [ПервичнаяСумма]
from t1
group by t1.[НаименованиеПараметра] ,t1.[Неделя] ,t1.[НаименованиеЛиста] ,t1.[Год] ,t1.[ДопПараметр_1] ,t1.[ДатаЧислом]	,t1.[ПериодУчета] ,t1.[Исполнитель] ,t1.[ДатаСобытия] ,t1.[ДеньМесяца] --,t1.[Параметр1]

union all

select t2.[НаименованиеПараметра] ,t2.[Неделя]
		,N'' as [Параметр1] ,N'' as [Параметр2],N'' as [Параметр3],N'' as [Параметр4],N'' as [Параметр5],N'' as [Параметр6],N'' as [Параметр7]
		,t2.[НаименованиеЛиста] 
		,sum(isnull(t2.[Колво],0)) as [Сумма] 
		,t2.[Год] ,N'' as [Докредитование] ,N'' as [Параметр8] ,N'' as [Регион] ,[ДопПараметр_1] as [Параметр9]
		,t2.[ДатаЧислом]
		,t2.[ПериодУчета]
		,N'' as [Точка] ,N'' as [ПовторностьNew] ,N'' as [Срок] 
		,N'' as [РОРегион] ,N'' as [Дивизион] ,t2.[Исполнитель] as [Исполнитель] ,N'' as [Параметр11] 
		,sum(isnull(t2.[ВремяРасссмотрения],0)) as [ВремяРасссмотрения]
		,N'' as [КредитныйПродукт] ,N'' as [Параметр13] ,N'' as [Параметр14] ,N'' as [Параметр15] ,N'' as [ПериодичностьОтчета] ,N'' as [Дата] 
		,sum(isnull(t2.[Сумма],0)) as [Колво]
		,t2.[ДатаСобытия] as [ДатаОперации]
		,t2.[ДеньМесяца]
		,sum(isnull(t2.[Сумма],0)) as [Сумма2]
		,sum(isnull(t2.[ПервичнаяСумма],0)) as [ПервичнаяСумма]
from t2
group by t2.[НаименованиеПараметра] ,t2.[Неделя] ,t2.[НаименованиеЛиста] ,t2.[Год] ,t2.[ДопПараметр_1] ,t2.[ДатаЧислом]	,t2.[ПериодУчета] ,t2.[Исполнитель] ,t2.[ДатаСобытия] ,t2.[ДеньМесяца] --,t2.[Параметр1]


-------------------------------------------
------ ЗАПОЛНИМ НОВУЮ ТАБЛИЦУ
-------------------------------------------

drop table if exists #fioClient_exception
create table #fioClient_exception([cleint] nvarchar(255) null)
insert into #fioClient_exception
select 'ТЕСТОВА ЗАЯВКА ЛКП' cleint
union
select 'ТЕСТ НА ТЕСТЕ'


drop table if exists #t0 
select 
	 [НаименованиеПараметра]= [Status]
	 ,[Неделя]				= datepart(ww,actiondate)
     ,[НаименованиеЛиста]		= 'Верификация_отчет'
	 ,[Сумма]				= 1 --count(external_id)
     ,[Год]					= datepart(yyyy,actiondate)	 
	 ,[Параметр9]			= case
									when [Indicator] ='Кол-во заявок общее (время)' then 'Кол-во заявок'
									when [Indicator] ='Кол-во заявок уникальное (время)' then 'Кол-во заявок_уник'
									when [Indicator] ='Кол-во заявок одобрено (время)' then 'Кол-во одобренных'
									else [Indicator]
							  end

	 ,[ДатаЧислом]			= datediff(day,0,dateadd(day,datediff(day,0,Getdate()),-1))+2
	 ,[ПериодУчета]			= datediff(day,0,dateadd(day,datediff(day,0,[period]),0))+2
	 ,[Исполнитель]			= [Employee]
     ,[ВремяРасссмотрения]	= [Value]

      ,[Дата]					= cast(actiondate as date)

      ,[ДатаОперации]			= accdate
      ,[ДеньМесяца]				= datepart(dd,actiondate)

into #t0 
from [dwh_new].[dbo].[mt_report_verification_new]
where [Факт/План] = 'Факт' and accdate >= cast(dateadd(month,datediff(month,0,dateadd(month,-1,getdate())),0) as date) and accdate < dateadd(day,datediff(day,0,Getdate()),0)
		and not fio_client in (select * from #fioClient_exception)

--select [НаименованиеПараметра] ,[Неделя] ,[НаименованиеЛиста] ,sum([Сумма]) 
--		,[Год] ,[Параметр9] ,[ДатаЧислом] ,[ПериодУчета] ,[Исполнитель] 
--		,sum([ВремяРасссмотрения]) ,[Дата] ,[ДатаОперации] ,[ДеньМесяца]

--from #t0
--group by [НаименованиеПараметра] ,[Неделя] ,[НаименованиеЛиста]
--		,[Год] ,[Параметр9] ,[ДатаЧислом] ,[ПериодУчета] ,[Исполнитель] 
--		,[Дата] ,[ДатаОперации] ,[ДеньМесяца]

drop table if exists #table_report 

select  
	  [НаименованиеПараметра]	= [НаименованиеПараметра]
      ,[Неделя]					= [Неделя]
      ,[Параметр1]				= ''
      ,[Параметр2]				= ''
      ,[Параметр3]				= ''
      ,[Параметр4]				= ''
      ,[Параметр5]				= ''
      ,[Параметр6]				= ''
      ,[Параметр7]				= ''
      ,[НаименованиеЛиста]		= [НаименованиеЛиста]
      ,[Сумма]					= sum([Сумма])
      ,[Год]					= [Год]
      ,[Докредитование]			= ''
      ,[Параметр8]				= ''
      ,[Регион]					= ''
      ,[Параметр9]				= [Параметр9]
      ,[ДатаЧислом]				= [ДатаЧислом]
      ,[ПериодУчета]			= [ПериодУчета]
      ,[Точка]					= ''
      ,[ПовторностьNew]			= ''
      ,[Срок]					= ''
      ,[РОРегион]				= ''
      ,[Дивизион]				= ''
      ,[Исполнитель]			= [Исполнитель]
      ,[Параметр11]				= ''
      ,[ВремяРасссмотрения]		= sum([ВремяРасссмотрения])
      ,[КредитныйПродукт]		= ''
      ,[Параметр13]				= ''
      ,[Параметр14]				= ''
      ,[Параметр15]				= ''
      ,[ПериодичностьОтчета]	= ''
      ,[Дата]					= [Дата]
      ,[Колво]					= ''
      ,[ДатаОперации]			= [ДатаОперации]
      ,[ДеньМесяца]				= [ДеньМесяца]
      ,[Сумма2]					= ''
      ,[ПервичнаяСумма]			= ''
into #table_report
from #t0
group by [НаименованиеПараметра] ,[Неделя] ,[НаименованиеЛиста] 
		,[Год] ,[Параметр9] ,[ДатаЧислом] ,[ПериодУчета] ,[Исполнитель] 
		,[Дата] ,[ДатаОперации] ,[ДеньМесяца]

--select * from #table_report order by [ДатаОперации] desc

--drop table [Reports].[dbo].[report_Verification_mfo_new]
truncate table [Reports].[dbo].[report_Verification_mfo_new]
insert into [Reports].[dbo].[report_Verification_mfo_new] ( [НаименованиеПараметра] ,[Неделя]
															  ,[Параметр1] ,[Параметр2] ,[Параметр3] ,[Параметр4] ,[Параметр5] ,[Параметр6] ,[Параметр7]
															  ,[НаименованиеЛиста] ,[Сумма] ,[Год] ,[Докредитование] ,[Параметр8]
															  ,[Регион] ,[Параметр9] ,[ДатаЧислом] ,[ПериодУчета] ,[Точка] ,[ПовторностьNew]
															  ,[Срок] ,[РОРегион] ,[Дивизион] ,[Исполнитель]
															  ,[Параметр11]
															  ,[ВремяРасссмотрения]
															  ,[КредитныйПродукт] ,[Параметр13] ,[Параметр14] ,[Параметр15] ,[ПериодичностьОтчета]
															  ,[Дата] ,[Колво] ,[ДатаОперации] ,[ДеньМесяца]
															  ,[Сумма2] ,[ПервичнаяСумма]
															)


select *
--into [Reports].[dbo].[report_Verification_mfo_new]
from #table_report




END


