-- =============================================
-- Author:		Курдин С.В.
-- Create date: 2019-05-22
-- Description:	Таблица содержит информацию о состоянии взаиморасчетов в ЦМР по выданным займа
--				
-- =============================================
CREATE PROCEDURE [etl].[base_etl_mt_credit_portfolio_cmr_v22]
	-- Add the parameters for the stored procedure here
--	@ForDate datetime =cast(getdate() as date)

AS
BEGIN
	-- SET NOCOUNT ON added to prevent extra result sets from
	-- interfering with SELECT statements.
	SET NOCOUNT ON;

declare @DateStart datetime,
		@DateStart2 datetime,
		@DateStart2000 datetime,
		@DateStartCurr datetime,
		@DateStartCurr2000 datetime
set @DateStart=	dateadd(MONTH,datediff(MONTH,0,dateadd(month,-43,dateadd(year,2000,Getdate()))),0)	--dateadd(MONTH,datediff(MONTH,0,dateadd(month,-43,Getdate())),0)
--dateadd(day,-datediff(day,cast('20170101' as datetime),getdate()),getdate())
--dateadd(month,datediff(month,0,GetDate()),-720);
--dateadd(day,datediff(day,0,GetDate()-2),0);
set	@DateStart2=dateadd(year,2000,@DateStart);
set @DateStart2000= dateadd(day,datediff(day,0,dateadd(year,2000,dateadd(day,-10,Getdate()))),0);
set @DateStartCurr=dateadd(day,0,dateadd(day,datediff(day,0,Getdate()),0));	-- Переменная для начала (дня) оперативного обновления данных по периоду статуса за последние 14 дней для поля с текущей датой
set @DateStartCurr2000=dateadd(day,-14,dateadd(day,datediff(day,0,dateadd(year,2000,Getdate())),0));	-- Переменная для начала (дня) оперативного обновления данных по периоду статуса за последние 14 дней для поля с текущей датой + 2000

--delete from [dwh_new].[dbo].[mt_credit_portfolio_cmr_v2] 
--where [ДатаОбновленияЗаписи] >= @DateStartCurr;

if OBJECT_ID('[dwh_new].[dbo].[mt_credit_portfolio_cmr_v22]') is not null
drop table [dwh_new].[dbo].[mt_credit_portfolio_cmr_v22];
--truncate table [dwh_new].[dbo].[mt_credit_portfolio_cmr_v22];

create table [dwh_new].[dbo].[mt_credit_portfolio_cmr_v22]
(
[Ссылка] binary(16) null
,[ДоговорНомер] nvarchar(255)
,[Сумма] decimal(15,2) null
,[ДатаУчета] datetime
,[Договор] binary(16) null
--,r.[ДоговорНомер]
,[ДоговораСумма] decimal(15,2) null
,[ОДНачислено] decimal(15,2) null 
,[ОДНачислено_Накоп] decimal(15,2) null 
,[ОДОплачено]  decimal(15,2) null
,[ОДОплачено_Накоп]  decimal(15,2) null
,[ОстЗадолжОД] decimal(15,2) null
,[ПроцНачислено]  decimal(15,2) null
,[ПроцНачислено_Накоп]  decimal(15,2) null
,[ПроцОплачено]  decimal(15,2) null
,[ПроцОплачено_Накоп] decimal(15,2) null 
,[ОстЗадолжПроц] decimal(15,2) null
,[ПениНачислено]  decimal(15,2) null
,[ПениНачислено_Накоп]  decimal(15,2) null
,[ПениОплачено]  decimal(15,2) null
,[ПениОплачено_Накоп]  decimal(15,2) null
,[ОстЗадолжПени] decimal(15,2) null
,[ГоспошлинаНачислено]  decimal(15,2) null
,[ГоспошлинаНачислено_Накоп] decimal(15,2) null 
,[ГоспошлинаОплачено] decimal(15,2) null 
,[ГоспошлинаОплачено_Накоп] decimal(15,2) null 
,[ОстЗадолжГоспошлина] decimal(15,2) null
,[ПереплатаНачислено] decimal(15,2) null 
,[ПереплатаНачислено_Накоп] decimal(15,2) null 
,[ПереплатаОплачено] decimal(15,2) null 
,[ПереплатаОплачено_Накоп]  decimal(15,2) null
,[ОстЗадолжПереплата] decimal(15,2) null
,[ПроцГрейсНачислено]  decimal(15,2) null
,[ПроцГрейсНачислено_Накоп]  decimal(15,2) null
,[ПроцГрейсОплачено] decimal(15,2) null 
,[ПроцГрейсОплачено_Накоп] decimal(15,2) null 
,[ОстЗадолжПроцГрейс] decimal(15,2) null
,[ПениГрейсНачислено]  decimal(15,2) null
,[ПениГрейсНачислено_Накоп] decimal(15,2) null 
,[ПениГрейсОплачено] decimal(15,2) null
,[ПениГрейсОплачено_Накоп] decimal(15,2) null 
,[ОстЗадолжПениГрейс] decimal(15,2) null

,[КолвоПолнДнПросрочки]  numeric(7,0) null
,[Бакет_cmr] nvarchar(50) null
,[ДатаВозникновенияПросрочки] datetime null
															
,[ТекСатус] nvarchar(255) null
,[СтатусПоДням] nvarchar(255) null
,[Активен_cmr] int null
,[Обслуживается_cmr] int null
);

with cmr_st as
(
select d.[Ссылка] ,d.[Код] ,d.[Сумма]
	   ,r.[ДатаУчета] ,r.[Договор] ,r.[ДоговорНомер]
      ,r.[ДоговорСумма]
      ,r.[ОДНачислено] ,r.[ОДНачислено_Накоп] ,r.[ОДОплачено] ,r.[ОДОплачено_Накоп]
      ,r.[ПроцНачислено] ,r.[ПроцНачислено_Накоп] ,r.[ПроцОплачено] ,r.[ПроцОплачено_Накоп]
      ,r.[ПениНачислено] ,r.[ПениНачислено_Накоп] ,r.[ПениОплачено] ,r.[ПениОплачено_Накоп]
      ,r.[ГоспошлинаНачислено] ,r.[ГоспошлинаНачислено_Накоп] ,[ГоспошлинаОплачено] ,r.[ГоспошлинаОплачено_Накоп]
      ,r.[ПереплатаНачислено] ,r.[ПереплатаНачислено_Накоп] ,r.[ПереплатаОплачено] ,r.[ПереплатаОплачено_Накоп]
      ,r.[ПроцГрейсНачислено] ,r.[ПроцГрейсНачислено_Накоп] ,r.[ПроцГрейсОплачено] ,r.[ПроцГрейсОплачено_Накоп]
      ,r.[ПениГрейсНачислено] ,r.[ПениГрейсНачислено_Накоп] ,r.[ПениГрейсОплачено] ,r.[ПениГрейсОплачено_Накоп]

	  ,s.[Статус]
	  ,LAG(s.[Статус]) over(partition by r.[Договор] order by r.[ДатаУчета]) as [ДопСтатус]
	 -- ,case when [Статус] is null then 0 else 1 end as [СчетчикГруппыСтатусов]
	 -- ,case 
		--when [ДатаВозникновенияПросрочки] is null then 0 
		--when LAG([ДатаВозникновенияПросрочки]) over(partition by r.[Договор] order by r.[ДатаУчета])=[ДатаВозникновенияПросрочки] then 0
		--else 1 
	 -- end as [СчДатыПросрочки]
	  ,case when p.[ДатаВозникновенияПросрочки] is null then 0 else p.[КоличествоПолныхДнейПросрочки] end as [КоличествоПолныхДнейПросрочки] 
	  ,case when p.[ДатаВозникновенияПросрочки] is null then '2001-01-01 00:00:00.000' else p.[ДатаВозникновенияПросрочки] end as [ДатаВозникновенияПросрочки]

from [Stg].[_1cCMR].[Справочник_Договоры] d with (nolock)
left join  [Stg].[dbo].[aux_CreditPortfCMR_Acc] r with (nolock)
on d.[Ссылка]=r.[Договор]
left join (select dateadd(day,datediff(day,0,dateadd(year,-2000,[Период])),0) as [ДатаУчета] ,[Договор] ,[Статус] from [Stg].[_1cCMR].[РегистрСведений_СтатусыДоговоров] with (nolock)) s
on r.[ДатаУчета]=s.[ДатаУчета] and d.[Ссылка]=s.[Договор]
left join (select distinct dateadd(day,datediff(day,0,dateadd(year,-2000,[Период])),0) as [ДатаУчета] ,[Договор] 
				  ,[КоличествоПолныхДнейПросрочки] ,[ДатаВозникновенияПросрочки] ,[ПросроченнаяЗадолженность] 
		   from [Stg].[_1cCMR].[РегистрСведений_АналитическиеПоказателиМФО] with (nolock)
		   ) p
on r.[ДатаУчета]=p.[ДатаУчета] and d.[Ссылка]=p.[Договор]
--where r.[ДоговорНомер]=N'1703295890001'	--r.[ДатаУчета] > = dateadd(day,datediff(day,0,dateadd(day,-100,Getdate())),0)	and  		--not r.[Договор] is null
--order by r.[ДатаУчета] desc
)
--select * from cmr_st

,	cmr_st_pl as
(
select [Ссылка] ,[Код] ,[Сумма]
	   ,[ДатаУчета] ,[Договор] ,[ДоговорНомер]
      ,[ДоговорСумма]
      ,[ОДНачислено] ,[ОДНачислено_Накоп] ,[ОДОплачено] ,[ОДОплачено_Накоп]
      ,[ПроцНачислено] ,[ПроцНачислено_Накоп] ,[ПроцОплачено] ,[ПроцОплачено_Накоп]
      ,[ПениНачислено] ,[ПениНачислено_Накоп] ,[ПениОплачено] ,[ПениОплачено_Накоп]
      ,[ГоспошлинаНачислено] ,[ГоспошлинаНачислено_Накоп] ,[ГоспошлинаОплачено] ,[ГоспошлинаОплачено_Накоп]
      ,[ПереплатаНачислено] ,[ПереплатаНачислено_Накоп] ,[ПереплатаОплачено] ,[ПереплатаОплачено_Накоп]
      ,[ПроцГрейсНачислено] ,[ПроцГрейсНачислено_Накоп] ,[ПроцГрейсОплачено] ,[ПроцГрейсОплачено_Накоп]
      ,[ПениГрейсНачислено] ,[ПениГрейсНачислено_Накоп] ,[ПениГрейсОплачено] ,[ПениГрейсОплачено_Накоп]
	  ,[Статус] ,[ДопСтатус]
	  ,case when [Статус] is null then 0 else 1 end as [СчетчикГруппыСтатусов]
	  ,case 
		when [ДатаВозникновенияПросрочки] is null then 0 
		when LAG([ДатаВозникновенияПросрочки]) over(partition by [Договор] order by [ДатаУчета])=[ДатаВозникновенияПросрочки] then 0
		else 1 
	  end as [СчДатыПросрочки]
	  ,[КоличествоПолныхДнейПросрочки] 
	  ,[ДатаВозникновенияПросрочки]
from cmr_st
)
--select distinct * from cmr_st_pl
,	cmr_StatusName as
(select distinct [Ссылка] ,[Наименование] from [Stg].[_1cCMR].[Справочник_СтатусыДоговоров] sd with (nolock))

,	cmr_GroupOfStatuses as
(
select distinct [ДатаУчета] ,sp.[Ссылка] ,sp.[ДоговорНомер],[Статус]
		,sum([СчетчикГруппыСтатусов]) over(partition by sp.[Ссылка] order by [ДатаУчета]
						rows between unbounded preceding and current row) as [ГруппаСтатуса]  

		,sum([СчДатыПросрочки]) over(partition by sp.[Ссылка] order by [ДатаУчета]
						rows between unbounded preceding and current row) as [ГруппаДнПроср]
		,[ДатаВозникновенияПросрочки]
		,[КоличествоПолныхДнейПросрочки] 

		,sn.[Наименование] as [СтатусПоДнямНаим]

from cmr_st_pl sp--order by [ДатаУчета] desc
left join cmr_StatusName sn
on sp.[Статус]=sn.[Ссылка]
--group by [ДатаВозникновенияПросрочки]
)
--select * from cmr_GroupOfStatuses --where [ДоговорНомер]=N'1703295890001' -- [Ссылка]=0x80C200155D01C00211E3988EAC06BD29 
--order by [ДатаУчета] desc 
,	cmr_StatOnDay as
(
select distinct dateadd(year,2000,[ДатаУчета]) as [ДатаУчета] ,[Ссылка] ,[ДоговорНомер] ,[Статус] ,[СтатусПоДнямНаим]
		,[ГруппаСтатуса]
		,first_value([СтатусПоДнямНаим]) over(partition by [Ссылка] ,[ГруппаСтатуса] order by [ДатаУчета]) as [СтатусПоДням]
		,[ГруппаДнПроср]
		,first_value([ДатаВозникновенияПросрочки]) over(partition by [Ссылка] ,[ГруппаДнПроср] order by [ДатаУчета]) as [ДатаВознПоДням]
		,first_value([ДатаВозникновенияПросрочки]) over(partition by [Ссылка] ,[ГруппаСтатуса] order by [ДатаУчета]) as [ДатаВознПоДням2]
		,[КоличествоПолныхДнейПросрочки] 
		,[ДатаВозникновенияПросрочки] 
from cmr_GroupOfStatuses
)
--select * from cmr_StatOnDay --where  [ДоговорНомер]=N'1703295890001' order by [ДатаУчета] desc --,[ДоговорНомер] desc ,
,	cmr_StatOnDay2 as
(
select [ДатаУчета] ,[Ссылка] ,[ДоговорНомер] ,[Статус] ,[СтатусПоДнямНаим]
		--,[ГруппаСтатуса]
		,[СтатусПоДням]
		--,[ГруппаДнПроср]
		,[ДатаВознПоДням]
		,case when [ДатаВознПоДням]='2001-01-01 00:00:00.000' then 0 else datediff(day,cast([ДатаВознПоДням] as datetime),cast([ДатаУчета] as datetime))end as [ДнПросрПоДнямНов]
		,case when [ДатаВознПоДням2]='2001-01-01 00:00:00.000' and [ДатаВознПоДням2]<[ДатаВознПоДням] then [ДатаВознПоДням] else [ДатаВознПоДням2] end as [ДатаВознПоДням2]
		--,case 
		--	when datediff(day,cast([ДатаВознПоДням] as datetime),cast([ДатаУчета] as datetime)) is null or [КоличествоПолныхДнейПросрочки]=0 then 0
		--	when [КоличествоПолныхДнейПросрочки] is null and ([ДатаВозникновенияПросрочки] is null or ([СтатусПоДням]=N'Погашен' or [СтатусПоДням]=N'Аннулирован')) then 0
		--	--when [КоличествоПолныхДнейПросрочки] is null then datediff(day,cast([ДатаВознПоДням] as datetime2),cast([ДатаУчета] as datetime2))-1
		--	else datediff(day,cast([ДатаВознПоДням] as datetime),cast([ДатаУчета] as datetime))
		--end as [ДнПросрПоДнямНов2]
		,case 
			when [ДатаВознПоДням2]='2001-01-01 00:00:00.000' and [ДатаВознПоДням2]<[ДатаВознПоДням] then datediff(day,[ДатаВознПоДням],[ДатаУчета])
			when [ДатаВознПоДням2]='2001-01-01 00:00:00.000' and [ДатаВознПоДням2]=[ДатаВознПоДням] then 0
			else datediff(day,[ДатаВознПоДням2],[ДатаУчета]) 
		end as [ДнПросрПоДнямНов2]
		--,case 
		--	when [КоличествоПолныхДнейПросрочки] is null and ([ДатаВозникновенияПросрочки] is null or ([СтатусПоДням]=N'Погашен' or [СтатусПоДням]=N'Аннулирован')) 
		--		then datediff(day,cast([ДатаВознПоДням2] as datetime),cast([ДатаУчета] as datetime))
		--	when [КоличествоПолныхДнейПросрочки] is null then datediff(day,cast([ДатаВознПоДням2] as datetime2),cast([ДатаУчета] as datetime))
		--	--when [КоличествоПолныхДнейПросрочки] is null then datediff(day,cast([ДатаВознПоДням] as datetime2),cast([ДатаУчета] as datetime2))-1
		--	else [КоличествоПолныхДнейПросрочки]
		--end as [ДнПросрПоДнямНов]
		
		,[КоличествоПолныхДнейПросрочки] 
		,[ДатаВозникновенияПросрочки] 
from cmr_StatOnDay
)
--select * from cmr_StatOnDay2 order by [ДатаУчета] desc--where [ДоговорНомер]=N'1703295890001' order by [ДатаУчета] desc --,[ДоговорНомер] desc ,

, cmr_st0 as
(
select sd2.[ДатаУчета] as [ДатаУчета_add] ,r.[ДатаУчета] 
		,sd2.[Ссылка] as [Ссылка_add] ,r.[Ссылка] 
		,sd2.[ДоговорНомер] as [ДоговорНомер_add], r.[ДоговорНомер] 
		
		,sd2.[Статус]
		,[СтатусПоДням]
		,[СтатусПоДнямНаим]
		
		,r.[КоличествоПолныхДнейПросрочки] ,r.[ДатаВозникновенияПросрочки]
		,case
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)=0 then N'Непросроченный'
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>0 and isnull(r.[КоличествоПолныхДнейПросрочки],0)<4 then N'_1-3' --N'a' -- N'_1-3' --
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>3 and isnull(r.[КоличествоПолныхДнейПросрочки],0)<31 then N'_4-30' --N'b' -- N'_4-30' --
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>30 and isnull(r.[КоличествоПолныхДнейПросрочки],0)<61 then N'31-60' --N'c' -- N'31-60' --
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>60 and isnull(r.[КоличествоПолныхДнейПросрочки],0)<91 then N'61-90' --N'd' -- N'61-90' --
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>90 and isnull(r.[КоличествоПолныхДнейПросрочки],0)<121 then N'91-120' --N'f' -- N'91-120' --
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>120 and isnull(r.[КоличествоПолныхДнейПросрочки],0)<151 then N'121-150' --N'g' -- N'121-150' --
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>150 and isnull(r.[КоличествоПолныхДнейПросрочки],0)<181 then N'151-180' --N'h' -- N'151-180' --
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>180 and isnull(r.[КоличествоПолныхДнейПросрочки],0)<211 then N'181-210' --N'' -- N'181-210' --
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>210 and isnull(r.[КоличествоПолныхДнейПросрочки],0)<241 then N'211-240'
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>240 and isnull(r.[КоличествоПолныхДнейПросрочки],0)<271 then N'241-270' --N'' -- N'241-270' --
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>270 and isnull(r.[КоличествоПолныхДнейПросрочки],0)<301 then N'271-300' --
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>300 and isnull(r.[КоличествоПолныхДнейПросрочки],0)<331 then N'301-330' --
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>330 and isnull(r.[КоличествоПолныхДнейПросрочки],0)<361 then N'331-360'
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>360 and isnull(r.[КоличествоПолныхДнейПросрочки],0)<391 then N'361-390'
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>390 and isnull(r.[КоличествоПолныхДнейПросрочки],0)<421 then N'391-420'
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>420 and isnull(r.[КоличествоПолныхДнейПросрочки],0)<451 then N'421-450'
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>450 and isnull(r.[КоличествоПолныхДнейПросрочки],0)<481 then N'451-480'
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>480 and isnull(r.[КоличествоПолныхДнейПросрочки],0)<511 then N'481-510'
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>510 and isnull(r.[КоличествоПолныхДнейПросрочки],0)<541 then N'511-540'
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>540 and isnull(r.[КоличествоПолныхДнейПросрочки],0)<571 then N'541-570'
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>570 and isnull(r.[КоличествоПолныхДнейПросрочки],0)<601 then N'571-600'
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>600 and isnull(r.[КоличествоПолныхДнейПросрочки],0)<631 then N'601-630'
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>630 and isnull(r.[КоличествоПолныхДнейПросрочки],0)<661 then N'631-660'
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>660 and isnull(r.[КоличествоПолныхДнейПросрочки],0)<691 then N'661-690'
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>690 and isnull(r.[КоличествоПолныхДнейПросрочки],0)<721 then N'691-720'
			when isnull(r.[КоличествоПолныхДнейПросрочки],0)>720 then N'Более 720'
		end as [Бакет_cmr]
		,r.[ДатаУчета] as [ДатаУчета2]
		,[ДнПросрПоДнямНов2]
		,case
			when isnull([ДнПросрПоДнямНов2],0)=0 then N'Непросроченный'
			when isnull([ДнПросрПоДнямНов2],0)>0 and isnull([ДнПросрПоДнямНов2],0)<4 then N'_1-3' --N'a' -- N'_1-3' --
			when isnull([ДнПросрПоДнямНов2],0)>3 and isnull([ДнПросрПоДнямНов2],0)<31 then N'_4-30' --N'b' -- N'_4-30' --
			when isnull([ДнПросрПоДнямНов2],0)>30 and isnull([ДнПросрПоДнямНов2],0)<61 then N'31-60' --N'c' -- N'31-60' --
			when isnull([ДнПросрПоДнямНов2],0)>60 and isnull([ДнПросрПоДнямНов2],0)<91 then N'61-90' --N'd' -- N'61-90' --
			when isnull([ДнПросрПоДнямНов2],0)>90 and isnull([ДнПросрПоДнямНов2],0)<121 then N'91-120' --N'f' -- N'91-120' --
			when isnull([ДнПросрПоДнямНов2],0)>120 and isnull([ДнПросрПоДнямНов2],0)<151 then N'121-150' --N'g' -- N'121-150' --
			when isnull([ДнПросрПоДнямНов2],0)>150 and isnull([ДнПросрПоДнямНов2],0)<181 then N'151-180' --N'h' -- N'151-180' --
			when isnull([ДнПросрПоДнямНов2],0)>180 and isnull([ДнПросрПоДнямНов2],0)<211 then N'181-210' --N'' -- N'181-210' --
			when isnull([ДнПросрПоДнямНов2],0)>210 and isnull([ДнПросрПоДнямНов2],0)<241 then N'211-240'
			when isnull([ДнПросрПоДнямНов2],0)>240 and isnull([ДнПросрПоДнямНов2],0)<271 then N'241-270' --N'' -- N'241-270' --
			when isnull([ДнПросрПоДнямНов2],0)>270 and isnull([ДнПросрПоДнямНов2],0)<301 then N'271-300' --
			when isnull([ДнПросрПоДнямНов2],0)>300 and isnull([ДнПросрПоДнямНов2],0)<331 then N'301-330' --
			when isnull([ДнПросрПоДнямНов2],0)>330 and isnull([ДнПросрПоДнямНов2],0)<361 then N'331-360'
			when isnull([ДнПросрПоДнямНов2],0)>360 and isnull([ДнПросрПоДнямНов2],0)<391 then N'361-390'
			when isnull([ДнПросрПоДнямНов2],0)>390 and isnull([ДнПросрПоДнямНов2],0)<421 then N'391-420'
			when isnull([ДнПросрПоДнямНов2],0)>420 and isnull([ДнПросрПоДнямНов2],0)<451 then N'421-450'
			when isnull([ДнПросрПоДнямНов2],0)>450 and isnull([ДнПросрПоДнямНов2],0)<481 then N'451-480'
			when isnull([ДнПросрПоДнямНов2],0)>480 and isnull([ДнПросрПоДнямНов2],0)<511 then N'481-510'
			when isnull([ДнПросрПоДнямНов2],0)>510 and isnull([ДнПросрПоДнямНов2],0)<541 then N'511-540'
			when isnull([ДнПросрПоДнямНов2],0)>540 and isnull([ДнПросрПоДнямНов2],0)<571 then N'541-570'
			when isnull([ДнПросрПоДнямНов2],0)>570 and isnull([ДнПросрПоДнямНов2],0)<601 then N'571-600'
			when isnull([ДнПросрПоДнямНов2],0)>600 and isnull([ДнПросрПоДнямНов2],0)<631 then N'601-630'
			when isnull([ДнПросрПоДнямНов2],0)>630 and isnull([ДнПросрПоДнямНов2],0)<661 then N'631-660'
			when isnull([ДнПросрПоДнямНов2],0)>660 and isnull([ДнПросрПоДнямНов2],0)<691 then N'661-690'
			when isnull([ДнПросрПоДнямНов2],0)>690 and isnull([ДнПросрПоДнямНов2],0)<721 then N'691-720'
			when isnull([ДнПросрПоДнямНов2],0)>720 then N'Более 720'
		end as [Бакет_cmr_new]
		,[ДатаВознПоДням2]
from cmr_st_pl r
right join cmr_StatOnDay2 sd2
on r.[Ссылка]=sd2.[Ссылка] and dateadd(year,2000,r.[ДатаУчета])=sd2.[ДатаУчета]
)
--select distinct * from cmr_st0 order by [ДатаУчета_add] desc
,	cmr_laststatus as
(
select d.[Ссылка] as [Договор] ,st.[Статус] as [ТекСатус] 
	   ,null as [Активен_cmr] --cs.[Активен] as [Активен_cmr] 
	   ,null as [Обслуживается_cmr]--cs.[Обслуживается] as [Обслуживается_cmr] 
from [Stg].[_1cCMR].[Справочник_Договоры] d  with (nolock)
--left join cmr_serv cs
--on d.[Ссылка]=cs.[Договор]
left join (select [Договор] ,[Статус]
		   from (select [Период] ,[Договор] ,[Статус] 
						,rank() over(partition by [Договор] order by [Период] desc) as [rank_p] 
				 from [Stg].[_1cCMR].[РегистрСведений_СтатусыДоговоров] with (nolock)
				 ) ls
			where ls.[rank_p]=1
		   ) st
on d.[Ссылка]=st.[Договор]
)
--select * from cmr_laststatus
,	cmr_res as
(
select r.[Ссылка] ,r.[Код] as [ДоговорНомер] ,r.[Сумма]
	  ,r.[ДатаУчета] ,r.[Договор] --,r.[ДоговорНомер]
      ,isnull(r.[ДоговорСумма] ,r.[Сумма]) as [ДоговораСумма]

      ,r.[ОДНачислено] ,r.[ОДНачислено_Накоп] ,r.[ОДОплачено] ,r.[ОДОплачено_Накоп] 
	  ,(r.[Сумма] - isnull(r.[ОДОплачено_Накоп],0)) as [ОстЗадолжОД]

      ,r.[ПроцНачислено] ,r.[ПроцНачислено_Накоп] ,r.[ПроцОплачено] ,r.[ПроцОплачено_Накоп] 
	  ,(isnull(r.[ПроцНачислено_Накоп],0)-isnull(r.[ПроцОплачено_Накоп],0)) as [ОстЗадолжПроц]

      ,r.[ПениНачислено] ,r.[ПениНачислено_Накоп] ,r.[ПениОплачено] ,r.[ПениОплачено_Накоп] 
	  ,(isnull(r.[ПениНачислено_Накоп],0)-isnull(r.[ПениОплачено_Накоп],0)) as [ОстЗадолжПени]

      ,r.[ГоспошлинаНачислено] ,r.[ГоспошлинаНачислено_Накоп] ,[ГоспошлинаОплачено] ,r.[ГоспошлинаОплачено_Накоп] 
	  ,(isnull(r.[ГоспошлинаНачислено_Накоп],0)-isnull(r.[ГоспошлинаОплачено_Накоп],0)) as [ОстЗадолжГоспошлина]

      ,r.[ПереплатаНачислено] ,r.[ПереплатаНачислено_Накоп] ,r.[ПереплатаОплачено] ,r.[ПереплатаОплачено_Накоп] 
	  ,(isnull(r.[ПереплатаНачислено_Накоп],0)-isnull(r.[ПереплатаОплачено_Накоп],0)) as [ОстЗадолжПереплата]

      ,r.[ПроцГрейсНачислено] ,r.[ПроцГрейсНачислено_Накоп] ,r.[ПроцГрейсОплачено] ,r.[ПроцГрейсОплачено_Накоп] 
	  ,(isnull(r.[ПроцГрейсНачислено_Накоп],0)-isnull(r.[ПроцГрейсОплачено_Накоп],0)) as [ОстЗадолжПроцГрейс]

      ,r.[ПениГрейсНачислено] ,r.[ПениГрейсНачислено_Накоп] ,r.[ПениГрейсОплачено] ,r.[ПениГрейсОплачено_Накоп] 
	  ,(isnull(r.[ПениГрейсНачислено_Накоп],0)-isnull(r.[ПениГрейсОплачено_Накоп],0)) as [ОстЗадолжПениГрейс]

	  ,isnull(r2.[ДнПросрПоДнямНов2],0) as [КолвоПолнДнПросрочки] 	-- isnull(r2.[КоличествоПолныхДнейПросрочки],0) as [КолвоПолнДнПросрочки]
	  --,r2.[Бакет_cmr] as [Бакет_cmr]
	  ,r2.[Бакет_cmr_new] as [Бакет_cmr] --[Бакет_cmr_new] 	--r2.[Бакет_cmr] 
	  --,r.[ДатаВозникновенияПросрочки] as [ДатаВозникновенияПросрочки]
	  ,r2.[ДатаВознПоДням2] as [ДатаВозникновенияПросрочки] --[ДатаВозникновенияПросрочки2] --case when not r2.[ДатаВознПоДням2] is null then r2.[ДатаВознПоДням2] else 0 end as [ДатаВозникновенияПросрочки2]

	  ,sd.[Наименование] as [ТекСатус]
	  ,r2.[СтатусПоДням]
	  ,r3.[Активен_cmr] ,r3.[Обслуживается_cmr]

from cmr_st_pl r
left join cmr_st0 r2
on r.[Договор]=r2.[Ссылка] and r.[ДатаУчета]=r2.[ДатаУчета]
--left join cmr_StatOnDay rs
--on r.[Договор]=rs.[Ссылка] and r.[ДатаУчета]=rs.[ДатаУчета]
left join cmr_laststatus r3
on r.[Договор]=r3.[Договор]
left join cmr_StatusName sd
on r3.[ТекСатус]=sd.[Ссылка]
)

--select distinct * from cmr_res order by [ДатаУчета] asc

insert into [dwh_new].[dbo].[mt_credit_portfolio_cmr_v22] ([Ссылка] ,[ДоговорНомер] ,[Сумма]
															,[ДатаУчета] ,[Договор] --,r.[ДоговорНомер]
															,[ДоговораСумма]
															,[ОДНачислено] ,[ОДНачислено_Накоп] 
															,[ОДОплачено] ,[ОДОплачено_Накоп] 
															,[ОстЗадолжОД]

															,[ПроцНачислено] ,[ПроцНачислено_Накоп] 
															,[ПроцОплачено] ,[ПроцОплачено_Накоп] 
															,[ОстЗадолжПроц]

															,[ПениНачислено] ,[ПениНачислено_Накоп] 
															,[ПениОплачено] ,[ПениОплачено_Накоп] 
															,[ОстЗадолжПени]

															,[ГоспошлинаНачислено] ,[ГоспошлинаНачислено_Накоп] 
															,[ГоспошлинаОплачено] ,[ГоспошлинаОплачено_Накоп] 
															,[ОстЗадолжГоспошлина]

															,[ПереплатаНачислено] ,[ПереплатаНачислено_Накоп] 
															,[ПереплатаОплачено] ,[ПереплатаОплачено_Накоп] 
															,[ОстЗадолжПереплата]

															,[ПроцГрейсНачислено] ,[ПроцГрейсНачислено_Накоп] 
															,[ПроцГрейсОплачено] ,[ПроцГрейсОплачено_Накоп] 
															,[ОстЗадолжПроцГрейс]

															,[ПениГрейсНачислено] ,[ПениГрейсНачислено_Накоп] 
															,[ПениГрейсОплачено] ,[ПениГрейсОплачено_Накоп] 
															,[ОстЗадолжПениГрейс]

															,[КолвоПолнДнПросрочки]
															,[Бакет_cmr] ,[ДатаВозникновенияПросрочки]
															
															,[ТекСатус] ,[СтатусПоДням]
															,[Активен_cmr] ,[Обслуживается_cmr] 
														)
select distinct * from cmr_res --order by 
--where [Договор] is null

drop table [dwh_new].[dbo].[mt_credit_portfolio_cmr_v32];

select [ДатаУчета] as [Дата] ,[ДоговорНомер] as [Номер договора]  ,[КолвоПолнДнПросрочки] as [дней просрочки ЦМР] ,[Бакет_cmr]
		,[ОстЗадолжОД] as [остаток од] ,[ОстЗадолжПроц] as [остаток %] ,[ОстЗадолжПени] as [остаток пени] 
		,([ОстЗадолжГоспошлина]+[ОстЗадолжПроцГрейс]+[ОстЗадолжПениГрейс]) as [остаток иное (комиссии, пошлины и тд)]
		,([ОстЗадолжОД]+[ОстЗадолжПроц]+[ОстЗадолжПени]+[ОстЗадолжГоспошлина]+[ОстЗадолжПроцГрейс]+[ОстЗадолжПениГрейс]) as [остаток всего]
		,([ОДОплачено]+[ПроцОплачено]+[ПениОплачено]+[ГоспошлинаОплачено]+[ПроцГрейсОплачено]+[ОстЗадолжПениГрейс]) as [сумма поступлений]
		,[ТекСатус] ,[СтатусПоДням]

into [dwh_new].[dbo].[mt_credit_portfolio_cmr_v32]  from [dwh_new].[dbo].[mt_credit_portfolio_cmr_v2] 

END

