
-- =============================================
-- Author:		Курдин С.В.
-- Create date: 2020-01-30
-- Description:	Создание основной таблицы для отчета для Верификации из ФЕДОРА
-- exec [etl].[base_etl_report_verification_fedor]
-- =============================================

create PROCEDURE [etl].[cmr_create_dm_action_on_loans2]
	-- Add the parameters for the stored procedure here

AS
BEGIN  --auxtab_RequestMFO_1c

	SET NOCOUNT ON;


declare @GetDate2000 datetime,
		@StartDate date

set @GetDate2000=dateadd(year,2000,getdate());
set @StartDate	= cast(dateadd(month,-2,dateadd(month,datediff(month,0,Getdate()),0)) as date);
    -- Insert statements for procedure here
--select cast(dateadd(month,-1,dateadd(year ,2000 ,dateadd(day,-15,@StartDate))) as date)


drop table if exists #t1
select [Период]
      ,[Регистратор_ТипСсылки]
      ,[Регистратор_Ссылка]
      ,[НомерСтроки]
      ,[Активность]
      ,[ВидДвижения]
      ,[Договор]
      ,[Акция]
      ,[Удалить_ДатаНачала]
      ,[Удалить_ДатаОкончания]
      ,[Активна]
into #t1
from Stg.[_1cCMR].[РегистрНакопления_АктивныеАкции]


drop table if exists #t2
select [Ссылка]
      ,[ВерсияДанных]
      ,[ПометкаУдаления]
      ,[ИмяПредопределенныхДанных]
      ,[Код]
      ,[Наименование]
      ,[ВидАкции]
      ,[ХозяйственнаяОперация]
      ,[Комментарий]
      ,[ОбластьДанныхОсновныеДанные]
into #t2
from Stg.[_1cCMR].[Справочник_Акции]


drop table if exists #t3 
select 
		t1.[Период] [Акция_Период]
		,t1.[Регистратор_Ссылка] [Акция_Регистратор_Ссылка]
		,t1.[Активность]
		,t1.[ВидДвижения]		
		,t1.[Договор] [Акция_Договор] 
		,t1.[Акция]
		,t2.[Наименование] [Наименование_Акции]
		,t2.[ВидАкции]
		,t2.[ХозяйственнаяОперация]
		,t2.[Комментарий]

into #t3
from #t1 t1 
left join #t2 t2 on t2.[Ссылка] = t1.[Акция]

-- select * from #t3

drop table if exists #t4 
select --r.*
		r.[Период]
		,r.[Регистратор_Ссылка]
		,r.[Активность]
		,r.[ВидДвижения]
		,case when r.[ВидДвижения] = 0 then 'Приход' when r.[ВидДвижения] = 1 then 'Расход' end as [Приход_Расход]
		,r.[Договор]
		,r.[ПериодПоГрафику]
		,r.[ОДНачисленоУплачено]
		,r.[ОДПоГрафику]
		,r.[ПроцентыНачисленоУплачено]
		,r.[ПроцентыПоГрафику]
		,r.[ПениНачисленоУплачено]
		,r.[ГосПошлина]
		,r.[Переплата]
		,r.[БухПроцентыНачислено]
		,r.[ДниПросрочки]
		,r.[ПроцентыГрейсПериода]
		,r.[ПениГрейсПериода]
		,r.[ОтложенныеПроценты]
		,r.[ХозяйственнаяОперация]
		--,h.*
		,a.[Акция_Период]
		,a.[Акция_Регистратор_Ссылка]
		--,a.[Активность]
		,a.[ВидДвижения] [ВидДвижения_Акция]		
		--,a.[Договор] [Акция_Договор] 
		,a.[Акция]
		,a.[Наименование_Акции]
		,a.[ВидАкции]
		--,a.[ХозяйственнаяОперация]
		,a.[Комментарий]

--into #t4
from Stg.[_1cCMR].[РегистрНакопления_РасчетыПоЗаймам] r with (nolock)
--left join [Stg].[_1cCMR].[Справочник_ТипыХозяйственныхОпераций] h on h.[Ссылка]=r.[ХозяйственнаяОперация]
left join #t3 a on a.[ХозяйственнаяОперация] = r.[ХозяйственнаяОперация] and a.[Акция_Договор] = r.[Договор] and a.[Акция_Период] = r.[Период]
where r.[Регистратор_Ссылка] in (select distinct [Регистратор_Ссылка] from #t1) and r.[Договор] in (select distinct [Договор] from #t1)
		 



drop table if exists #t5 
select --* 
		dateadd(year ,-2000 ,cast([Период] as datetime2)) [Период]
		,[Договор]
		,[Регистратор_Ссылка]
		,[Активность]
		,[ВидДвижения]
		,[Приход_Расход]

		,dateadd(year ,-2000 ,cast([ПериодПоГрафику] as datetime2)) [ПериодПоГрафику]
		,[ОДНачисленоУплачено]
		,[ОДПоГрафику]
		,[ПроцентыНачисленоУплачено]
		,[ПроцентыПоГрафику]
		,[ПениНачисленоУплачено]
		,[ГосПошлина]
		,[Переплата]
		,[БухПроцентыНачислено]

		,[ПроцентыГрейсПериода]
		,[ПениГрейсПериода]
		,[ОтложенныеПроценты]
		,[ХозяйственнаяОперация]
		,[Акция_Период]
		,[Акция_Регистратор_Ссылка]
		,[ВидДвижения_Акция]		
		,[Акция]
		,[Наименование_Акции]
		,[ВидАкции]		
		,[Комментарий]
into #t5
from #t4 where not [Акция_Регистратор_Ссылка] is null



	delete 
	--select *
	from [Reports].[dbo].[dm_action_on_loans_cmr]
	 --where [accdate]>= @StartDate --  [begindate] >= @StartDate

	insert into [Reports].[dbo].[dm_action_on_loans_cmr] (
														 [Период]
														,[Договор]
														,[Регистратор_Ссылка]
														,[Активность]
														,[ВидДвижения]
														,[Приход_Расход]

														,[ПериодПоГрафику]
														,[ОДНачисленоУплачено]
														,[ОДПоГрафику]
														,[ПроцентыНачисленоУплачено]
														,[ПроцентыПоГрафику]
														,[ПениНачисленоУплачено]
														,[ГосПошлина]
														,[Переплата]
														,[БухПроцентыНачислено]

														,[ПроцентыГрейсПериода]
														,[ПениГрейсПериода]
														,[ОтложенныеПроценты]
														,[ХозяйственнаяОперация]
														,[Акция_Период]
														,[Акция_Регистратор_Ссылка]
														,[ВидДвижения_Акция]		
														,[Акция]
														,[Наименование_Акции]
														,[ВидАкции]		
														,[Комментарий]
														)

	select *
--	into [Reports].[dbo].[dm_action_on_loans_cmr]   
	from #t5
	--where [Период]>= @StartDate

--drop table [Reports].[dbo].[dm_action_on_loans_cmr]

END

