-- Usage: запуск процедуры с параметрами
-- EXEC files.[план @param1 = <value>, @param2 = <value>;
-- Список и типы параметров смотрите в объявлении процедуры ниже.
CREATE PROCEDURE files.[план по каналам] as begin 
 begin tran 
  truncate table files.[план по каналам_buffer] 
 insert into   files.[план по каналам_buffer] (
 [Месяц] ,
 [Группа каналов] ,
 [Канал от источника] ,
 [Продукт] ,
 [Вид займа] ,
 [Заявок] ,
 [Заем выдан] ,
 [Выданная сумма] ,
 [Тип продукта] ,
 [created] ) 
 select 
 [Месяц] ,
 [Группа каналов] ,
 [Канал от источника] ,
 [Продукт] ,
 [Вид займа] ,
 [Заявок] ,
 [Заем выдан] ,
 [Выданная сумма] ,
 [Тип продукта] ,
 [created]  from files.[план по каналам_stg] 
 commit tran  
 end 