
create        proc [dbo].[sale_plan_creation4]  	@mode nvarchar(max) = ''
, @date_to date = null
, @date_from date = null
as 


	 
declare @date_to_sales date  
declare @date_from_sales date


if @mode = 'main'
begin

drop table if exists #basis
 
select [Группа каналов]+' '+[Канал от источника]+ ' '+ Продукт+' '+[Вид займа] +' '+RBP Сегмент,* into #basis from (

select  'CPA'      [Группа каналов],  'CPA нецелевой'  [Канал от источника],  'Основной продукт' Продукт,  'Новые' [Вид займа] , '' [RBP] , 1 order_by union all
select  'CPA'      [Группа каналов],  'CPA полуцелевой'  [Канал от источника],  'Основной продукт' Продукт,  'Новые' [Вид займа] , '' [RBP] , 2 order_by union all
select  'CPA'      [Группа каналов],  'CPA целевой'  [Канал от источника],  'Основной продукт' Продукт,  'Новые' [Вид займа] , '' [RBP] , 3 order_by union all
select  'CPC'      [Группа каналов],  'CPC'  [Канал от источника],  'Основной продукт' Продукт,  'Новые' [Вид займа] , '' [RBP] , 4 order_by union all
select  'Партнеры' [Группа каналов],  'Партнеры'  [Канал от источника],  'Основной продукт' Продукт,  'Новые' [Вид займа] , '' [RBP] , 5 order_by union all
select  'Органика' [Группа каналов],  'Органика новые'  [Канал от источника],  'Основной продукт' Продукт,  'Новые' [Вид займа] , '' [RBP] , 6 order_by union all
select  'Органика' [Группа каналов],  'Органика повторные'  [Канал от источника],  'Основной продукт' Продукт,  'Новые' [Вид займа] , '' [RBP] , 7 order_by union all
select  'Органика' [Группа каналов],  'Органика докреды'  [Канал от источника],  'Основной продукт' Продукт,  'Новые' [Вид займа] , '' [RBP] , 8 order_by union all
select  'Триггеры' [Группа каналов],  'Триггеры'  [Канал от источника],  'Основной продукт' Продукт,  'Новые' [Вид займа] , '' [RBP] , 9 order_by union all

select  'CPA'      [Группа каналов],  'CPA нецелевой'  [Канал от источника],  'Основной продукт' Продукт,  'Повторные' [Вид займа] , '' [RBP] , 28 order_by union all
select  'CPA'      [Группа каналов],  'CPA полуцелевой'  [Канал от источника],  'Основной продукт' Продукт,  'Повторные' [Вид займа] , '' [RBP] , 29 order_by union all
select  'CPA'      [Группа каналов],  'CPA целевой'  [Канал от источника],  'Основной продукт' Продукт,  'Повторные' [Вид займа] , '' [RBP] , 30 order_by union all
select  'CPC'      [Группа каналов],  'CPC'  [Канал от источника],  'Основной продукт' Продукт,  'Повторные' [Вид займа] , '' [RBP] , 31 order_by union all
select  'Партнеры' [Группа каналов],  'Партнеры'  [Канал от источника],  'Основной продукт' Продукт,  'Повторные' [Вид займа] , '' [RBP] , 32 order_by union all
select  'Органика' [Группа каналов],  'Органика новые'  [Канал от источника],  'Основной продукт' Продукт,  'Повторные' [Вид займа] , '' [RBP] , 33 order_by union all
select  'Органика' [Группа каналов],  'Органика повторные'  [Канал от источника],  'Основной продукт' Продукт,  'Повторные' [Вид займа] , '' [RBP] , 34 order_by union all
select  'Органика' [Группа каналов],  'Органика докреды'  [Канал от источника],  'Основной продукт' Продукт,  'Повторные' [Вид займа] , '' [RBP] , 35 order_by union all
select  'Триггеры' [Группа каналов],  'Триггеры'  [Канал от источника],  'Основной продукт' Продукт,  'Повторные' [Вид займа] , '' [RBP] , 36 order_by union all

select  'CPA'      [Группа каналов],  'CPA нецелевой'  [Канал от источника],  'Основной продукт' Продукт,  'Докреды' [Вид займа] , '' [RBP] , 37 order_by union all
select  'CPA'      [Группа каналов],  'CPA полуцелевой'  [Канал от источника],  'Основной продукт' Продукт,  'Докреды' [Вид займа] , '' [RBP] , 38 order_by union all
select  'CPA'      [Группа каналов],  'CPA целевой'  [Канал от источника],  'Основной продукт' Продукт,  'Докреды' [Вид займа] , '' [RBP] , 39 order_by union all
select  'CPC'      [Группа каналов],  'CPC'  [Канал от источника],  'Основной продукт' Продукт,  'Докреды' [Вид займа] , '' [RBP] , 40 order_by union all
select  'Партнеры' [Группа каналов],  'Партнеры'  [Канал от источника],  'Основной продукт' Продукт,  'Докреды' [Вид займа] , '' [RBP] , 41 order_by union all
select  'Органика' [Группа каналов],  'Органика новые'  [Канал от источника],  'Основной продукт' Продукт,  'Докреды' [Вид займа] , '' [RBP] , 42 order_by union all
select  'Органика' [Группа каналов],  'Органика повторные'  [Канал от источника],  'Основной продукт' Продукт,  'Докреды' [Вид займа] , '' [RBP] , 43 order_by union all
select  'Органика' [Группа каналов],  'Органика докреды'  [Канал от источника],  'Основной продукт' Продукт,  'Докреды' [Вид займа] , '' [RBP] , 44 order_by union all
select  'Триггеры' [Группа каналов],  'Триггеры'  [Канал от источника],  'Основной продукт' Продукт,  'Докреды' [Вид займа] , '' [RBP] , 45 order_by union all

select  'Банки'    [Группа каналов],  'ПСБ'  [Канал от источника],  'PSB'    Продукт,  'Новые' [Вид займа] , ''                [RBP] , 82 order_by union all
select  'Банки'      [Группа каналов],  'Инфосети'  [Канал от источника],  'GPB'    Продукт,  'Новые' [Вид займа] , ''                [RBP] , 91 order_by union all
select  'Банки'    [Группа каналов],  'Т-Банк'  [Канал от источника],  'T-Bank'    Продукт,  'Новые' [Вид займа] , ''                [RBP] , 100 order_by  union all
select  'Банки'    [Группа каналов],  'ВТБ Автокред'  [Канал от источника],  'Автокред'    Продукт,  'Новые' [Вид займа] , ''                [RBP] , 101 order_by  union all
select  'Банки'    [Группа каналов],  'Т-Банк Автокред'  [Канал от источника],  'Автокред'    Продукт,  'Новые' [Вид займа] , ''                [RBP] , 102 order_by  --union all


--union all
--union all

)
x



--select * from #basis


drop table if exists #v_fa

select 
a.[Верификация КЦ месяц] [Дата заявки месяц],
a.[Верификация КЦ день] [Дата заявки день],
a.[Заем выдан день] [Заем выдан день],
a.[Заем выдан месяц] [Заем выдан месяц],
a.[Группа каналов для планирования] +' '+[Канал от источника для планирования2] +case when a.productType = 'AUTOCREDIT' then ' Автокред'  else'' end
+  ' '+ case when a.productType = 'AUTOCREDIT' then 'Автокред' else  'Основной продукт' end 

+' '+[Вид займа для планирования]+ ' ' [Сегмент для планирования],
a.[Группа каналов для планирования] [Группа каналов],
a.[Канал от источника для планирования2] [Канал от источника],
'' [Продукт],
a.[Вид займа для планирования] [Вид займа],
'' [RBP],
a.[Сумма заявки],
a.[Признак заявки],
a.[Признак Предварительное одобрение],
a.[Признак Контроль данных],
a.[Признак Call2],
a.[Признак Call2 accept],
a.[Признак не застрял после Call2 accept],
a.[Признак Одобрено],
a.[признак Заем выдан cmr] [признак Заем выдан],
a.[Ставка умножить на сумму],
isnull(a.[Выданная сумма cmr]    , 0) [Выданная сумма],
a.SumKasko,
a.SumEnsur,
a.SumQuietLife,
a.[Сумма страховок],
a.[Сумма КП],
a.ПризнакРАТ РАТ,
a.ПризнакТелемедицина Телемедицина,
a.ПризнакПомощьБизнесу [Помощь Бизнесу],
a.[Признак Защита от потери работы] [Защита от потери работы],
a.ПризнакФарма Фарма ,
b.source ,
a.Номер,
b.needBki,
b.productType


into #v_fa 
from Analytics.dbo.v_dm_Factor_Analysis a
left join _request b with(nolock) on a.номер = b.number

where a.Дубль=0 and a.productType in ('PTS', 'AUTOCREDIT') --and   [Верификация КЦ]<='20231130'
and (case when  b.parentGuid is not null and  b.issued is null then 1 else 0 end) <>1
and a.[Верификация КЦ] >=getdate()-200


--select * from #v_fa
--where source like 'info%'
--order by 1 desc


--update #v_fa set  [Сегмент для планирования] = replace([Сегмент для планирования],'Основной продукт', 'Автокред')  where  productType='autocredit'

update #v_fa set [Канал от источника]='Инфосети', [Группа каналов] = 'Банки', [Сегмент для планирования] = replace([Сегмент для планирования], 'CPA', 'Банки')  where  source like 'infoseti%'
update #v_fa set [Канал от источника]='ПСБ', [Группа каналов] = 'Банки'  where  source like 'psb%'
update #v_fa set [Канал от источника]='Т-Банк', [Группа каналов] = 'Банки'  where  source like 'tpokup%'
 
 update #v_fa set [Сегмент для планирования] = replace([Сегмент для планирования], 'Основной продукт', 'GPB')  where  source like 'infoseti%'
update #v_fa set [Сегмент для планирования] =   replace([Сегмент для планирования], 'Основной продукт', 'PSB') where  source like 'psb%'
update #v_fa set  [Сегмент для планирования] =  replace([Сегмент для планирования], 'Основной продукт', 'T-Bank')   where  source like 'tpokup%'
 

--update #v_fa set 
--[Сегмент для планирования] = replace(replace([Сегмент для планирования] , 'Ставка 40-50' , 'Основной продукт')   , 'RBP - 40' , 'others') ,
--Продукт = replace(Продукт , 'Ставка 40-50' , 'Основной продукт') ,
--rBP  = replace(rBP , 'RBP - 40' , 'others') 
-- where [Вид займа]='Новые' and продукт = 'Ставка 40-50' and needBki =1 and  isnull([Заем выдан день] ,  [Дата заявки день])>='20250701'


 
--update #v_fa set 
--[Сегмент для планирования] = replace(replace([Сегмент для планирования]  , 'Основной продукт' , 'Ставка 40-50') , 'others' , 'RBP - 40' ) ,
--Продукт = replace(Продукт , 'Основной продукт' , 'Ставка 40-50' ) ,
--rBP  = replace(rBP  , 'others' , 'RBP - 40' ) 
--where [Вид займа]='Новые' and продукт = 'Основной продукт' and needBki =0 and  isnull([Заем выдан день] ,  [Дата заявки день])>='20250701'

--select [Сегмент для планирования], min(Номер), count(*) cnt from #v_fa

--where [Вид займа]='Новые'
--group by [Сегмент для планирования]
--order by 2 desc
--order by номер desc

 --select top 1000 * from #v_fa
 --where [Вид займа]='Новые'

--select * from #v_fa
--where [Дата заявки месяц]='20231101'
--order by [Сумма заявки]


--update #v_fa1
--set 
--[Сегмент для планирования] = replace( replace([Сегмент для планирования], 'Ставка 40-50', 'Основной продукт'), 'RBP - 40', 'others'),
--RBP = replace( replace(RBP, 'Ставка 40-50', 'Основной продукт'), 'RBP - 40', 'others'),
--Продукт = replace( replace(Продукт, 'Ставка 40-50', 'Основной продукт'), 'RBP - 40', 'others')
--where [Дата заявки день]>='20210201'

--select * from #v_fa1

--select distinct [Сегмент для планирования] from #v_fa
--where [Дата заявки день] between '2022' and '20211224'
--
--except
--select Сегмент from #basis

--select Сегмент from #basis
--except

--select distinct [Сегмент для планирования] from #v_fa
--where [Дата заявки день] between '20211112' and '20211224'
--

--select * from #v_fa
--where [Сегмент для планирования]='Тест Тест Основной продукт Новые others'

set @date_to_sales   =  @date_to	 --Проверить год
set @date_from_sales   = cast(format( @date_to_sales  , 'yyyy-MM-01') as date) 	


if @date_from  is not null 
set @date_from_sales   = @date_from

--select * from #v_fa where cast([Выданная сумма] as bigint)=185667

declare @date_from_cp date =  @date_from_sales
declare @date_to_cp date   =  @date_to_sales

select * from #basis a
outer apply (

select 
sum([Признак заявки]) Заявок,
sum([Признак Предварительное одобрение]) [Предварительно одобрено],
sum([Признак Контроль данных]) [КД],
sum([Признак Call2]) [Поступило на Call2],
sum([Признак Call2 accept]) [Признак Call2 accept],
sum([Признак не застрял после Call2 accept]) [Признак не застрял после Call2 accept],
sum([Признак Одобрено]) [Одобрено],
sum([Признак Заем выдан]) [Заем выдан],
sum([Выданная сумма]) [Выданная сумма],
sum([Ставка умножить на сумму])             /nullif(cast(sum([Выданная сумма])                        as float), 0)/100.0 [Ставка],
sum([Признак Предварительное одобрение])    /nullif(cast(sum([Признак заявки])                        as float), 0) [%ПО],
sum([Признак Контроль данных])              /nullif(cast(sum([Признак Предварительное одобрение])     as float), 0) [%Доезд],
sum([Признак Call2])                        /nullif(cast(sum([Признак Контроль данных])               as float), 0) [%Поступило на КД],
sum([Признак Call2 accept])                 /nullif(cast(sum([Признак Call2])                         as float), 0) [%Call2 accept],
sum([Признак не застрял после Call2 accept])/nullif(cast(sum([Признак Call2 accept])                  as float), 0) [%не застряло после Call2],
sum([Признак Одобрено])                     /nullif(cast(sum([Признак не застрял после Call2 accept]) as float), 0) [%AR],
sum([Признак Заем выдан])                   /nullif(cast(sum([Признак Одобрено])                      as float), 0) [%TU],
sum([Выданная сумма])                       /nullif(cast(sum([Признак Заем выдан])                    as float), 0) [Средний чек],
sum([Признак Заем выдан])                   /nullif(cast(sum([Признак заявки])                        as float), 0) [Заявка - займ],
sum([Ставка умножить на сумму]) [Ставка умножить на сумму]


from #v_fa  b where a.Сегмент=b.[Сегмент для планирования] 
and  isnull([Заем выдан день] ,  [Дата заявки день]) between @date_from_sales and @date_to_sales
--and case when [Вид займа]='Докреды'  then 0
--	when  [Вид займа]<>'Докреды' and ( [Сумма заявки]<80000 or nullif( [Выданная сумма] ,0) <80000) then 1
--	else 0
--end <>1

) sales 
outer apply (

select 
[Выданная сумма КП]             = sum([Выданная сумма]) ,
[Заем выдан КП]                 = sum([Признак Заем выдан]) ,
[Выданная сумма Ensur]          = sum(case when SumEnsur>0 then [Выданная сумма] end) ,
[Выданная сумма Kasko]          = sum(case when SumKasko>0 then [Выданная сумма] end) ,
[Выданная сумма QuietLife]      = sum(case when SumQuietLife>0 then [Выданная сумма] end) ,
РАТ                             = sum(РАТ) ,
Телемедицина                    = sum(Телемедицина) ,
[Помощь Бизнесу]                = sum([Помощь Бизнесу]) ,
[Защита от потери работы]       = sum([Защита от потери работы]) ,
Фарма                           = sum(Фарма) ,
[% Выданная сумма Ensur]        = sum(case when SumEnsur>0 then [Выданная сумма] end)                 / nullif(cast(sum([Выданная сумма])     as float) , 0) ,
[% Выданная сумма Kasko]        = sum(case when SumKasko>0 then [Выданная сумма] end)                 / nullif(cast(sum([Выданная сумма])     as float) , 0) ,
[% Выданная сумма QuietLife]    = sum(case when SumQuietLife>0 then [Выданная сумма] end)             / nullif(cast(sum([Выданная сумма])     as float) , 0) ,
[% РАТ]                         = sum(РАТ)                                                            / nullif(cast(sum([Признак Заем выдан]) as float) , 0) ,
[% Телемедицина]                = sum(Телемедицина)                                                   / nullif(cast(sum([Признак Заем выдан]) as float) , 0) ,
[% ПомощьБизнесу]               = sum([Помощь Бизнесу])                                               / nullif(cast(sum([Признак Заем выдан]) as float) , 0) ,
[% Защита от потери работы]     = sum([Защита от потери работы])                                      / nullif(cast(sum([Признак Заем выдан]) as float) , 0) ,
[% Фарма ]                      = sum(Фарма)                                                          / nullif(cast(sum([Признак Заем выдан]) as float) , 0) ,
[% Выданная сумма страховки]    =  isnull(sum(case when SumEnsur>0 then [Выданная сумма] end)         / nullif(cast(sum([Выданная сумма])     as float) , 0) , 0) +
                                   isnull(sum(case when SumKasko>0 then [Выданная сумма] end)         / nullif(cast(sum([Выданная сумма])     as float) , 0) , 0) +
                                   isnull(sum(case when SumQuietLife>0 then [Выданная сумма] end)     / nullif(cast(sum([Выданная сумма])     as float) , 0) , 0) ,
[Выданная сумма со страховкой]  =  isnull(sum(case when SumEnsur>0 then [Выданная сумма] end)  , 0)     +
								   isnull( sum(case when SumKasko>0 then [Выданная сумма] end)  , 0)     +
								   isnull(sum(case when SumQuietLife>0 then [Выданная сумма] end)  , 0),
[Коробочные продукты шт.]       = null  --isnull(
									--	isnull(sum(РАТ)  , 0)     +
									--	isnull(sum(Телемедицина)  , 0)     +
									--	isnull(sum([Помощь Бизнесу])  , 0)     +
									--	isnull(sum([Защита от потери работы])  , 0)     +
									--	isnull(sum(Фарма)  , 0)     
									--	, 0)
									,
[Сумма доп услуг gross]         = null,								 
[Сумма доп услуг net]           = null							 



from #v_fa  b where a.Сегмент=b.[Сегмент для планирования] 
and [Заем выдан день] between @date_from_cp and @date_to_cp

) cp
order by order_by


end
if @mode = 'stat'
begin


drop table if exists #v_fa1

select 
a.[Верификация КЦ месяц] [Дата заявки месяц],
a.[Верификация КЦ день] [Дата заявки день],
a.[Заем выдан день] [Заем выдан день],
a.[Заем выдан месяц] [Заем выдан месяц],
a.[Сегмент для планирования месяца2] [Сегмент для планирования],
a.[Группа каналов для планирования] [Группа каналов] ,
a.[Канал от источника для планирования2] [Канал от источника],
a.[Продукт для планирования] [Продукт],
a.[Вид займа для планирования] [Вид займа],
a.[RBP для планирования месяца] [RBP],
a.[Сумма заявки],
a.[Признак заявки],
a.[Признак Предварительное одобрение],
a.[Признак Контроль данных],
a.[Признак Call2],
a.[Признак Call2 accept],
a.[Признак не застрял после Call2 accept],
a.[Признак Одобрено],
a.[признак Заем выдан cmr] [признак Заем выдан],
a.[Ставка умножить на сумму],
isnull(a.[Выданная сумма cmr]    , 0) [Выданная сумма],
a. SumKasko,
a. SumEnsur,
a. SumQuietLife,
a. [Сумма страховок],
a. [Сумма КП],
a.ПризнакРАТ РАТ,
a.ПризнакТелемедицина Телемедицина,
a.ПризнакПомощьБизнесу [Помощь Бизнесу],
a.[Признак Защита от потери работы] [Защита от потери работы],
a.ПризнакФарма Фарма,
 b.sourcE, B.needBki


into #v_fa1 
from Analytics.dbo.v_dm_factor_Analysis a
left join _request b on a.номер = b.number
where Дубль=0 and a.ispts=1	--and   [Верификация КЦ]<='20231130'
and (case when  b.parentGuid is not null and  b.issued is null then 1 else 0 end) <>1


update #v_fa1 set [Канал от источника]='Инфосети'  where  source like 'infoseti%'
 


update #v_fa1 set 
[Сегмент для планирования] = replace(replace([Сегмент для планирования] , 'Ставка 40-50' , 'Основной продукт')   , 'RBP - 40' , 'others') ,
Продукт = replace(Продукт , 'Ставка 40-50' , 'Основной продукт') ,
rBP  = replace(rBP , 'RBP - 40' , 'others') 
 where [Вид займа]='Новые' and продукт = 'Ставка 40-50' and needBki =1 and  isnull([Заем выдан день] ,  [Дата заявки день])>='20250701'


 
update #v_fa1 set 
[Сегмент для планирования] = replace(replace([Сегмент для планирования]  , 'Основной продукт' , 'Ставка 40-50') , 'others' , 'RBP - 40' ) ,
Продукт = replace(Продукт , 'Основной продукт' , 'Ставка 40-50' ) ,
rBP  = replace(rBP  , 'others' , 'RBP - 40' ) 
where [Вид займа]='Новые' and продукт = 'Основной продукт' and needBki =0 and  isnull([Заем выдан день] ,  [Дата заявки день])>='20250701'



select isnull([Заем выдан месяц] ,  [Дата заявки месяц]) [Отчетная дата месяц]
,   [Сегмент для планирования]	  [Сегмент для планирования]
,   [Группа каналов]
,   [Канал от источника] [Канал от источника]
,   Продукт
,   [Вид займа]
,   RBP
,
sum([Признак заявки]) Заявок,
sum([Признак Предварительное одобрение]) [Предварительно одобрено],
sum([Признак Контроль данных]) [КД],
sum([Признак Call2]) [Поступило на Call2],
sum([Признак Call2 accept]) [Признак Call2 accept],
sum([Признак не застрял после Call2 accept]) [Признак не застрял после Call2 accept],
sum([Признак Одобрено]) [Одобрено],
sum([Признак Заем выдан]) [Заем выдан],
sum([Выданная сумма]) [Выданная сумма],
sum([Ставка умножить на сумму]) [Ставка умножить на сумму]
, isnull([Заем выдан день] ,  [Дата заявки день]) [Отчетная дата день] 

from #v_fa1
where  [Дата заявки месяц]>='20210101'
--and isinstallment=1
group by
isnull([Заем выдан месяц] ,  [Дата заявки месяц])
, isnull([Заем выдан день] ,  [Дата заявки день])
, [Сегмент для планирования]
, [Группа каналов]
,  [Канал от источника]
,   Продукт
,   [Вид займа]
,   RBP

end

  if @mode = 'stat_organic'


  
set @date_to_sales   =  @date_to	 --Проверить год
set @date_from_sales   = cast(format( @date_to_sales  , 'yyyy-MM-01') as date) 	


if @date_from  is not null 
set @date_from_sales   = @date_from

select [Канал от источника], sum([Выданная сумма]) from mv_dm_Factor_Analysis
where  [Заем выдан день] between @date_from_sales and @date_to_sales and [Группа каналов]='органика'
AND ispts=1
group by [Канал от источника]
order by [Канал от источника]

 