
CREATE   proc [dbo].[sale_partner_request_report] @mode nvarchar(max) = 'request'
as

if @mode = 'request'
begin

declare @today_d date = cast(getdate() as date);


drop table if exists #fa1

--select
--       Номер
--	  ,[ПризнакКП]
--      ,[ПризнакСтрахованиеЖизни]
--      ,[ПризнакКаско]
--      ,[ПризнакРАТ]
--      ,[ПризнакПомощьБизнесу]
--	  ,[ПризнакТелемедицина]
--      ,[Признак Защита от потери работы]
--	  ,[СуммаДопУслуг]
--	  ,[СуммаДопУслугCarmoneyNet]
--	  ,[ПризнакСтраховка]
--	  ,[SumQuietLife]
--	  ,[SumEnsur] 
--	  ,[SumKasko]
--	  ,[SumRat]
--	  ,[SumCushion]
--	  ,[SumHelpBusiness]
--      ,[SumTeleMedic]
--      ,[Группа риска]
--	  ,offer_details
--	  ,ИспытательныйСрок
--	  ,ПроцСтавкаКредит
--into #fa1
--from dm_Factor_Analysis (nolock)
--where [Группа каналов]='Партнеры'


drop table if exists #fa0

select
       Номер
	  ,[Текущий статус]
	  ,[ДатаЗаявкиПолная]
	  ,[Место создания] [Место cоздания]
      ,[Автор]
      ,[РП]  
	  ,РО_Регион
	  ,case when [Партнер] = 'Личный кабинет клиента' then source else [Партнер] end [Партнер]
	  ,[Номер партнера]  
	  ,case when [Юрлицо] = 'Личный кабинет клиента' then source else [Юрлицо] end [Юрлицо]
 
      ,[Регион проживания]
      ,[Вид займа]
      ,[Продукт]
      ,[Срок займа]
      ,[Первичная сумма]
      ,[Сумма одобренная]
	  ,[Заем выдан] 
	  ,[Выданная сумма]
	  ,[Сумма заявки]
      ,[Способ выдачи]
      ,[LCRM ID]
      ,[Верификация КЦ]
      ,[Предварительное одобрение]
      ,[Встреча назначена]
      ,[Контроль данных]
      ,[Верификация документов клиента]
      ,[Одобрены документы клиента]
      ,[Верификация документов]
      ,[Одобрено]
      ,[Договор зарегистрирован]
      ,[Договор подписан] 
	  ,[Заем погашен]
      ,[Заем аннулирован]
      ,[Аннулировано]
      ,[Отказ документов клиента]
      ,[Отказано]
      ,[Отказ клиента]
      ,[Забраковано]
      ,[ПризнакЗаявка]
      ,[ПризнакПредварительноеОдобрение]
      ,[ПризнакВстречаНазначена]
      ,[ПризнакКонтрольДанных]
      ,[ПризнакКонтрольДанныхИзФактическихВстреч]
      ,[ПризнакВерификацияДокументовКлиента]
      ,[ПризнакОдобреныДокументовКлиента]
      ,[ПризнакВерификацияДокументов]
      ,[ПризнакОдобрено]
      ,[ПризнакДоговорЗарегистрирован]
      ,[ПризнакДоговорПодписан]
      ,[ПризнакЗайм]
      ,[ПризнакОтказано]
	  ,[Признак Отказ документов клиента]
      ,[ПризнакОтказКлиента]
	  ,[ПризнакЗабраковано]
      ,[ЛагЗаявкаЗаймДней]
      ,[ЛагКрупноЗаявкаЗайм]
      ,[ПризнакЗаймДеньВДень]
      ,[ПризнакЗаймНеДеньВДень]
      ,[ЛагВстречаКонтрольДанныхВДнях]
      ,[ЛагВстречаКонтрольДанныхДеньВДеньДней]
      ,[ЛагВстречаКонтрольДанныхНеДеньВДеньДней]
      ,[НеПрошлиКД]
      ,[КДраньшеВстречиИЛИБезВстречи]
      ,[КДБезНазначеннойВстречи]
      ,[ЛагОдобреноЗаймДней]
      ,[ЛагОдобреноЗайм_День_в_день]
      ,[ЛагОдобреноЗайм_Не_День_в_день]
      ,[ДИАПАЗОН_КД_ЗаймДней]
      ,[ОдобреноОтКД_со_встр]
      ,[ОдобреноОтКД_без_встр]
      ,[ОдобреноНоЗаймНеВыдан]
      ,[ЗаймОтОдобр_вст]
      ,[ЗаймОтОдобр_без_вст]
      ,[ВремяОтВстречаНазначенаДоКДМинут]
      ,[Диапазон5]
      ,[ВремяОтВерификацияКЦДоВыдачиЧасы]
      ,[НеделяЗаявки]	 
      ,[ГодВыдачи]
      ,[МесяцЗаявки]
	  ,[ГодЗаявки]
      ,[ФИО]
      ,isPts
	  ,[Признак рефинансирование]
	  ,[TTC]
	  ,[Дубль]
	  ,[Группа каналов]
	  ,[Канал от источника]
	  ,[МесяцВыдач]
	  ,[НеделяЗайма]
	  ,[признак комиссионный продукт] [ПризнакКП]
      ,[Признак Страхование Жизни] [ПризнакСтрахованиеЖизни]
      ,[Признак Каско] [ПризнакКаско]
      ,[Признак РАТ] [ПризнакРАТ]
      ,[Признак Помощь Бизнесу] [ПризнакПомощьБизнесу]
	  ,[Признак Телемедицина] [ПризнакТелемедицина]
      ,[Признак Защита от потери работы]
	  ,[Сумма Дополнительных Услуг] [СуммаДопУслуг]
	  ,[Сумма Дополнительных Услуг Carmoney Net] [СуммаДопУслугCarmoneyNet]
	  ,[Признак Страховка] [ПризнакСтраховка]
	  ,[Сумма Спокойная Жизнь] [SumQuietLife]
	  ,[Сумма страхование жизни] [SumEnsur] 
	  ,[Сумма КАСКО] [SumKasko]
	  ,[Сумма РАТ] [SumRat]
	  ,[Сумма Защита от потери работы] [SumCushion]
	  ,[Сумма Помощь бизнесу] [SumHelpBusiness]
      ,[Сумма Телемедицина] [SumTeleMedic]
      ,0.0 [Группа риска]
	  ,'' offer_details
	  ,case when product = 'Исп. срок' then 1 else 0  end ИспытательныйСрок
	  ,[Процентная ставка] ПроцСтавкаКредит
	  , productType + case when source = 'ecredit' then ' Ecredit' else '' end productType
	  , product
into #fa0
from v_fa (nolock)
where Дубль =0
and ДатаЗаявкиПолная between '20240101' and @today_d
and ( [Группа каналов]='Партнеры'
or productType = 'AUTOCREDIT' )
 
--select distinct product from v_fa

drop table if exists #t2
 
SELECT
 f1.*
, [Канал от источника RR] = case when f1.[Группа каналов] = 'Партнеры' and f1.[Номер партнера] in (2336, 2306, 1415) then 'Флагманские офисы' else f1.[Канал от источника] end
into #t2
FROM
(
SELECT *
FROM
(
SELECT
       cast (a0.[ДатаЗаявкиПолная] as date) as 'Дата заявки'
	  --,[Дата]
   --   ,[Время]
      ,a0.[Номер]
      ,[Текущий статус]
	  ,a0.[Место cоздания] as 'Место cоздания'
      ,[Автор]
      ,null [Причина отказа]
      --,iif (ISNULL(b1.[РП],a0.[РП]) like '%Москва%', 'РП Москва',ISNULL(b1.[РП],a0.[РП])) as 'РП'
      ,iif (  a0.[РП]  like '%Москва%', 'РП Москва', a0.[РП]  ) as 'РП'
	,[РО_Регион] =
	
	--iif(ISNULL(b1.[Партнер],a0.[Партнер]) like '%Владивосток%'
	--	or ISNULL(b1.[Партнер],a0.[Партнер]) like '%Хабаровск%'
	--	or ISNULL(b1.[Партнер],a0.[Партнер]) like '%Иркутск%'
	--	or ISNULL(b1.[Партнер],a0.[Партнер]) like '%Чита%'
	--	or ISNULL(b1.[Партнер],a0.[Партнер]) like '%Благовещенск%'
	--	or ISNULL(b1.[Партнер],a0.[Партнер]) like '%Комсомольск-на-Амуре%'
	--	or ISNULL(b1.[Партнер],a0.[Партнер]) like '%Комсомольск на Амуре%'
	--	or ISNULL(b1.[РП],a0.[РП]) like '%РП Владивосток%'
	--	or ISNULL(b1.[РП],a0.[РП]) like '%РП Хабаровск%'
	--	or ISNULL(b1.[РП],a0.[РП]) like '%РП Иркутск%'
	--	or ISNULL(b1.[РП],a0.[РП]) like '%РП Чита%'
	--	or ISNULL(b1.[РП],a0.[РП]) like '%РП Благовещенск%'
	--	or ISNULL(b1.[РП],a0.[РП]) like '%РП Комсомольск-на-Амуре%'
	--	or ISNULL(b1.[РП],a0.[РП]) like '%РП Комсомольск на Амуре%'
	--	,'РО Дальневосточный регион'
	--	,
		--ISNULL(b1.[РО_Регион],a0.РО_Регион)
		isnull( ( a0.РО_Регион), '')
		--)  
	  --,[Регион]
      --,ISNULL(b1.[Партнер],a0.[Партнер]) as 'Партнер'
      ,isnull( a0.[Партнер] , '') as 'Партнер'
	  --,ISNULL(b1.[Номер партнера], a0.[Номер партнера]) as 'Номер партнера'
	  ,  a0.[Номер партнера]  as 'Номер партнера'
	--  ,ISNULL(b1.[Юрлицо], a0.[Юрлицо]) as 'Юрлицо'
	  , isnull(a0.[Юрлицо], '') as 'Юрлицо'
      ,[Регион проживания]
      ,a0.[Вид займа]
      ,[Продукт]
      ,[Срок займа]
      ,a0.[Первичная сумма]
      ,a0.[Сумма одобренная]
	        ,case
			when cast(a0.[Заем выдан] as date) = @today_d then NULL
			else a0.[Выданная сумма]
		end as [Выданная сумма]
      ,a0.[Сумма заявки]
      ,[Способ выдачи]
      ,[LCRM ID]
      ,a0.[Верификация КЦ]
      ,a0.[Предварительное одобрение]
      ,a0.[Встреча назначена]
      ,a0.[Контроль данных]
      ,a0.[Верификация документов клиента]
      ,a0.[Одобрены документы клиента]
      ,a0.[Верификация документов]
      ,a0.[Одобрено]
      ,a0.[Договор зарегистрирован]
      ,IIF(cast(a0.[Договор подписан] as date) = @today_d,NULL,a0.[Договор подписан]) as [Договор подписан]
      ,case
			when cast(a0.[Заем выдан] as date) = @today_d then NULL
			else a0.[Заем выдан]
		end as [Заем выдан]
      ,a0.[Заем погашен]
      ,a0.[Заем аннулирован]
      ,a0.[Аннулировано]
      ,a0.[Отказ документов клиента]
      ,a0.[Отказано]
      ,a0.[Отказ клиента]
      ,a0.[Забраковано]
      ,[ПризнакЗаявка]
      ,[ПризнакПредварительноеОдобрение]
      ,[ПризнакВстречаНазначена]
      ,[ПризнакКонтрольДанных]
      ,[ПризнакКонтрольДанныхИзФактическихВстреч]
      ,[ПризнакВерификацияДокументовКлиента]
      ,[ПризнакОдобреныДокументовКлиента]
      ,[ПризнакВерификацияДокументов]
      ,[ПризнакОдобрено]
      ,[ПризнакДоговорЗарегистрирован]
      ,[ПризнакДоговорПодписан]
      ,[ПризнакЗайм]
      ,[ПризнакОтказано]
	  ,[Признак Отказ документов клиента]
      ,[ПризнакОтказКлиента]
	  ,[ПризнакЗабраковано]
      ,[ЛагЗаявкаЗаймДней]
      ,[ЛагКрупноЗаявкаЗайм]
      ,[ПризнакЗаймДеньВДень]
      ,[ПризнакЗаймНеДеньВДень]
      ,[ЛагВстречаКонтрольДанныхВДнях]
      ,[ЛагВстречаКонтрольДанныхДеньВДеньДней]
      ,[ЛагВстречаКонтрольДанныхНеДеньВДеньДней]
      ,[НеПрошлиКД]
      ,[КДраньшеВстречиИЛИБезВстречи]
      ,[КДБезНазначеннойВстречи]
      ,[ЛагОдобреноЗаймДней]
      ,[ЛагОдобреноЗайм_День_в_день]
      ,[ЛагОдобреноЗайм_Не_День_в_день]
      ,[ДИАПАЗОН_КД_ЗаймДней]
      ,[ОдобреноОтКД_со_встр]
      ,[ОдобреноОтКД_без_встр]
      ,[ОдобреноНоЗаймНеВыдан]
      ,[ЗаймОтОдобр_вст]
      ,[ЗаймОтОдобр_без_вст]
      ,[ВремяОтВстречаНазначенаДоКДМинут]
      ,[Диапазон5]
      ,[ВремяОтВерификацияКЦДоВыдачиЧасы]
      ,[НеделяЗаявки]	 
      ,case
			when cast(a0.[Заем выдан] as date) = @today_d then NULL
			else [НеделяЗайма]
		end as [НеделяЗайма]
      ,case
			when cast(a0.[Заем выдан] as date) = @today_d then NULL
			else [МесяцВыдач]
		end as [МесяцВыдач]
      ,[ГодВыдачи]
      --,g1.[Канал от источника]
      --,g1.[Группа каналов]
	  ,IIF(a0.[Номер] in ('21070300118919',
							'22010300186905',
							'22011900208198'
							,'22020600234960'
,'22020400232708', '22030300284053', '22033000322464'),'Оформление на партнерском сайте',a0.[Канал от источника]) as 'Канал от источника'
	  ,IIF(a0.[Номер] in ('21070300118919',
							'22010300186905',
							'22011900208198'
							,'22020600234960'
,'22020400232708', '22030300284053', '22033000322464'),'Партнеры',a0.[Группа каналов]) as 'Группа каналов'
	
      ,[МесяцЗаявки]
	  ,[ГодЗаявки]
      --,[Телефон]
      --,[ДатаЗаявкиПолная]
      --,[Дубль_ClientGuid]
      ,a0.[ФИО]
      --,[Дубль_ClientGuidОдинДень]
	  
	  , [ПризнакКП] as 'Признак_КП'
      , [ПризнакСтраховка] as 'Признак_Страховка'
      , [ПризнакСтрахованиеЖизни] as 'Признак_СЖ'
      , [ПризнакКаско] as 'Признак_КАСКО'
      , [ПризнакРАТ] as 'Признак_РАТ'
      ,null as 'Признак_ПозНастрой'
      ,[ПризнакПомощьБизнесу] as 'Признак_ПомощьБизнесу'
	  ,[ПризнакТелемедицина] as 'Признак Телемедицина'
      ,[Признак Защита от потери работы] as 'Признак Защита от потери работы'
	 
	  ,[СуммаДопУслуг] as 'Сумма_КП'
	  ,[СуммаДопУслугCarmoneyNet] as 'Сумма_КП_net'
      ,iif ([ПризнакСтраховка]=1, isnull([SumKasko], 0) +isnull([SumEnsur], 0)+isnull([SumQuietLife], 0),0) as 'Сумма_Страховка'
      ,iif( [SumEnsur] is null,  0, [SumEnsur]) as 'Сумма_СЖ'
      ,iif ([SumKasko] is null,  0, [SumKasko]) as 'Сумма_КАСКО'
      ,iif( [SumRat] is null,  0, [SumRat]) as 'Сумма_РАТ'
      ,iif ([SumCushion] is null,  0, [SumCushion]) as 'Сумма_ПозНастрой'
      ,iif ([SumHelpBusiness] is null,  0, [SumHelpBusiness]) as 'Сумма_ПомощьБизнесу'
	      ,iif ([SumTeleMedic] is null,  0, [SumTeleMedic]) as 'Сумма_Телемедицина'
	  ,null as 'Отказ_Страховка'
	  ,iif (a0.[Партнер] like '%ВМ №%', 'ВМ', '?') as 'Способ_оформления'
	  ,a0.[Дубль]
	  --,[TTC_number]
      ,[TTC]
	  --,b1.[Канал от источника] as 'Канал от источника1'
      --,b2.[Группа каналов] as 'Группа каналов1'
	  ,case 
			when 1-a0.isPts=1  then 'Беззалог'
			when product = 'Первичные: RBP - 40'  then 'Ставка 40-50'
			when ИспытательныйСрок=1  then 'ПТС31'
			when a0.[Признак рефинансирование] = 1 then 'Рефинансирование'
			else 'Основной продукт'
		end as [Тип продукта]
		, case
			when cast(a0.[Заем выдан] as date) = @today_d then NULL
			else a0.[Выданная сумма]
		end *  ПроцСтавкаКредит СтавкаНаСумму
		,1-a0.isPts isInstallment
		, productType productType
  FROM #fa0 a0 
 
) as c1
UNION ALL
SELECT
 cast (b.[Дата] as date) as 'Дата заявки'
--,[Время]
,b.[Номер]
,b.[Текущий статус]
,b.[Место cоздания]
,b.[Автор]
,null [Причина отказа]
,b.[РП]
,b.[РО_Регион]
,b.[Партнер]
,b.[Номер партнера]
,b.[Юрлицо]
,b.[Регион проживания]
,b.[Вид займа]
,b.[Продукт]
,b.[Срок займа]
,b.[Первичная сумма]
,b.[Сумма одобренная]
,b.[Выданная сумма]
,b.[Сумма заявки]
,b.[Способ выдачи]
,b.[LCRM ID]
,b.[Верификация КЦ]
,b.[Предварительное одобрение]
,b.[Встреча назначена]
,b.[Контроль данных]
,b.[Верификация документов клиента]
,b.[Одобрены документы клиента]
,b.[Верификация документов]
,b.[Одобрено]
,b.[Договор зарегистрирован]
,b.[Договор подписан]
,b.[Заем выдан]
,b.[Заем погашен]
,b.[Заем аннулирован]
,b.[Аннулировано]
,b.[Отказ документов клиента]
,b.[Отказано]
,b.[Отказ клиента]
,b.[Забраковано]
,b.[ПризнакЗаявка]
,b.[ПризнакПредварительноеОдобрение]
,b.[ПризнакВстречаНазначена]
,b.[ПризнакКонтрольДанных]
,b.[ПризнакКонтрольДанныхИзФактическихВстреч]
,b.[ПризнакВерификацияДокументовКлиента]
,b.[ПризнакОдобреныДокументовКлиента]
,b.[ПризнакВерификацияДокументов]
,b.[ПризнакОдобрено]
,b.[ПризнакДоговорЗарегистрирован]
,b.[ПризнакДоговорПодписан]
,b.[ПризнакЗайм]
,b.[ПризнакОтказано]
,b.[Признак Отказ документов клиента]
,b.[ПризнакОтказКлиента]
,b.[ПризнакЗабраковано]
,b.[ЛагЗаявкаЗаймДней]
,b.[ЛагКрупноЗаявкаЗайм]
,b.[ПризнакЗаймДеньВДень]
,b.[ПризнакЗаймНеДеньВДень]
,b.[ЛагВстречаКонтрольДанныхВДнях]
,b.[ЛагВстречаКонтрольДанныхДеньВДеньДней]
,b.[ЛагВстречаКонтрольДанныхНеДеньВДеньДней]
,b.[НеПрошлиКД]
,b.[КДраньшеВстречиИЛИБезВстречи]
,b.[КДБезНазначеннойВстречи]
,b.[ЛагОдобреноЗаймДней]
,b.[ЛагОдобреноЗайм_День_в_день]
,b.[ЛагОдобреноЗайм_Не_День_в_день]
,b.[ДИАПАЗОН_КД_ЗаймДней]
,b.[ОдобреноОтКД_со_встр]
,b.[ОдобреноОтКД_без_встр]
,b.[ОдобреноНоЗаймНеВыдан]
,b.[ЗаймОтОдобр_вст]
,b.[ЗаймОтОдобр_без_вст]
,b.[ВремяОтВстречаНазначенаДоКДМинут]
,b.[Диапазон5]
,b.[ВремяОтВерификацияКЦДоВыдачиЧасы]
,b.[НеделяЗаявки]
,b.[НеделяЗайма]
,b.[МесяцВыдач]
,b.[ГодВыдачи]
,b.[Канал от источника]
,b.[Группа каналов]
,b.[МесяцЗаявки]
,b.[ГодЗаявки]
,b.ФИО
,b.[Признак_КП]
,b.[Признак_Страховка]
,b.[Признак_СЖ]
,b.[Признак_КАСКО]
,b.[Признак_РАТ]
,b.[Признак_ПозНастрой]
,b.[Признак_ПомощьБизнесу]
,cast(null as int) [Признак Защита от потери работы]
,cast(null as int) [Признак Телемедицина]
,[Сумма_КП]
,null [Сумма_КП_net]
,[Сумма_Страховка]
,[Сумма_СЖ]
,[Сумма_КАСКО]
,[Сумма_РАТ]
,[Сумма_ПозНастрой]
,[Сумма_ПомощьБизнесу]
,cast(null as int) [Сумма_Телемедицина]
,iif(b.[Номер] is null,  1, 0) as 'Отказ_Страховка'
,[Способ_оформления]
,b.[Дубль]
,b.[TTC]
	  , 'Бизнес займ' as [Тип продукта]
		, case
			when cast(a0.[Заем выдан] as date) = @today_d then NULL
			else b.[Выданная сумма]
		end *  b.ПроцСтавкаКредит СтавкаНаСумму
		,1-a0.isPts isInstallment
		,'Бизнес займ' productType
from [Stg].[files].[BZ_buffer] b (nolock)
	left join #fa0 a0  (nolock) on a0.Номер = b.Номер
	--left join #fa1 f (nolock) on a0.Номер = f.Номер
	left join reports.dbo.dm_SalesBusiness bb  on try_cast(try_cast( bb.НомерДоговора as bigint) as nvarchar(25)) = b.номер 
) as f1

drop table if exists #of

select Наименование, Код, dateadd(year, -2000, ДатаОткрытия) ДатаОткрытия 
into #of
from
[Stg].[_1cCRM].[Справочник_Офисы]
where dateadd(year, -2000, ДатаОткрытия)>= dateadd(day, -30, getdate())
order by ДатаОткрытия

drop table if exists #КВ
select Номер, [Общая сумма вознаграждения Агента (в руб)] into #КВ from [Analytics].[dbo].v_request_cost_partner

drop table if exists #rt
select Номер, [Заем выдан], [Заем погашен], povt_parent_product, docred_parent_product, next_povt_product  into #rt from return_types --order by 1 desc

select a.*, b.[Общая сумма вознаграждения Агента (в руб)] [КВ партнерам]
, case when format( a.[Заем выдан]   , 'yyyy-MM-01') =  format( getdate()  , 'yyyy-MM-01') then 'Текущий месяц' else format( a.[Заем выдан]   , 'yyyy-MM-01') end [Заем выдан Месяц текст] 
, case when format( a.[Дата заявки]   , 'yyyy-MM-01') =  format( getdate()  , 'yyyy-MM-01') then 'Текущий месяц' else format( a.[Дата заявки]   , 'yyyy-MM-01') end [Дата заявки Месяц текст] 
, case when format( convert(datetime,a.[Дата заявки],104) , 'yyyy-MM-dd') =  format(dateadd(dd,-1,cast(getdate() as date)), 'yyyy-MM-dd') then 'Вчера' else format( a.[Дата заявки]   , 'yyyy-MM-dd') end [Дата заявки Вчера текст]
 ,case 
	when [Дата заявки] = '20220101' or [Дата заявки] = '20220102'  then '2021-12-27 - 2022-01-02 (52 Неделя)'
		when datepart(WEEK,convert(datetime,dateadd(dd,-1,[Дата заявки]),104)) =  (cast(datepart(ww,dateadd(dd,-1,cast(getdate() as date))) as varchar(10))) then 'Текущая неделя' 
		when datepart(dw,convert(datetime,[Дата заявки],104)) = 1 then concat (format(convert(datetime,[Дата заявки],104) - (datepart(dw,convert(datetime,[Дата заявки],104))+5),'yyyy-MM-dd'),' - ',format(convert(datetime,[Дата заявки],104),'yyyy-MM-dd'),' (', datepart(WEEK,convert(datetime,[Дата заявки],104))-2, ' Неделя)')
		else  concat 
		(format(convert(datetime,[Дата заявки],104) - (datepart(dw,convert(datetime,[Дата заявки],104))-2),'yyyy-MM-dd'),' - ',
		format(convert(datetime,[Дата заявки],104) + (7 - (datepart(dw,convert(datetime,[Дата заявки],104))-1)),'yyyy-MM-dd'),' (', datepart(WEEK,convert(datetime,[Дата заявки],104))-1, ' Неделя)')  end [Дата заявки Неделя текст]
,case when cast(ГодЗаявки as varchar(4)) =  (cast(datepart(yy,dateadd(dd,-1,cast(getdate() as date))) as varchar(4))) then 'Текущий год' else cast(ГодЗаявки as varchar(4)) end [Год заявки Неделя текст]
 ,case when cast(ГодВыдачи as varchar(4)) =  (cast(datepart(yy,dateadd(dd,-1,cast(getdate() as date))) as varchar(4))) then 'Текущий год' else cast(ГодВыдачи as varchar(4)) end [Год выдачи Неделя текст]
 , case when format( convert(datetime,a.[Заем выдан],104) , 'yyyy-MM-dd') =  format(dateadd(dd,-1,cast(getdate() as date)), 'yyyy-MM-dd') then 'Вчера' else format( a.[Заем выдан]   , 'yyyy-MM-dd') end [Дата займа Вчера текст]
  ,case
	when a.[Заем выдан] = '20220101' or a.[Заем выдан] = '20220102'  then '2021-12-27 - 2022-01-02 (52 Неделя)'
		when datepart(WEEK,convert(datetime,dateadd(dd,-1,a.[Заем выдан]),104)) =  (cast(datepart(ww,dateadd(dd,-1,cast(getdate() as date))) as varchar(10))) then 'Текущая неделя' 
		when datepart(dw,convert(datetime,a.[Заем выдан],104)) = 1 then concat (format(convert(datetime,a.[Заем выдан],104) - (datepart(dw,convert(datetime,a.[Заем выдан],104))+5),'yyyy-MM-dd'),' - ',format(convert(datetime,a.[Заем выдан],104),'yyyy-MM-dd'),' (', datepart(WEEK,convert(datetime,a.[Заем выдан],104))-2, ' Неделя)')
		else  concat 
		(format(convert(datetime,a.[Заем выдан],104) - (datepart(dw,convert(datetime,a.[Заем выдан],104))-2),'yyyy-MM-dd'),' - ',
		format(convert(datetime,a.[Заем выдан],104) + (7 - (datepart(dw,convert(datetime,a.[Заем выдан],104))-1)),'yyyy-MM-dd'),' (', datepart(WEEK,convert(datetime,a.[Заем выдан],104))-1, ' Неделя)')  end [Дата займа текст]
 
 ,iif(o.ДатаОткрытия is null,0,1)  Офис30дн 
 ,iif([Сумма одобренная] < [Первичная сумма] and [ПризнакОдобрено] = 1, 1, 0) 'Признак порезан'
 ,case when datediff(day,  r.[Заем выдан], r.[Заем погашен])<=1 and datediff(day,  rr.[Заем выдан], rr.[Заем погашен])<=1 then 1 else 0 end 'Повторное ПДП 1 день'
 ,case when datediff(day,  r.[Заем выдан], r.[Заем погашен])<=17 and datediff(day,  rr.[Заем выдан], rr.[Заем погашен])<=17 then 1 else 0 end 'Повторное ПДП 17 день'
 ,case when datediff(day,  r.[Заем выдан], r.[Заем погашен])<=30 and datediff(day,  rr.[Заем выдан], rr.[Заем погашен])<=30 then 1 else 0 end 'Повторное ПДП 30 день'
 ,case when datediff(day,  rr.[Заем погашен], r_next.[Заем выдан])<=90 and datediff(day,  rr.[Заем выдан], rr.[Заем погашен])<=30 then 1 else 0 end 'ПДП 30 дней + повторный в теч 90 дней'

 from #t2 a
left join #КВ b on a.Номер=b.Номер
left join #of o on a.[Номер партнера] = o.Код
left join #rt rr on a.Номер=rr.Номер
left join #rt r on r.Номер=isnull(rr.povt_parent_product	 , rr.docred_parent_product)
left join #rt r_next on r_next.Номер=rr.next_povt_product
--where a.Номер='22060800414226'
--order by [Заем выдан] desc
where 1=1


end 


if @mode = 'newOffice'
begin
;
with v as (
select Наименование, Код, dateadd(year, -2000, ДатаОткрытия) ДатаОткрытия 
from
[Stg].[_1cCRM].[Справочник_Офисы]
where dateadd(year, -2000, ДатаОткрытия)>= dateadd(day, -30, getdate())
--porder by ДатаОткрытия

)
, cnt as (
select a.Код

, count(case when [Группа каналов]='Партнеры' then [Верификация КЦ] end) cnt_привлечение
, count(case when [Группа каналов]<>'Партнеры' then [Верификация КЦ] end) cnt_оформление


from v a left join v_fa f on f.[Номер партнера]=a.Код
group by  a.Код
)

select a.*, v.ДатаОткрытия, v.Наименование from cnt a

left join v on a.Код=v.Код


end