 
CREATE   proc kpi_metricsBezzalog
as
begin



							   	  DECLARE @rr FLOAT = (
		SELECT [Доля дня птс накоп]
		FROM [v_План по каналам_по_дням]
		WHERE Дата = cast(getdate() - 1 AS DATE)
		)



select
'ФАКТ REFERRAL' тип
,cast(format(isnull(cast( [Верификация кц] as date), День  ), 'yyyy-MM-01' )as date)  Месяц
, [Как создан]
, [Вид займа лид любой продукт] [Вид займа лид]			 
 		 
, sum(Лидов)  Лидов
, count([Верификация кц])   ЗаявкиПоЗаймам
, count([Верификация кц])   Заявки

,  count(Одобрено		  )  Одобрено		 
,  count(Отказано		  )  Отказано		 
,  count([Выдача денег]	  )  [Выдача денег]	 
,  sum([Выданная сумма] )	   [Выданная сумма]


from _birs.product_report_all_actions
WHERE cast(format(isnull(cast( [Верификация кц] as date), День  ), 'yyyy-MM-01' )as date) >= cast(format(getdate() - 140, 'yyyy-MM-01') AS DATE)
	AND  isnull(cast( [Верификация кц] as date), День  )  < getdate() - 1



and  is_pts=0	  and 	( [Как создан]='ref'	or  id is not null)   and isnull([Дубль_8_дней любой продукт], 0)<>1 and case when isnull(has_pts_request, 0)>0 and 	 isnull(has_bz_request, 0)=0	   then 1 else 0 end <>1
group by 
 cast(format(isnull(cast( [Верификация кц] as date), День  ), 'yyyy-MM-01' )as date)  , is_pts, [Как создан], [Вид займа лид любой продукт]
-- order by 2, 3
   union all  
select
'RR REFERRAL' тип
, cast(format(isnull(cast( [Верификация кц] as date), День  ), 'yyyy-MM-01' )as date) Месяц
, [Как создан]
, [Вид займа лид любой продукт] [Вид займа лид]			 
 		 
, sum(Лидов)/@rr  Лидов
, count([Верификация кц])/@rr   ЗаявкиПоЗаймам
, count([Верификация кц])/@rr   Заявки

,  count(Одобрено		  )/@rr   Одобрено		 
,  count(Отказано		  )/@rr   Отказано		 
,  count([Выдача денег]	  )/@rr   [Выдача денег]	 
,  sum([Выданная сумма] )	/@rr   [Выданная сумма]


from _birs.product_report_all_actions
WHERE cast(format(isnull(cast( [Верификация кц] as date), День  ), 'yyyy-MM-01' )as date) = cast(format(getdate() - 1, 'yyyy-MM-01') AS DATE)
	AND  isnull(cast( [Верификация кц] as date), День  )  < getdate() - 1




and  is_pts=0	  and 	( [Как создан]='ref'	or  id is not null)   and isnull([Дубль_8_дней любой продукт], 0)<>1  and case when isnull(has_pts_request, 0)>0 and 	 isnull(has_bz_request, 0)=0	   then 1 else 0  end <>1

group by 
 cast(format(isnull(cast( [Верификация кц] as date), День  ), 'yyyy-MM-01' )as date)  , is_pts, [Как создан], [Вид займа лид любой продукт] union all 

select 
 'План' тип	
,'20240501'
,'ref'
,'Первичный'
, 90000.0         Лидов
, 48762.0    ЗаявкиПоЗаймам
, 39600.0      Заявки
, 2649.5 				Одобрено
, 45442.7 			Отказано
, 2438.1 			[Выдача денег]
, 46412248.9 			[Выданная сумма] union all 
select 
 'План' тип	
,'20240501'
,'ref'
,'Повторный'
, 7326.8         Лидов
, 5495.1    ЗаявкиПоЗаймам
, 5495.1      Заявки
, 1191.0 				Одобрено
, 4277.0 			Отказано
, 1132.0 			[Выдача денег]
, 27827294.4 			[Выданная сумма] 

 union all 
select 
 'План' тип	
,'20240601'
,'ref'
,'Первичный'
, 110066.5         Лидов
, 48762.0    ЗаявкиПоЗаймам
, 48429.3      Заявки
, 2701.4 				Одобрено
, 45195.4 			Отказано
, 2438.1 			[Выдача денег]
, 46412248.9 			[Выданная сумма] 
 union all 
select 
 'План' тип	
,'20240601'
,'ref'
,'Повторный'
, 9562.1         Лидов
, 7171.5    ЗаявкиПоЗаймам
, 7171.5      Заявки
, 2203.8 				Одобрено
, 4804.9 			Отказано
, 1477.3 			[Выдача денег]
, 35025624.8 			[Выданная сумма] 
 union all 
select 
 'План' тип	
,'20240701'
,'ref'
,'Первичный'
, 110066.5         Лидов
, 48762.0    ЗаявкиПоЗаймам
, 48429.3      Заявки
, 2712.0 				Одобрено
, 44982.2 			Отказано
, 2438.1 			[Выдача денег]
, 46811520.0 			[Выданная сумма] union all 
select 
 'План' тип	
,'20240701'
,'ref'
,'Повторный'
, 9498.1         Лидов
, 7123.6    ЗаявкиПоЗаймам
, 7123.6      Заявки
, 2258.2 				Одобрено
, 4772.8 			Отказано
, 1467.5 			[Выдача денег]
, 35906244.8 			[Выданная сумма] 
union all 
select 
 'План' тип	
,'20240801'
,'ref'
,'Первичный'
, 71076.6         Лидов
, 28430.7    ЗаявкиПоЗаймам
, 28430.7      Заявки
, 1581.2 				Одобрено
, 21035.2 			Отказано
, 1945.3 			[Выдача денег]
, 37350144.0 			[Выданная сумма]
union all 
select 
 'План' тип	
,'20240801'
,'ref'
,'Повторный'
, 2471.0         Лидов
, 1853.3    ЗаявкиПоЗаймам
, 1853.3      Заявки
, 587.5 				Одобрено
, 1280.9 			Отказано
, 569.5 			[Выдача денег]
, 14980647.9 			[Выданная сумма]
union all 
select 
 'План' тип	
,'20240901'
,'ref'
,'Первичный'
, 69497.2         Лидов
, 27798.9    ЗаявкиПоЗаймам
, 27798.9      Заявки
, 1546.1 				Одобрено
, 20052.5 			Отказано
, 1945.3 			[Выдача денег]
, 37350144.0 			[Выданная сумма] union all 
select 
 'План' тип	
,'20240901'
,'ref'
,'Повторный'
, 2741.7         Лидов
, 2056.3    ЗаявкиПоЗаймам
, 2056.3      Заявки
, 651.9 				Одобрено
, 1485.2 			Отказано
, 619.3 			[Выдача денег]
, 14980647.9 			[Выданная сумма] 
 union all 
select 
 'План' тип	
,'20241001'
,'ref'
,'Первичный'
, 83957.7         Лидов
, 41139.3    ЗаявкиПоЗаймам
, 41139.3      Заявки
, 1768.9 				Одобрено
, 38607.9 			Отказано
, 1503.6 			[Выдача денег]
, 24381629.6 			[Выданная сумма] union all 
select 
 'План' тип	
,'20241001'
,'ref'
,'Повторный'
, 3166.0         Лидов
, 2374.5    ЗаявкиПоЗаймам
, 2374.5      Заявки
, 702.1 				Одобрено
, 1642.9 			Отказано
, 631.9 			[Выдача денег]
, 10929247.6 			[Выданная сумма] 
 
 union all 
select 
 'План' тип	
,'20241101'
,'ref'
,'Первичный'
, 67116.2         Лидов
, 32886.9    ЗаявкиПоЗаймам
, 32886.9      Заявки
, 1768.9 				Одобрено
, 30506.2 			Отказано
, 1503.6 			[Выдача денег]
, 24381629.6 			[Выданная сумма] union all 
select 
 'План' тип	
,'20241101'
,'ref'
,'Повторный'
, 2945.2         Лидов
, 2208.9    ЗаявкиПоЗаймам
, 2208.9      Заявки
, 705.5 				Одобрено
, 1473.7 			Отказано
, 635.0 			[Выдача денег]
, 11007864.7 			[Выданная сумма]






end
