

CREATE   proc  [dbo].[_birs_create_report_kpi_requests]

as


begin

DROP TABLE

IF EXISTS #t1
	SELECT   Номер
		,[вид займа_3]
		,[CPA трафик в МП источник]	   
		,Медийка
		,Контекст
		,[Прочие маркетинговые расходы]
		,[Партнеры оформление]
		,[Партнеры привлечение]
		,[Расходы на триггеры]
		,[Расходы на CPA]
		,[Маркетинговые расходы]
		,Источник
		,[Тип трафика]
	INTO #t1
	FROM [v_Отчет стоимость займа опер]



drop table if exists #t2
select * into #t2
from [_birs_requests_excel]


--EXEC select_table'#T2'
  drop table if exists #t4
;
with v as (

select *
from #t2 a

)

  select 
   -- a.[Номер] 
--,  
a.[День займа/заявки] 
,   a.[Месяц займа/заявки] 
,   a.[Квартал займа/заявки] 
,   a.[Год займа/заявки] 
,   a.[Дубль] 
,   a.[Вид займа] 
,   a.[isInstallment] 
--,   a.[Причина отказа] 
,   a.[Вид займа_2] 
--,   a.[ДатаЗаявкиПолная] 
,   a.[Место cоздания] 
,   a.[Место_создания_2] 
,   a.[Группа каналов] 
,   a.[Канал от источника] 
,   a.[Источник] 
,   a.[Тип трафика] 
--,   a.[Партнер] 
--,   a.[Верификация КЦ] 
--,   a.[Предварительное одобрение] 
--,   a.[Контроль данных] 
--,   a.[Признак Доработки КД] 
--,   a.[Доработки КД количество] 
--,   a.[Call2] 
--,   a.[Call2 accept] 
--,   a.[Верификация документов клиента] 
--,   a.[Доработки Верификаторы] 
--,   a.[Признак Доработки Верификаторы] 
--,   a.[Признак Доработки Верификация ТС] 
--,   a.[Доработки Верификация ТС количество] 
--,   a.[Признак Доработки Верификация клиента] 
--,   a.[Доработки Верификация клиента количество] 
--,   a.[Одобрены документы клиента] 
--,   a.[Верификация документов] 
--,   a.[Одобрено] 
--,   a.[Отказано] 
--,   a.[Отказ документов клиента] 
--,   a.[Отказ клиента] 
--,   a.[Аннулировано] 
--,   a.[Заем аннулирован] 
--,   a.[Забраковано] 
--,   a.[Заем выдан] 
--,   a.[Заем погашен] 
,   a.[Выданная сумма] 
,   a.[Сумма одобренная] 
,   a.[Первичная сумма] 
,   a.[Сумма заявки] 
,   a.[СуммаВыдачиБезКП] 
,   a.[ПризнакКП] 
,   a.[ПризнакСтраховка] 
,   a.[СуммаДопУслугCarmoneyNet] 
--,   a.[СуммаДопУслугCarmoney] 
,   a.[СуммаДопУслуг] 
,   a.[ПризнакКаско] 
,   a.[ПризнакСтрахованиеЖизни] 
,   a.[ПризнакРАТ] 
,   a.[ПризнакПозитивНастр] 
,   a.[ПризнакПомощьБизнесу] 
,   a.[ПризнакТелемедицина] 
,   a.[Признак Защита от потери работы] 
,   a.[ПризнакФарма] 
,   a.[ПризнакСпокойнаяЖизнь] 
,   a.[Признак РАТ Юруслуги] 
,   a.[SumKasko] 
--,   a.[SumKaskoCarmoney] 
,   a.[SumKaskoCarmoneyNet] 
,   a.[SumEnsur] 
--,   a.[SumEnsurCarmoney] 
,   a.[SumEnsurCarmoneyNet] 
,   a.[SumRat] 
--,   a.[SumRatCarmoney] 
,   a.[SumRatCarmoneyNet] 
--,   a.[SumPositiveMood] 
--,   a.[SumPositiveMoodCarmoney] 
,   a.[SumHelpBusiness] 
--,   a.[SumHelpBusinessCarmoney] 
,   a.[SumHelpBusinessCarmoneyNet] 
,   a.[SumTeleMedic] 
--,   a.[SumTeleMedicCarmoney] 
,   a.[SumTeleMedicCarmoneyNet] 
,   a.[SumCushion] 
--,   a.[SumCushionCarmoney] 
,   a.[SumCushionCarmoneyNet] 
,   a.[SumPharma] 
--,   a.[SumPharmaCarmoney] 
,   a.[SumPharmaCarmoneyNet] 
,   a.[SumQuietLife] 
--,   a.[SumQuietLifeCarmoney] 
,   a.[SumQuietLifeCarmoneyNet] 
,   a.[Сумма РАТ Юруслуги] 
--,   a.[Сумма РАТ Юруслуги Carmoney] 
,   a.[Сумма РАТ Юруслуги Carmoney Net] 
,   a.[Срок] 
,   a.[ПроцСтавкаКредит] 
,   a.[fpd0] 
,   a.[fpd4] 
,   a.[fpd7] 
,   a.[fpd30] 
,   a.[fpd60] 
,   a.[HR30_4] 
,   a.[HR90_12] 
,   a.[HR90_6] 
,   a.[full_prepayment_30] 
,   a.[full_prepayment_60] 
,   a.[full_prepayment_90] 
,   a.[full_prepayment_180] 
,   a.[ВозрастНаДатуЗаявки] 
,   a.[СуммарныйМесячныйДоход_CRM] 
,   a.[РегионПроживания] 
,   a.[ПолКлиента] 
,   a.[ИспытательныйСрок] 
,   a.[RBP] 
,   a.[product] 
,   a.[ПризнакРефинансирование] 
,   a.[РекомендованнаяСтавка] 
,   a.[user_os] 
--,   a.[request_id] 
--,   a.[Верификация КЦ - Контроль данных секунды] 
--,   a.[Контроль данных - Одобрено секунды] 
--,   a.[Верификация КЦ - Заем выдан секунды] 
--,   a.[Верификация КЦ - Предварительное одобрение секунды] 
--,   a.[Предварительное одобрение - Контроль данных секунды] 
--,   a.[Контроль данных - Верификация документов клиента секунды] 
--,   a.[Верификация документов клиента - Одобрено секунды] 
--,   a.[Одобрено - Заем выдан секунды] 
,   a.[Сумма страховок] 
,   a.[Сумма страховок Carmoney] 
,   a.[Сумма страховок Carmoney Net] 
,   a.[Сумма КП] 
,   a.[Сумма КП Carmoney Net] 
--,   a.[Отказ Carmoney] 
--,   a.[Отказ Чекеры] 
,   a.[Одобрено Чекеры] 
--,   a.[Финальное решение] 
--,   a.[Финальное решение после КД] 
--,   a.[Отказ Carmoney после КД] 
,   a.[Вид заполнения] 
,   a.[Вариант предложения ставки] 
,   a.[РП] 
,   a.[РО_Регион] 
,   a.[Дата заявки месяц] 
,   a.[Верификация КЦ месяц] 
,   a.[Верификация КЦ Неделя] 
,   a.[Верификация КЦ Квартал] 
,   a.[Заем выдан месяц] 
,   a.[Заем выдан Неделя] 
,   a.[Признак заявки] 
,   a.[Признак Верификация КЦ] 
,   a.[Признак Предварительное одобрение] 
,   a.[Признак Встреча назначена] 
,   a.[Признак Контроль данных] 
,   a.[Признак Одобрено Чекеры] 
,   a.[Признак Отказ Чекеры] 
,   a.[Признак Финальное решение после КД] 
,   a.[Признак Отказ Carmoney после КД] 
,   a.[Признак Call2] 
,   a.[Признак Call2 accept] 
,   a.[Признак Верификация документов клиента] 
,   a.[Признак Одобрены документы клиента] 
,   a.[Признак Верификация документов] 
,   a.[Признак Одобрено] 
,   a.[Признак Отказано] 
,   a.[Признак Отказ Carmoney] 
,   a.[Признак Отказ документов клиента] 
,   a.[Признак Отказ клиента] 
,   a.[Признак Аннулировано] 
,   a.[Признак Заем аннулирован] 
,   a.[Признак Забраковано] 
,   a.[Признак ДатаДоговора] 
,   a.[Признак Заем выдан] 
,   a.[Признак Заем выдан cmr] 
,   a.[Признак Заем погашен] 
,   a.[Признак не застрял после Call2 accept] 
,   a.[Признак застрял после Call2 accept] 
,   a.[Дата заявки день] 
,   a.[Верификация КЦ день] 
--,   a.[Контроль данных день] 
,   a.[Заем выдан день] 
,   a.[Заем погашен день] 
,   a.[Флагманский офис] 
--,   a.[Ставка умножить на сумму] 
,   a.[Фактический срок жизни по закрытым] 
,   a.[Фактический срок жизни по закрытым за 180 дней]

,b.[CPA трафик в МП источник]	 
,b.Медийка
,b.Контекст
,b.[вид займа_3]
,b.[Маркетинговые расходы]
,b.[Партнеры привлечение]
,b.[Партнеры оформление]

,b.[Прочие маркетинговые расходы]
,b.[Расходы на CPA]	 
,b.[Расходы на триггеры]	 
,case when isnull(dbo.lcrm_is_inst_lead(a.[Тип трафика] , a.Источник, null), a.isinstallment)=1 then 'Трафик инст' else 'Трафик ПТС' end [Трафик продукт]

,
case when [Группа каналов] = 'CPA'
then 
isnull([CPA трафик в МП источник], b.Источник) 
else [канал от источника]
end [Источник аналитический]
,

case when [Группа каналов] in  ('Партнеры', 'Банки') then 'Оффлайн' else 'Онлайн' end [Тип привлечения]

--	  into #t4
from v a
left join #t1 b on a.Номер=b.Номер
where year([День займа/заявки])>=2020

--select * from 	 #t4


end
