
CREATE   proc [dbo].[Подготовка отчета докреды и повторники] @mode nvarchar(max)= 's'

 as


 begin

   if @mode='u'
   begin

exec [C2-VSR-BIRS].[RS_Jobs].dbo.StartReportJob  'C06E0B31-45C4-4C8B-9F0F-67AED2B52C57'
--exec log_email 'Отчет докреды и повторники обновлен'

   
   end





   if @mode='s'

   begin

   select *
   , case 
	  when year(getdate())- 	year([Месяц выдачи по докредам и погашения по повторным])>4  or [Месяц выдачи по докредам и погашения по повторным] is null then ' Остальные'
	  else   format(year([Месяц выдачи по докредам и погашения по повторным]), '0') end [Год выдачи по докредам и погашения по повторным]

   from (
SELECT [cmonth] Дата
      ,[category]
      ,[t]
      ,[is_new]
,[Количество попыток]
      ,[Количество клиентов]
      ,[Сумма лимитов]
      ,[Загружено в обзвон]
      ,[Совершена попытка дозвона]
      ,[Дозвон]
      ,[Количество заявок]
      ,[Предварительное одобрение]
      ,[Контроль данных]
      ,[Одобрено]
      ,[Отказ Carmoney]
      ,[Заем выдан]
      ,[Выданная сумма]
	  , тип = 'Месяц'
	  , getdate() created
	  ,  no_successfull_call_3_month
	  , [Месяц выдачи по докредам и погашения по повторным]
	 
  FROM [Analytics].[dbo].[отчет по базам докредитования и повторников по месяцам]
  union all
SELECT cweek Дата
      ,[category]
      ,[t]
      ,[is_new]
,[Количество попыток]
      ,[Количество клиентов]
      ,[Сумма лимитов]
      ,[Загружено в обзвон]
      ,[Совершена попытка дозвона]
      ,[Дозвон]
      ,[Количество заявок]
      ,[Предварительное одобрение]
      ,[Контроль данных]
      ,[Одобрено]
      ,[Отказ Carmoney]
      ,[Заем выдан]
      ,[Выданная сумма]
	  , тип = 'Неделя'
	  , getdate() created
	  , no_successfull_call_3_month
	  , [Месяц выдачи по докредам и погашения по повторным]
	 
  FROM [Analytics].[dbo].[отчет по базам докредитования и повторников по неделям]
  ) un
   end


  end