/****** Скрипт для команды SelectTopNRows из среды SSMS  ******/
CREATE proc [dbo].[create_dm_Factor_Analysis_001_replication_over_day]

as
begin

IF object_id('dbo.[dm_Factor_Analysis_001_replication_over_day]') is null
    CREATE TABLE [dbo].[dm_Factor_Analysis_001_replication_over_day](
	[replication_created] [datetime] NOT NULL,
	[Дата] [nvarchar](100) NULL,
	[Время] [nvarchar](100) NULL,
	[Номер] [nvarchar](100) NULL,
	[Текущий статус] [nvarchar](100) NULL,
	[Место cоздания] [nvarchar](100) NULL,
	[Автор] [nvarchar](100) NULL,
	[Причина отказа] [nvarchar](800) NULL,
	[РП] [nvarchar](150) NULL,
	[Регион] [nvarchar](255) NULL,
	[Партнер] [nvarchar](150) NULL,
	[Номер партнера] [nvarchar](4) NULL,
	[Регион проживания] [nvarchar](150) NULL,
	[Вид займа] [nvarchar](max) NULL,
	[Продукт] [nvarchar](100) NULL,
	[Срок займа] [numeric](10, 0) NULL,
	[Первичная сумма] [numeric](15, 0) NULL,
	[Сумма одобренная] [numeric](15, 0) NULL,
	[Выданная сумма] [numeric](15, 0) NULL,
	[Сумма заявки] [numeric](15, 0) NULL,
	[Способ выдачи] [varchar](45) NULL,
	[LCRM ID] [nvarchar](250) NULL,
	[Верификация КЦ] [datetime] NULL,
	[Предварительное одобрение] [datetime] NULL,
	[Встреча назначена] [datetime] NULL,
	[Контроль данных] [datetime] NULL,
	[Верификация документов клиента] [datetime] NULL,
	[Одобрены документы клиента] [datetime] NULL,
	[Верификация документов] [datetime] NULL,
	[Одобрено] [datetime] NULL,
	[Договор зарегистрирован] [datetime] NULL,
	[Договор подписан] [datetime] NULL,
	[Заем выдан] [datetime] NULL,
	[Заем погашен] [datetime] NULL,
	[Заем аннулирован] [datetime] NULL,
	[Аннулировано] [datetime] NULL,
	[Отказ документов клиента] [datetime] NULL,
	[Отказано] [datetime] NULL,
	[Отказ клиента] [datetime] NULL,
	[Забраковано] [datetime] NULL,
	[ПризнакЗаявка] [int] NULL,
	[ПризнакПредварительноеОдобрение] [int] NULL,
	[ПризнакВстречаНазначена] [int] NULL,
	[ПризнакКонтрольДанных] [int] NULL,
	[ПризнакКонтрольДанныхИзФактическихВстреч] [int] NULL,
	[ПризнакВерификацияДокументовКлиента] [int] NULL,
	[ПризнакОдобреныДокументовКлиента] [int] NULL,
	[ПризнакВерификацияДокументов] [int] NULL,
	[ПризнакОдобрено] [int] NULL,
	[ПризнакДоговорЗарегистрирован] [int] NULL,
	[ПризнакДоговорПодписан] [int] NULL,
	[ПризнакЗайм] [int] NULL,
	[ПризнакОтказано] [int] NULL,
	[ПризнакОтказКлиента] [int] NULL,
	[ЛагЗаявкаЗаймДней] [int] NULL,
	[ЛагКрупноЗаявкаЗайм] [nvarchar](14) NULL,
	[ПризнакЗаймДеньВДень] [int] NULL,
	[ПризнакЗаймНеДеньВДень] [int] NULL,
	[ЛагВстречаКонтрольДанныхВДнях] [int] NULL,
	[ЛагВстречаКонтрольДанныхДеньВДеньДней] [int] NULL,
	[ЛагВстречаКонтрольДанныхНеДеньВДеньДней] [int] NULL,
	[НеПрошлиКД] [int] NULL,
	[КДраньшеВстречиИЛИБезВстречи] [int] NULL,
	[КДБезНазначеннойВстречи] [int] NULL,
	[ЛагОдобреноЗаймДней] [int] NULL,
	[ЛагОдобреноЗайм_День_в_день] [int] NULL,
	[ЛагОдобреноЗайм_Не_День_в_день] [int] NULL,
	[ДИАПАЗОН_КД_ЗаймДней] [int] NULL,
	[ОдобреноОтКД_со_встр] [int] NULL,
	[ОдобреноОтКД_без_встр] [int] NULL,
	[ОдобреноНоЗаймНеВыдан] [int] NULL,
	[ЗаймОтОдобр_вст] [int] NULL,
	[ЗаймОтОдобр_без_вст] [int] NULL,
	[ВремяОтВстречаНазначенаДоКДМинут] [nvarchar](32) NULL,
	[Диапазон5] [nvarchar](14) NOT NULL,
	[ВремяОтВерификацияКЦДоВыдачиЧасы] [int] NULL,
	[НеделяЗаявки] [int] NULL,
	[НеделяЗайма] [int] NULL,
	[МесяцВыдач] [nvarchar](8) NULL,
	[ГодВыдачи] [int] NULL,
	[Канал от источника] [nvarchar](100) NULL,
	[Группа каналов] [nvarchar](100) NULL,
	[МесяцЗаявки] [nvarchar](8) NULL,
	[Телефон] [nvarchar](100) NULL,
	[TTC_number] [bigint] NULL,
	[TTC] [varchar](15) NULL,
	[ДатаЗаявкиПолная] [datetime] NULL,
	[Дубль] [int] NOT NULL,
	[Дубль_ClientGuid] [int] NOT NULL,
	[ПризнакЗабраковано] [int] NULL,
	[Признак Отказ документов клиента] [int] NULL,
	[ГодЗаявки] [int] NULL,
	[ФИО] [nvarchar](150) NULL,
	[Дубль_ClientGuidОдинДень] [int] NOT NULL,
	[P2P] [datetime] NULL,
	[ПризнакP2P] [int] NULL,
	[Ссылка заявка] [binary](16) NULL,
	[Ссылка клиент] [binary](16) NULL,
	[Дата отчета] [datetime] NULL,
	isInstallment bit NULL
)
ELSE
    PRINT '1'



IF NOT EXISTS(SELECT * FROM sys.indexes WHERE name = 'replication_created_clustered_index' AND object_id = OBJECT_ID('[dbo].[dm_Factor_Analysis_001_replication_over_day]'))
    BEGIN
        CREATE CLUSTERED INDEX [replication_created_clustered_index] ON [dbo].[dm_Factor_Analysis_001_replication_over_day]
(
	[replication_created] DESC
)ON [PRIMARY]


    END


declare @now_t datetime = getdate()

insert into   [dbo].[dm_Factor_Analysis_001_replication_over_day]


SELECT 


@now_t as replication_created
      ,[Дата]
      ,[Время]
      ,[Номер]
      ,[Текущий статус]
      ,[Место cоздания]
      ,[Автор]
      ,[Причина отказа]
      ,[РП]
      ,[Регион]
      ,[Партнер]
      ,[Номер партнера]
      ,[Регион проживания]
      ,[Вид займа]
      ,[Продукт]
      ,[Срок займа]
      ,[Первичная сумма]
      ,[Сумма одобренная]
      ,[Выданная сумма]
      ,[Сумма заявки]
      ,[Способ выдачи]
      ,[LCRM ID]
      ,[Верификация КЦ]
      ,[Предварительное одобрение]
      ,[Встреча назначена]
      ,[Контроль данных]
      ,[Верификация документов клиента]
      ,[Одобрены документы клиента]
      ,[Верификация документов]
      ,[Одобрено]
      ,[Договор зарегистрирован]
      ,[Договор подписан]
      ,[Заем выдан]
      ,[Заем погашен]
      ,[Заем аннулирован]
      ,[Аннулировано]
      ,[Отказ документов клиента]
      ,[Отказано]
      ,[Отказ клиента]
      ,[Забраковано]
      ,[ПризнакЗаявка]
      ,[ПризнакПредварительноеОдобрение]
      ,[ПризнакВстречаНазначена]
      ,[ПризнакКонтрольДанных]
      ,[ПризнакКонтрольДанныхИзФактическихВстреч]
      ,[ПризнакВерификацияДокументовКлиента]
      ,[ПризнакОдобреныДокументовКлиента]
      ,[ПризнакВерификацияДокументов]
      ,[ПризнакОдобрено]
      ,[ПризнакДоговорЗарегистрирован]
      ,[ПризнакДоговорПодписан]
      ,[ПризнакЗайм]
      ,[ПризнакОтказано]
      ,[ПризнакОтказКлиента]
      ,[ЛагЗаявкаЗаймДней]
      ,[ЛагКрупноЗаявкаЗайм]
      ,[ПризнакЗаймДеньВДень]
      ,[ПризнакЗаймНеДеньВДень]
      ,[ЛагВстречаКонтрольДанныхВДнях]
      ,[ЛагВстречаКонтрольДанныхДеньВДеньДней]
      ,[ЛагВстречаКонтрольДанныхНеДеньВДеньДней]
      ,[НеПрошлиКД]
      ,[КДраньшеВстречиИЛИБезВстречи]
      ,[КДБезНазначеннойВстречи]
      ,[ЛагОдобреноЗаймДней]
      ,[ЛагОдобреноЗайм_День_в_день]
      ,[ЛагОдобреноЗайм_Не_День_в_день]
      ,[ДИАПАЗОН_КД_ЗаймДней]
      ,[ОдобреноОтКД_со_встр]
      ,[ОдобреноОтКД_без_встр]
      ,[ОдобреноНоЗаймНеВыдан]
      ,[ЗаймОтОдобр_вст]
      ,[ЗаймОтОдобр_без_вст]
      ,[ВремяОтВстречаНазначенаДоКДМинут]
      ,[Диапазон5]
      ,[ВремяОтВерификацияКЦДоВыдачиЧасы]
      ,[НеделяЗаявки]
      ,[НеделяЗайма]
      ,[МесяцВыдач]
      ,[ГодВыдачи]
      ,[Канал от источника]
      ,[Группа каналов]
      ,[МесяцЗаявки]
      ,[Телефон]
      ,[TTC_number]
      ,[TTC]
      ,[ДатаЗаявкиПолная]
      ,[Дубль]
      ,[Дубль_ClientGuid]
      ,[ПризнакЗабраковано]
      ,[Признак Отказ документов клиента]
      ,[ГодЗаявки]
      ,[ФИО]
      ,[Дубль_ClientGuidОдинДень]
      ,[P2P]
      ,[ПризнакP2P]
      ,[Ссылка заявка]
      ,[Ссылка клиент]
      ,[Дата отчета]
      ,isInstallment
	 
 from dbo.[dm_Factor_Analysis_001]
 where [Верификация КЦ]>cast(@now_t as date)
 end
