
-- =============================================
-- Author:		
-- Create date: 2019-07-29
-- Description:	
--             exec [dbo].[reportDashboard02_CC_v2]   1
--             exec [dbo].[reportDashboard02_CC_v2]   2
--             exec [dbo].[reportDashboard02_CC_v2]   3
--             exec [dbo].[reportDashboard02_CC_v2]   4
--             exec [dbo].[reportDashboard02_CC_v2]   5
--             exec [dbo].[reportDashboard02_CC_v2]   51
-- =============================================
CREATE   PROCEDURE [dbo].[reportdashboard02_CC_v2]
	
	-- Add the parameters for the stored procedure here
--	@DateReport date,
--	@DateReport2 int = datediff(day,0,getdate()),
	@PageNo int 
	
AS

BEGIN
	-- SET NOCOUNT ON added to prevent extra result sets from
	-- interfering with SELECT statements.
	SET NOCOUNT ON;

         
    

if @PageNo=1	-- ПЕРВАЯ таблица
begin
select 
       [t1_Таблица]            [Таблица]
      ,[t1_Колво]              [Колво]
      ,[t1_КолвоДеньВДень]     [КолвоДеньВДень]
      ,[t1_Колво_7]            [Колво_7]
      ,[t1_КолвоДеньВДень_7]   [КолвоДеньВДень_7]
      ,[t1_СуммаЗаявки]        [СуммаЗаявки]
      ,[t1_СуммаДеньВДень]     [СуммаДеньВДень]
      ,[t1_СуммаЗаявки_7]      [СуммаЗаявки_7]
      ,[t1_СуммаДеньВДень_7]   [СуммаДеньВДень_7]
      ,[t1_СрЧекТек]           [СрЧекТек]
      ,[t1_СрЧекДеньВДень]     [СрЧекДеньВДень]
      ,[t1_СрЧекТек_7]         [СрЧекТек_7]
      ,[t1_СрЧекДеньВДень_7]   [СрЧекДеньВДень_7]
FROM [dbo].[dm_dashboard_ConmmonTable]
end
      
   
if @PageNo=2	-- ВТОРАЯ таблица
begin
select 
       [t2_Таблица]   [Таблица]
      ,[t2_Колво0]    [Колво0]
      ,[t2_Колво1]    [Колво1]
      ,[t2_Колво2]    [Колво2]
      ,[t2_Колво3]    [Колво3]
      ,[t2_Колво4]    [Колво4]
      ,[t2_Колво5]    [Колво5]
      ,[t2_Колво0_2]  [Колво0_2]
      ,[t2_Колво1_2]  [Колво1_2]
      ,[t2_Колво2_2]  [Колво2_2]
      ,[t2_Колво3_2]  [Колво3_2]
      ,[t2_Колво4_2]  [Колво4_2]
      ,[t2_Колво5_2]  [Колво5_2]
FROM [dbo].[dm_dashboard_ConmmonTable]
end

     
if @PageNo=3	-- ТРЕТЬЯ таблица
begin

select 
       [t3_Колво1_0]           [Колво1_0]
      ,[t3_СуммаЗаявки1_0]     [СуммаЗаявки1_0]
      ,[t3_Колво1_1]           [Колво1_1]
      ,[t3_СуммаЗаявки1_1]     [СуммаЗаявки1_1]
      ,[t3_Колво1_2]           [Колво1_2]
      ,[t3_СуммаЗаявки1_2]     [СуммаЗаявки1_2]
      ,[t3_Колво1_3]           [Колво1_3]
      ,[t3_СуммаЗаявки1_3]     [СуммаЗаявки1_3]
      ,[t3_Колво1_4]           [Колво1_4]
      ,[t3_СуммаЗаявки1_4]     [СуммаЗаявки1_4]
      ,[t3_Колво1_5]           [Колво1_5]
      ,[t3_СуммаЗаявки1_5]     [СуммаЗаявки1_5]
      ,[t3_Колво2_0]           [Колво2_0]
      ,[t3_СуммаЗаявки2_0]     [СуммаЗаявки2_0]
      ,[t3_Колво2_1]           [Колво2_1]
      ,[t3_СуммаЗаявки2_1]     [СуммаЗаявки2_1]
      ,[t3_Колво2_2]           [Колво2_2]
      ,[t3_СуммаЗаявки2_2]     [СуммаЗаявки2_2]
      ,[t3_Колво2_3]           [Колво2_3]
      ,[t3_СуммаЗаявки2_3]     [СуммаЗаявки2_3]
      ,[t3_Колво2_4]           [Колво2_4]
      ,[t3_СуммаЗаявки2_4]     [СуммаЗаявки2_4]
      ,[t3_Колво2_5]           [Колво2_5]
      ,[t3_СуммаЗаявки2_5]     [СуммаЗаявки2_5]

FROM [dbo].[dm_dashboard_ConmmonTable]
end

      
if @PageNo=4
begin
select
/*
       [t4_Таблица]                                     [Таблица]
      ,[t4_Колво]                                       [Колво]
      ,[t4_КолвоДеньВДень]                              [КолвоДеньВДень]
      ,[t4_Колво_7]                                     [Колво_7]
      ,[t4_Колво_ВхЗв]                                  [Колво_ВхЗв]
      ,[t4_КолвоДеньВДень_ВхЗв]                         [КолвоДеньВДень_ВхЗв]
      ,[t4_Колво_7_ВхЗв]                                [Колво_7_ВхЗв]
      ,[t4_Колво_Лид]                                   [Колво_Лид]
      ,[t4_КолвоДеньВДень_Лид]                          [КолвоДеньВДень_Лид]
      ,[t4_Колво_7_Лид]                                 [Колво_7_Лид]
      ,[t4_Колво_Заявка]                                [Колво_Заявка]
      ,[t4_КолвоДеньВДень_Заявка]                       [КолвоДеньВДень_Заявка]
      ,[t4_Колво_7_Заявка]                              [Колво_7_Заявка]
	  */
	  	

	 [t4_Таблица] 						[Таблица]
	,[t4_Колво] 						[Колво]
	,[t4_КолвоДеньВДень] 				[КолвоДеньВДень]
	,[t4_Колво_7] 						[Колво_7]
	,[t4_Колво_ВхЗв] 					[Колво_ВхЗв]
	,[t4_КолвоДеньВДень_ВхЗв] 			[КолвоДеньВДень_ВхЗв]
	,[t4_Колво_7_ВхЗв] 					[Колво_7_ВхЗв]
	,[t4_Колво_Лид] 					[Колво_Лид]
	,[t4_КолвоДеньВДень_Лид] 			[КолвоДеньВДень_Лид]
	,[t4_Колво_7_Лид] 					[Колво_7_Лид]
	,[t4_Колво_Лид_1] 					[Колво_Лид_1]
	,[t4_КолвоДеньВДень_Лид_1] 			[КолвоДеньВДень_Лид_1]
	,[t4_Колво_7_Лид_1] 				[Колво_7_Лид_1]
	,[t4_Колво_Лид_2] 					[Колво_Лид_2]
	,[t4_КолвоДеньВДень_Лид_2] 			[КолвоДеньВДень_Лид_2]
	,[t4_Колво_7_Лид_2] 				[Колво_7_Лид_2]
	,[t4_Колво_Лид_3] 					[Колво_Лид_3]
	,[t4_КолвоДеньВДень_Лид_3] 			[КолвоДеньВДень_Лид_3]
	,[t4_Колво_7_Лид_3] 				[Колво_7_Лид_3]
	,[t4_Колво_ВРаботу] 				[Колво_ВРаботу]
	,[t4_КолвоДеньВДень_ВРаботу] 		[КолвоДеньВДень_ВРаботу]
	,[t4_Колво_7_ВРаботу] 				[Колво_7_ВРаботу]
	,[t4_Колво_Дозвон] 					[Колво_Дозвон]
	,[t4_КолвоДеньВДень_Дозвон] 		[КолвоДеньВДень_Дозвон]
	,[t4_Колво_7_Дозвон] 				[Колво_7_Дозвон]
	,[t4_Колво_Профильность] 			[Колво_Профильность]
	,[t4_КолвоДеньВДень_Профильность] 	[КолвоДеньВДень_Профильность]
	,[t4_Колво_7_Профильность] 			[Колво_7_Профильность]
	,[t4_Колво_Заявка] 					[Колво_Заявка]
	,[t4_КолвоДеньВДень_Заявка] 		[КолвоДеньВДень_Заявка]
	,[t4_Колво_7_Заявка] 				[Колво_7_Заявка]
	,[t4_Колво_Заявка_1] 				[Колво_Заявка_1]
	,[t4_КолвоДеньВДень_Заявка_1] 		[КолвоДеньВДень_Заявка_1]
	,[t4_Колво_7_Заявка_1] 				[Колво_7_Заявка_1]
	,[t4_Колво_Заявка_2] 				[Колво_Заявка_2]
	,[t4_КолвоДеньВДень_Заявка_2] 		[КолвоДеньВДень_Заявка_2]
	,[t4_Колво_7_Заявка_2] 				[Колво_7_Заявка_2]
	,[t4_Колво_Заявка_3] 				[Колво_Заявка_3]
	,[t4_КолвоДеньВДень_Заявка_3] 		[КолвоДеньВДень_Заявка_3]
	,[t4_Колво_7_Заявка_3] 				[Колво_7_Заявка_3]
	,[t4_Колво_Заявка_4] 				[Колво_Заявка_4]
	,[t4_КолвоДеньВДень_Заявка_4] 		[КолвоДеньВДень_Заявка_4]
	,[t4_Колво_7_Заявка_4] 				[Колво_7_Заявка_4]
	,[t4_Колво_Заявка_5] 				[Колво_Заявка_5]
	,[t4_КолвоДеньВДень_Заявка_5] 		[КолвоДеньВДень_Заявка_5]
	,[t4_Колво_7_Заявка_5] 				[Колво_7_Заявка_5]
	,[t4_Колво_Заявка_6] 				[Колво_Заявка_6]
	,[t4_КолвоДеньВДень_Заявка_6] 		[КолвоДеньВДень_Заявка_6]
	,[t4_Колво_7_Заявка_6] 				[Колво_7_Заявка_6]

FROM [dbo].[dm_dashboard_ConmmonTable]


end

          

if @PageNo=5	-- ПЯТАЯ И ШЕСТАЯ таблица
begin  
 select       
       [t5_Таблица]                   [Таблица]
      ,[t5_КолвоПО]                   [КолвоПО]
      ,[t5_КолвоДеньВДеньПО]          [КолвоДеньВДеньПО]
      ,[t5_КолвоДеньВДень7ПО]         [КолвоДеньВДень7ПО]
      ,[t5_КолвоКД]                   [КолвоКД]
      ,[t5_КолвоДеньВДеньКД]          [КолвоДеньВДеньКД]
      ,[t5_КолвоДеньВДень7КД]         [КолвоДеньВДень7КД]
      ,[t5_КолвоВН]                   [КолвоВН]
      ,[t5_КолвоДеньВДеньВН]          [КолвоДеньВДеньВН]
      ,[t5_КолвоДеньВДень7ВН]         [КолвоДеньВДень7ВН]
      ,[t5_КолвоВНПарт]               [КолвоВНПарт]
      ,[t5_КолвоДеньВДеньВНПарт]      [КолвоДеньВДеньВНПарт]
      ,[t5_КолвоДеньВДень7ВНПарт]     [КолвоДеньВДень7ВНПарт]
      ,[t5_КолвоВНВМ]                 [КолвоВНВМ]
      ,[t5_КолвоДеньВДеньВНВМ]        [КолвоДеньВДеньВНВМ]
      ,[t5_КолвоДеньВДень7ВНВМ]       [КолвоДеньВДень7ВНВМ]
      ,[t5_КолвоВДК]                  [КолвоВДК]
      ,[t5_КолвоДеньВДеньВДК]         [КолвоДеньВДеньВДК]
      ,[t5_КолвоДеньВДень7ВДК]        [КолвоДеньВДень7ВДК]
      ,[t5_КолвоОДК]                  [КолвоОДК]
      ,[t5_КолвоДеньВДеньОДК]         [КолвоДеньВДеньОДК]
      ,[t5_КолвоДеньВДень7ОДК]        [КолвоДеньВДень7ОДК]
      ,[t5_КолвоВД]                   [КолвоВД]
      ,[t5_КолвоДеньВДеньВД]          [КолвоДеньВДеньВД]
      ,[t5_КолвоДеньВДень7ВД]         [КолвоДеньВДень7ВД]
      ,[t5_КолвоОд]                   [КолвоОд]
      ,[t5_КолвоДеньВДеньОд]          [КолвоДеньВДеньОд]
      ,[t5_КолвоДеньВДень7Од]         [КолвоДеньВДень7Од]
      ,[t5_КолвоДП]                   [КолвоДП]
      ,[t5_КолвоДеньВДеньДП]          [КолвоДеньВДеньДП]
      ,[t5_КолвоДеньВДень7ДП]         [КолвоДеньВДень7ДП]
      ,[t5_КолвоЗВ]                   [КолвоЗВ]
      ,[t5_КолвоДеньВДеньЗВ]          [КолвоДеньВДеньЗВ]
      ,[t5_КолвоДеньВДень7ЗВ]         [КолвоДеньВДень7ЗВ]

  FROM [dbo].[dm_dashboard_ConmmonTable]
end
         
if @PageNo=51	-- ПЯТЬ.ОДИН таблица
begin  
 select       
       [t51_Таблица]					[Таблица]
      ,[t51_КолвоПО]					[КолвоПО]
      ,[t51_КолвоДеньВДеньПО]			[КолвоДеньВДеньПО]
      ,[t51_КолвоДеньВДень7ПО]			[КолвоДеньВДень7ПО]
      ,[t51_КолвоКД]					[КолвоКД]
      ,[t51_КолвоДеньВДеньКД]			[КолвоДеньВДеньКД]
      ,[t51_КолвоДеньВДень7КД]			[КолвоДеньВДень7КД]
      ,[t51_КолвоВН]					[КолвоВН]
      ,[t51_КолвоДеньВДеньВН]			[КолвоДеньВДеньВН]
      ,[t51_КолвоДеньВДень7ВН]			[КолвоДеньВДень7ВН]
      ,[t51_КолвоВНПарт]				[КолвоВНПарт]
      ,[t51_КолвоДеньВДеньВНПарт]		[КолвоДеньВДеньВНПарт]
      ,[t51_КолвоДеньВДень7ВНПарт]      [КолвоДеньВДень7ВНПарт]
      ,[t51_КолвоВНВМ]					[КолвоВНВМ]
      ,[t51_КолвоДеньВДеньВНВМ]			[КолвоДеньВДеньВНВМ]
      ,[t51_КолвоДеньВДень7ВНВМ]		[КолвоДеньВДень7ВНВМ]
      ,[t51_КолвоВДК]					[КолвоВДК]
      ,[t51_КолвоДеньВДеньВДК]			[КолвоДеньВДеньВДК]
      ,[t51_КолвоДеньВДень7ВДК]			[КолвоДеньВДень7ВДК]
      ,[t51_КолвоОДК]					[КолвоОДК]
      ,[t51_КолвоДеньВДеньОДК]			[КолвоДеньВДеньОДК]
      ,[t51_КолвоДеньВДень7ОДК]			[КолвоДеньВДень7ОДК]
      ,[t51_КолвоВД]					[КолвоВД]
      ,[t51_КолвоДеньВДеньВД]			[КолвоДеньВДеньВД]
      ,[t51_КолвоДеньВДень7ВД]			[КолвоДеньВДень7ВД]
      ,[t51_КолвоОд]					[КолвоОд]
      ,[t51_КолвоДеньВДеньОд]			[КолвоДеньВДеньОд]
      ,[t51_КолвоДеньВДень7Од]			[КолвоДеньВДень7Од]
      ,[t51_КолвоДП]					[КолвоДП]
      ,[t51_КолвоДеньВДеньДП]			[КолвоДеньВДеньДП]
      ,[t51_КолвоДеньВДень7ДП]			[КолвоДеньВДень7ДП]
      ,[t51_КолвоДП_ПЭП]				[КолвоДП_ПЭП]
      ,[t51_КолвоДеньВДеньДП_ПЭП]		[КолвоДеньВДеньДП_ПЭП]
      ,[t51_КолвоДеньВДень7ДП_ПЭП]      [КолвоДеньВДень7ДП_ПЭП]
      ,[t51_КолвоДП_НЕ_ПЭП]				[КолвоДП_НЕ_ПЭП]
      ,[t51_КолвоДеньВДеньДП_НЕ_ПЭП]    [КолвоДеньВДеньДП_НЕ_ПЭП]
      ,[t51_КолвоДеньВДень7ДП_НЕ_ПЭП]   [КолвоДеньВДень7ДП_НЕ_ПЭП]
      ,[t51_КолвоЗВ]					[КолвоЗВ]
      ,[t51_КолвоДеньВДеньЗВ]			[КолвоДеньВДеньЗВ]
      ,[t51_КолвоДеньВДень7ЗВ]			[КолвоДеньВДень7ЗВ]
  FROM [dbo].[dm_dashboard_ConmmonTable]
end
     
END
