-- ============================================= 
-- Author: А. Никитин
-- Create date: 1.03.2023
-- Description: DWH-1962 Разработка отчета по действующим договорам
-- ============================================= 
CREATE   PROC dbo.Report_ActiveDeals
AS
BEGIN
SET NOCOUNT ON;
	DROP TABLE IF EXISTS #t_ActiveDeals
	CREATE TABLE #t_ActiveDeals(
		[Номер Договора] nvarchar(20),
		[ДоговорСсылка] binary(16),
		[Дата выдачи] datetime2(0),
		[Дата статуса] datetime2(0),
		[Статус договора] nvarchar(100),
		[ФИО] nvarchar(255),
		[Дата рождения] date, 
		[Серия и Номер паспорта] nvarchar(100),
		[Email] nvarchar(255),
		[Мобильный телефон] nvarchar(100)
	)
	INSERT #t_ActiveDeals
	(
	    [Номер Договора],
	    ДоговорСсылка,
	    [Дата выдачи],
	    [Дата статуса],
	    [Статус договора],
	    ФИО,
	    [Дата рождения],
	    [Серия и Номер паспорта],
	    Email,
	    [Мобильный телефон]
	)
	SELECT --TOP 100 -- для теста
		[Номер Договора] = D.Код,
		ДоговорСсылка = D.Ссылка,
		[Дата выдачи] = dateadd(YEAR, -2000, D.Дата),
		[Дата статуса] = dateadd(YEAR, -2000, RS.Период),
		[Статус договора] = S.Наименование,
	    ФИО = concat(C.Фамилия, ' ', C.Имя, ' ', C.Отчество),
	    [Дата рождения] = dateadd(YEAR, -2000, C.ДатаРождения),
	    [Серия и Номер паспорта] = concat(C.ПаспортСерия, ' ', C.ПаспортНомер),
	    Email = R.Email,
	    [Мобильный телефон] = C.Телефон
	FROM (
			SELECT 
				R.Договор,
				max_Период = max(R.Период)
			FROM Stg._1cCMR.РегистрСведений_СтатусыДоговоров AS R (NOLOCK)
			GROUP BY R.Договор
		) AS M
		INNER JOIN Stg._1cCMR.РегистрСведений_СтатусыДоговоров AS RS (NOLOCK)
			ON RS.Договор = M.Договор
			AND RS.Период = M.max_Период
		INNER JOIN Stg._1cCMR.Справочник_СтатусыДоговоров AS S (NOLOCK)
			ON S.Ссылка=RS.Статус
			AND S.Код IN (
				--'000000001', --	Зарегистрирован	registered
				'000000002', --	Действует	valid
				--'000000003', --	Погашен	repaid
				--'000000004', --	Legal	legal
				--'000000005', --	Аннулирован	cancelled
				--'000000006', --	Решение суда	judgement
				--'000000007', --	Приостановка начислений	delayCalculate
				--'000000008', --	Продан	soldOut
				'000000009', --	Проблемный	problem
				'000000010', --	Платеж опаздывает	latePayment
				'000000011' --	Просрочен	expired
				---'000000012' --	Внебаланс	offBalance
			)
		INNER JOIN Stg._1cCMR.Справочник_Договоры AS D (NOLOCK)
			ON D.Ссылка = RS.Договор
		LEFT JOIN Stg._1cCMR.Справочник_Клиенты AS C (NOLOCK)
			ON C.Ссылка = D.Клиент
		LEFT JOIN Stg._1cCMR.Справочник_Заявка AS R (NOLOCK)
			ON D.Заявка = R.Ссылка
	WHERE 1=1


	SELECT 
		D.[Номер Договора],
		--D.ДоговорСсылка,
		D.[Дата выдачи],
		--D.[Дата статуса],
		D.[Статус договора],
		D.ФИО,
		D.[Дата рождения],
		D.[Серия и Номер паспорта],
		D.Email,
		D.[Мобильный телефон]
	FROM #t_ActiveDeals AS D
	ORDER BY D.[Номер Договора]
END

