
-- =============================================
-- Author:		Курдин С.В.
-- Create date: 2019-05-20
-- Description:	Создание таблиц для отчета ДИНАМИКА РП из МФО
-- =============================================

CREATE PROCEDURE [dbo].[report_dm_RequestLoan_Regional_mfo]
	-- Add the parameters for the stored procedure here

AS
BEGIN  --auxtab_RequestMFO_1c

	SET NOCOUNT ON;

	--24.03.2020
	SET DATEFIRST 1;

--if OBJECT_ID('[dbo].[dm_RequestLoan_Regional]') is not null
--drop table [dbo].[dm_RequestLoan_Regional];
truncate table [dbo].[dm_RequestLoan_Regional];

---- Создание вспомогательной таблицы "Комментарии к заявке"
--create table [dbo].[dm_RequestLoan_Regional]
--(
--[НаименованиеПараметра] nvarchar(255) null
--,[Неделя] int  null
--,[Заявка] decimal(15,2) null
--,[Займ] decimal(15,2) null
--,[СуммаВыдачи] decimal(15,2) null
--,[ЮрЛицо] nvarchar(255) null
--,[Параметр5] nvarchar(255) null
--,[Параметр6] nvarchar(255) null
--,[Параметр7] nvarchar(255) null

--,[НаименованиеЛиста] nvarchar(255) null
--,[Сумма] decimal(15,2) null
--,[Год] int  null
--,[Докредитование] nvarchar(255) null
--,[Параметр8] nvarchar(255) null

--,[Регион] nvarchar(255) null

--,[Параметр9] nvarchar(255) null --,[ДопПараметр_1]
--,[ДатаЧислом] int  null --Дата отчета
--,[ПериодУчета] int null --

--,[Точка] nvarchar(255) null
--,[ПовторностьNew] nvarchar(255) null 
--,[Срок] int not null
--,[РОРегион] nvarchar(255) null
--,[Дивизион] nvarchar(255) null
--,[Параметр10] nvarchar(255) null  -- Исполнитель
--,[Параметр11] nvarchar(255) null --,[ДопПараметр_2]
--,[Параметр12] nvarchar(255) null  -- ВремяРассмотрения
--,[КредитныйПродукт] nvarchar(255)  null

--,[Параметр13] nvarchar(255) null  -- Отказ причина
--,[Параметр14] nvarchar(255) null  -- Отказ причина по коду
--,[Параметр15] nvarchar(255) null  -- Отказ по факторам

--,[ПериодичностьОтчета] nvarchar(255) null

--,[Дата] datetime null 
--,[Колво] decimal(15,2)  null
--,[ДатаОперации] datetime null 

--,[ДеньНедели] int  null
--,[ПервичнаяСумма] decimal(15,2)  null
--,[СуммаДопПродуктов] decimal(15,2)  null 
--,[КолвоДопПродуктов] decimal(15,2)  null 
--);

insert into [dbo].[dm_RequestLoan_Regional] ([НаименованиеПараметра] ,[Неделя] ,[Заявка] ,[Займ] ,[СуммаВыдачи] ,[ЮрЛицо]
																		,[Параметр5] ,[Параметр6] ,[Параметр7] ,[НаименованиеЛиста] ,[Сумма] 
																		,[Год] ,[Докредитование] ,[Параметр8] ,[Регион] ,[Параметр9] 
																		,[ДатаЧислом] ,[ПериодУчета] ,[Точка] ,[ПовторностьNew] ,[Срок] 
																		,[РОРегион] ,[Дивизион] ,[Параметр10] ,[Параметр11] ,[Параметр12] 
																		,[КредитныйПродукт]	,[Параметр13] ,[Параметр14] ,[Параметр15] ,[ПериодичностьОтчета] 
																		,[Дата] ,[Колво] ,[ДатаОперации] ,[ДеньНедели] ,[ПервичнаяСумма]
																		,[СуммаДопПродуктов] ,[КолвоДопПродуктов])



    -- Insert statements for procedure here
select [ЗаявкаНаименованиеПараметра] as [НаименованиеПараметра] ,datepart(wk,[ЗаявкаДатаОперации]) as [Неделя] 
		,[Колво] as [Заявка] ,0 as [Займ] ,0 as [СуммаВыдачи] ,[ЗаявкаАгент] as [ЮрЛицо] ,null as [Параметр5] ,null as [Параметр6] ,null as [Параметр7] 
		,N'ИТОГ_2_ЗАЯВКИ_по_каналам' as [НаименованиеЛиста] ,[СуммаЗаявки] as [Сумма] ,datepart(yy,[ЗаявкаДатаОперации]) as [Год] ,[Докредитование] ,null as [Параметр8] ,[ЗаявкаРегион] as [Регион] ,null as [Параметр9]
		,datediff(day,0,dateadd(day,datediff(day,0,Getdate()),-1))+2 as [ДатаЧислом] 
		,datediff(day,0,dateadd(day,datediff(day,0,[ЗаявкаПериодУчета]),0))+2 as [ПериодУчета] 
		,[ЗаявкаТочка] as [Точка] ,[ПовторностьNew] ,[ЗаявкаСрок] as [Срок] ,[ЗаявкаРОРегион] as [РОРегион] ,[ЗаявкаДивизион] as [Дивизион] ,null as [Параметр10] 
		,[ЗаявкаВыезднойМенеджер] as [Параметр11] ,null as [Параметр12]
		,[КредитныйПродукт]	
		,null as [Параметр13] ,null as [Параметр14] ,null as [Параметр15] ,N'Ежедневный' as [ПериодичностьОтчета] 
		,null as [Дата] ,[Колво] ,[ЗаявкаДатаОперации] as [ДатаОперации] ,datepart(dw,[ЗаявкаДатаОперации]) as [ДеньНедели]	,[ПервичнаяСумма]
		,[СуммаДопПродуктовЗаявка] as [СуммаДопПродуктов] ,[КолвоДопПродуктовЗаявка] as [КолвоДопПродуктов]

from [dwh_new].[dbo].[mt_requests_loans_mfo]
where [ЗаявкаПериодУчета]>=dateadd(month,-2,dateadd(MONTH,datediff(MONTH,0,Getdate()),0)) and [ЗаявкаДатаОперации]<dateadd(day,datediff(day,0,Getdate()),0)
		and [ЕстьОсновнаяЗаявка] is null and [ЗаявкаПризнакАннулирования]=N''

union all

select [ЗаявкаНаименованиеПараметра] as [НаименованиеПараметра] ,datepart(wk,[ДатаВыдачиДоговора]) as [Неделя] 
		,0 as [Заявка] ,[ДоговорКолво] as [Займ] ,[СуммаДоговора] as [СуммаВыдачи] ,[ДоговорАгентМФО] as [ЮрЛицо] ,null as [Параметр5] ,null as [Параметр6] ,null as [Параметр7] 
		,N'ИТОГ_2_ЗАЙМЫ_по_каналам' as [НаименованиеЛиста] ,[СуммаДоговора] as [Сумма] ,datepart(yy,[ДатаВыдачиДоговора]) as [Год] ,[Докредитование] ,null as [Параметр8] ,[ДоговорРегион] as [Регион] ,null as [Параметр9]
		,datediff(day,0,dateadd(day,datediff(day,0,Getdate()),-1))+2 as [ДатаЧислом] 
		,datediff(day,0,dateadd(day,datediff(day,0,[ПериодУчетаДоговор]),0))+2 as [ПериодУчета] 
		,[ДоговорТочка] as [Точка] ,[ПовторностьNew] ,[ДоговорСрок] as [Срок] ,[ДоговорРОРегион] as [РОРегион] ,[ДоговорДивизион] as [Дивизион] ,null as [Параметр10] 
		,[ДоговорВыезднойМенеджер] as [Параметр11] ,null as [Параметр12]
		,[ДоговорКредитныйПродукт] as [КредитныйПродукт]	
		,null as [Параметр13] ,null as [Параметр14] ,null as [Параметр15] ,N'Ежедневный' as [ПериодичностьОтчета] 
		,null as [Дата] ,[ДоговорКолво] as [Колво] ,[ДатаВыдачиДоговора] as [ДатаОперации] ,datepart(dw,[ДатаВыдачиДоговора]) as [ДеньНедели]	,[ПервичнаяСумма]
		,[ДоговорСуммаДопПродуктов] as [СуммаДопПродуктов] ,[ДоговорКолвоДопПродуктов] as [КолвоДопПродуктов]

from [dwh_new].[dbo].[mt_requests_loans_mfo]
where not [ДатаВыдачиДоговора] is null and [ПериодУчетаДоговор]>=dateadd(month,-2,dateadd(MONTH,datediff(MONTH,0,Getdate()),0))
		and [ДатаВыдачиДоговора]<dateadd(day,datediff(day,0,Getdate()),0)


--------------------------------------------------------------------
----------- Taблица для Центрального региона
--if OBJECT_ID('[dbo].[dm_reqloan_Central]') is not null
--drop table [dbo].[dm_reqloan_Central];

truncate table [dbo].[dm_reqloan_Central];

-- Создание вспомогательной таблицы "Комментарии к заявке"
--create table [dbo].[dm_reqloan_Central]
--(
--[НаименованиеПараметра] nvarchar(255) null
--,[Неделя] int  null
--,[Заявка] decimal(15,2) null
--,[Займ] decimal(15,2) null
--,[СуммаВыдачи] decimal(15,2) null
--,[ЮрЛицо] nvarchar(255) null
--,[Параметр5] nvarchar(255) null
--,[Параметр6] nvarchar(255) null
--,[Параметр7] nvarchar(255) null

--,[НаименованиеЛиста] nvarchar(255) null
--,[Сумма] decimal(15,2) null
--,[Год] int  null
--,[Докредитование] nvarchar(255) null
--,[Параметр8] nvarchar(255) null

--,[Регион] nvarchar(255) null

--,[Параметр9] nvarchar(255) null --,[ДопПараметр_1]
--,[ДатаЧислом] int  null --Дата отчета
--,[ПериодУчета] int null --

--,[Точка] nvarchar(255) null
--,[ПовторностьNew] nvarchar(255) null 
--,[Срок] int not null
--,[РОРегион] nvarchar(255) null
--,[Дивизион] nvarchar(255) null
--,[Параметр10] nvarchar(255) null  -- Исполнитель
--,[Параметр11] nvarchar(255) null --,[ДопПараметр_2]
--,[Параметр12] nvarchar(255) null  -- ВремяРассмотрения
--,[КредитныйПродукт] nvarchar(255)  null

--,[Параметр13] nvarchar(255) null  -- Отказ причина
--,[Параметр14] nvarchar(255) null  -- Отказ причина по коду
--,[Параметр15] nvarchar(255) null  -- Отказ по факторам

--,[ПериодичностьОтчета] nvarchar(255) null

--,[Дата] datetime null 
--,[Колво] decimal(15,2)  null
--,[ДатаОперации] datetime null 

--,[ДеньНедели] int  null
--,[ПервичнаяСумма] decimal(15,2)  null
--,[СуммаДопПродуктов] decimal(15,2)  null 
--,[КолвоДопПродуктов] decimal(15,2)  null 
--);
insert into [dbo].[dm_reqloan_Central] ([НаименованиеПараметра] ,[Неделя] ,[Заявка] ,[Займ] ,[СуммаВыдачи] ,[ЮрЛицо]
																		,[Параметр5] ,[Параметр6] ,[Параметр7] ,[НаименованиеЛиста] ,[Сумма] 
																		,[Год] ,[Докредитование] ,[Параметр8] ,[Регион] ,[Параметр9] 
																		,[ДатаЧислом] ,[ПериодУчета] ,[Точка] ,[ПовторностьNew] ,[Срок] 
																		,[РОРегион] ,[Дивизион] ,[Параметр10] ,[Параметр11] ,[Параметр12] 
																		,[КредитныйПродукт]	,[Параметр13] ,[Параметр14] ,[Параметр15] ,[ПериодичностьОтчета] 
																		,[Дата] ,[Колво] ,[ДатаОперации] ,[ДеньНедели] ,[ПервичнаяСумма]
																		,[СуммаДопПродуктов] ,[КолвоДопПродуктов])
select * from [dm_RequestLoan_Regional] where [РОРегион]=N'Центральный регион'


--------------------------------------------------------------------
----------- Taблица для Северо-Западного Региона
--if OBJECT_ID('[dbo].[dm_reqloan_NordWest]') is not null
--drop table [dbo].[dm_reqloan_NordWest];

truncate table [dbo].[dm_reqloan_NordWest];

---- 
--create table [dbo].[dm_reqloan_NordWest]
--(
--[НаименованиеПараметра] nvarchar(255) null
--,[Неделя] int  null
--,[Заявка] decimal(15,2) null
--,[Займ] decimal(15,2) null
--,[СуммаВыдачи] decimal(15,2) null
--,[ЮрЛицо] nvarchar(255) null
--,[Параметр5] nvarchar(255) null
--,[Параметр6] nvarchar(255) null
--,[Параметр7] nvarchar(255) null

--,[НаименованиеЛиста] nvarchar(255) null
--,[Сумма] decimal(15,2) null
--,[Год] int  null
--,[Докредитование] nvarchar(255) null
--,[Параметр8] nvarchar(255) null

--,[Регион] nvarchar(255) null

--,[Параметр9] nvarchar(255) null --,[ДопПараметр_1]
--,[ДатаЧислом] int  null --Дата отчета
--,[ПериодУчета] int null --

--,[Точка] nvarchar(255) null
--,[ПовторностьNew] nvarchar(255) null 
--,[Срок] int not null
--,[РОРегион] nvarchar(255) null
--,[Дивизион] nvarchar(255) null
--,[Параметр10] nvarchar(255) null  -- Исполнитель
--,[Параметр11] nvarchar(255) null --,[ДопПараметр_2]
--,[Параметр12] nvarchar(255) null  -- ВремяРассмотрения
--,[КредитныйПродукт] nvarchar(255)  null

--,[Параметр13] nvarchar(255) null  -- Отказ причина
--,[Параметр14] nvarchar(255) null  -- Отказ причина по коду
--,[Параметр15] nvarchar(255) null  -- Отказ по факторам

--,[ПериодичностьОтчета] nvarchar(255) null

--,[Дата] datetime null 
--,[Колво] decimal(15,2)  null
--,[ДатаОперации] datetime null 

--,[ДеньНедели] int  null
--,[ПервичнаяСумма] decimal(15,2)  null
--,[СуммаДопПродуктов] decimal(15,2)  null 
--,[КолвоДопПродуктов] decimal(15,2)  null 
--);
insert into [dbo].[dm_reqloan_NordWest] ([НаименованиеПараметра] ,[Неделя] ,[Заявка] ,[Займ] ,[СуммаВыдачи] ,[ЮрЛицо]
																		,[Параметр5] ,[Параметр6] ,[Параметр7] ,[НаименованиеЛиста] ,[Сумма] 
																		,[Год] ,[Докредитование] ,[Параметр8] ,[Регион] ,[Параметр9] 
																		,[ДатаЧислом] ,[ПериодУчета] ,[Точка] ,[ПовторностьNew] ,[Срок] 
																		,[РОРегион] ,[Дивизион] ,[Параметр10] ,[Параметр11] ,[Параметр12] 
																		,[КредитныйПродукт]	,[Параметр13] ,[Параметр14] ,[Параметр15] ,[ПериодичностьОтчета] 
																		,[Дата] ,[Колво] ,[ДатаОперации] ,[ДеньНедели] ,[ПервичнаяСумма]
																		,[СуммаДопПродуктов] ,[КолвоДопПродуктов])
select * from [dm_RequestLoan_Regional] where [РОРегион]=N'Северо-Западный регион'


--------------------------------------------------------------------
----------- Taблица для Поволжского Региона
--if OBJECT_ID('[dbo].[dm_reqloan_Povolzh]') is not null
--drop table [dbo].[dm_reqloan_Povolzh];

truncate table [dbo].[dm_reqloan_Povolzh];

--create table [dbo].[dm_reqloan_Povolzh]
--(
--[НаименованиеПараметра] nvarchar(255) null
--,[Неделя] int  null
--,[Заявка] decimal(15,2) null
--,[Займ] decimal(15,2) null
--,[СуммаВыдачи] decimal(15,2) null
--,[ЮрЛицо] nvarchar(255) null
--,[Параметр5] nvarchar(255) null
--,[Параметр6] nvarchar(255) null
--,[Параметр7] nvarchar(255) null

--,[НаименованиеЛиста] nvarchar(255) null
--,[Сумма] decimal(15,2) null
--,[Год] int  null
--,[Докредитование] nvarchar(255) null
--,[Параметр8] nvarchar(255) null

--,[Регион] nvarchar(255) null

--,[Параметр9] nvarchar(255) null --,[ДопПараметр_1]
--,[ДатаЧислом] int  null --Дата отчета
--,[ПериодУчета] int null --

--,[Точка] nvarchar(255) null
--,[ПовторностьNew] nvarchar(255) null 
--,[Срок] int not null
--,[РОРегион] nvarchar(255) null
--,[Дивизион] nvarchar(255) null
--,[Параметр10] nvarchar(255) null  -- Исполнитель
--,[Параметр11] nvarchar(255) null --,[ДопПараметр_2]
--,[Параметр12] nvarchar(255) null  -- ВремяРассмотрения
--,[КредитныйПродукт] nvarchar(255)  null

--,[Параметр13] nvarchar(255) null  -- Отказ причина
--,[Параметр14] nvarchar(255) null  -- Отказ причина по коду
--,[Параметр15] nvarchar(255) null  -- Отказ по факторам

--,[ПериодичностьОтчета] nvarchar(255) null

--,[Дата] datetime null 
--,[Колво] decimal(15,2)  null
--,[ДатаОперации] datetime null 

--,[ДеньНедели] int  null
--,[ПервичнаяСумма] decimal(15,2)  null
--,[СуммаДопПродуктов] decimal(15,2)  null 
--,[КолвоДопПродуктов] decimal(15,2)  null 
--);
insert into [dbo].[dm_reqloan_Povolzh] ([НаименованиеПараметра] ,[Неделя] ,[Заявка] ,[Займ] ,[СуммаВыдачи] ,[ЮрЛицо]
																		,[Параметр5] ,[Параметр6] ,[Параметр7] ,[НаименованиеЛиста] ,[Сумма] 
																		,[Год] ,[Докредитование] ,[Параметр8] ,[Регион] ,[Параметр9] 
																		,[ДатаЧислом] ,[ПериодУчета] ,[Точка] ,[ПовторностьNew] ,[Срок] 
																		,[РОРегион] ,[Дивизион] ,[Параметр10] ,[Параметр11] ,[Параметр12] 
																		,[КредитныйПродукт]	,[Параметр13] ,[Параметр14] ,[Параметр15] ,[ПериодичностьОтчета] 
																		,[Дата] ,[Колво] ,[ДатаОперации] ,[ДеньНедели] ,[ПервичнаяСумма]
																		,[СуммаДопПродуктов] ,[КолвоДопПродуктов])
select * from [dm_RequestLoan_Regional] where [РОРегион]=N'Поволжский регион'


--------------------------------------------------------------------
----------- Taблица для Южного Региона
--if OBJECT_ID('[dbo].[dm_reqloan_Southern]') is not null
--drop table [dbo].[dm_reqloan_Southern];

truncate table [dbo].[dm_reqloan_Southern];

---- Создание вспомогательной таблицы 
--create table [dbo].[dm_reqloan_Southern]
--(
--[НаименованиеПараметра] nvarchar(255) null
--,[Неделя] int  null
--,[Заявка] decimal(15,2) null
--,[Займ] decimal(15,2) null
--,[СуммаВыдачи] decimal(15,2) null
--,[ЮрЛицо] nvarchar(255) null
--,[Параметр5] nvarchar(255) null
--,[Параметр6] nvarchar(255) null
--,[Параметр7] nvarchar(255) null

--,[НаименованиеЛиста] nvarchar(255) null
--,[Сумма] decimal(15,2) null
--,[Год] int  null
--,[Докредитование] nvarchar(255) null
--,[Параметр8] nvarchar(255) null

--,[Регион] nvarchar(255) null

--,[Параметр9] nvarchar(255) null --,[ДопПараметр_1]
--,[ДатаЧислом] int  null --Дата отчета
--,[ПериодУчета] int null --

--,[Точка] nvarchar(255) null
--,[ПовторностьNew] nvarchar(255) null 
--,[Срок] int not null
--,[РОРегион] nvarchar(255) null
--,[Дивизион] nvarchar(255) null
--,[Параметр10] nvarchar(255) null  -- Исполнитель
--,[Параметр11] nvarchar(255) null --,[ДопПараметр_2]
--,[Параметр12] nvarchar(255) null  -- ВремяРассмотрения
--,[КредитныйПродукт] nvarchar(255)  null

--,[Параметр13] nvarchar(255) null  -- Отказ причина
--,[Параметр14] nvarchar(255) null  -- Отказ причина по коду
--,[Параметр15] nvarchar(255) null  -- Отказ по факторам

--,[ПериодичностьОтчета] nvarchar(255) null

--,[Дата] datetime null 
--,[Колво] decimal(15,2)  null
--,[ДатаОперации] datetime null 

--,[ДеньНедели] int  null
--,[ПервичнаяСумма] decimal(15,2)  null
--,[СуммаДопПродуктов] decimal(15,2)  null 
--,[КолвоДопПродуктов] decimal(15,2)  null 
--);
insert into [dbo].[dm_reqloan_Southern] ([НаименованиеПараметра] ,[Неделя] ,[Заявка] ,[Займ] ,[СуммаВыдачи] ,[ЮрЛицо]
																		,[Параметр5] ,[Параметр6] ,[Параметр7] ,[НаименованиеЛиста] ,[Сумма] 
																		,[Год] ,[Докредитование] ,[Параметр8] ,[Регион] ,[Параметр9] 
																		,[ДатаЧислом] ,[ПериодУчета] ,[Точка] ,[ПовторностьNew] ,[Срок] 
																		,[РОРегион] ,[Дивизион] ,[Параметр10] ,[Параметр11] ,[Параметр12] 
																		,[КредитныйПродукт]	,[Параметр13] ,[Параметр14] ,[Параметр15] ,[ПериодичностьОтчета] 
																		,[Дата] ,[Колво] ,[ДатаОперации] ,[ДеньНедели] ,[ПервичнаяСумма]
																		,[СуммаДопПродуктов] ,[КолвоДопПродуктов])
select * from [dm_RequestLoan_Regional] where [РОРегион]=N'Южный регион'


--------------------------------------------------------------------
----------- Taблица для Уральского и Сибирского Региона
--if OBJECT_ID('[dbo].[dm_reqloan_UralSib]') is not null
--drop table [dbo].[dm_reqloan_UraiSib];

truncate table [dbo].[dm_reqloan_UralSib];

---- Создание вспомогательной таблицы "Комментарии к заявке"
--create table [dbo].[dm_reqloan_UralSib]
--(
--[НаименованиеПараметра] nvarchar(255) null
--,[Неделя] int  null
--,[Заявка] decimal(15,2) null
--,[Займ] decimal(15,2) null
--,[СуммаВыдачи] decimal(15,2) null
--,[ЮрЛицо] nvarchar(255) null
--,[Параметр5] nvarchar(255) null
--,[Параметр6] nvarchar(255) null
--,[Параметр7] nvarchar(255) null

--,[НаименованиеЛиста] nvarchar(255) null
--,[Сумма] decimal(15,2) null
--,[Год] int  null
--,[Докредитование] nvarchar(255) null
--,[Параметр8] nvarchar(255) null

--,[Регион] nvarchar(255) null

--,[Параметр9] nvarchar(255) null --,[ДопПараметр_1]
--,[ДатаЧислом] int  null --Дата отчета
--,[ПериодУчета] int null --

--,[Точка] nvarchar(255) null
--,[ПовторностьNew] nvarchar(255) null 
--,[Срок] int not null
--,[РОРегион] nvarchar(255) null
--,[Дивизион] nvarchar(255) null
--,[Параметр10] nvarchar(255) null  -- Исполнитель
--,[Параметр11] nvarchar(255) null --,[ДопПараметр_2]
--,[Параметр12] nvarchar(255) null  -- ВремяРассмотрения
--,[КредитныйПродукт] nvarchar(255)  null

--,[Параметр13] nvarchar(255) null  -- Отказ причина
--,[Параметр14] nvarchar(255) null  -- Отказ причина по коду
--,[Параметр15] nvarchar(255) null  -- Отказ по факторам

--,[ПериодичностьОтчета] nvarchar(255) null

--,[Дата] datetime null 
--,[Колво] decimal(15,2)  null
--,[ДатаОперации] datetime null 

--,[ДеньНедели] int  null
--,[ПервичнаяСумма] decimal(15,2)  null
--,[СуммаДопПродуктов] decimal(15,2)  null 
--,[КолвоДопПродуктов] decimal(15,2)  null 
--);
insert into [dbo].[dm_reqloan_UralSib] ([НаименованиеПараметра] ,[Неделя] ,[Заявка] ,[Займ] ,[СуммаВыдачи] ,[ЮрЛицо]
																		,[Параметр5] ,[Параметр6] ,[Параметр7] ,[НаименованиеЛиста] ,[Сумма] 
																		,[Год] ,[Докредитование] ,[Параметр8] ,[Регион] ,[Параметр9] 
																		,[ДатаЧислом] ,[ПериодУчета] ,[Точка] ,[ПовторностьNew] ,[Срок] 
																		,[РОРегион] ,[Дивизион] ,[Параметр10] ,[Параметр11] ,[Параметр12] 
																		,[КредитныйПродукт]	,[Параметр13] ,[Параметр14] ,[Параметр15] ,[ПериодичностьОтчета] 
																		,[Дата] ,[Колво] ,[ДатаОперации] ,[ДеньНедели] ,[ПервичнаяСумма]
																		,[СуммаДопПродуктов] ,[КолвоДопПродуктов])
select * from [dm_RequestLoan_Regional] where [РОРегион]=N'Уральский и Сибирский регион'


END
