
--exec [risk].[etl_reg_report_kp_for_cbr] '20220930';
--exec [risk].[etl_reg_report_kp_for_cbr] '20220831';
--exec [risk].[etl_reg_report_kp_for_cbr] '20221031';
--exec [risk].[etl_reg_report_kp_for_cbr] '20221130';
--exec [risk].[etl_reg_report_kp_for_cbr] '20221231';
--exec [risk].[etl_reg_report_kp_for_cbr] '20230131';
--exec [risk].[etl_reg_report_kp_for_cbr] '20230131';
--exec [risk].[etl_reg_report_kp_for_cbr] '20230131';
--exec [risk].[etl_reg_report_kp_for_cbr] '20230228';
--exec [risk].[etl_reg_report_kp_for_cbr] '20230331';
--exec [risk].[etl_reg_report_kp_for_cbr] '20230731';
--exec [risk].[etl_reg_report_kp_for_cbr] '20230831';
--exec [risk].[etl_reg_report_kp_for_cbr] '20230930';
--exec [risk].[etl_reg_report_kp_for_cbr] '20240131';
--exec [risk].[etl_reg_report_kp_for_cbr] '20241031';


CREATE PROCEDURE [risk].[etl_reg_report_kp_for_cbr] @repdt NCHAR(100)

AS
BEGIN
begin try
	
	DROP TABLE IF EXISTS ##stg_REG_REPORT_KP_FOR_CBR; -- risk.stg_REG_REPORT_KP_FOR_CBR

		EXEC (
				' 
	select * into ##stg_REG_REPORT_KP_FOR_CBR 
		FROM stg.files.отчет_КП_для_ЦБ_' + @repdt
				);
begin tran

	DELETE
	FROM risk.REG_REPORT_KP_FOR_CBR
	WHERE r_date = cast(@repdt AS DATE);
	
	INSERT INTO risk.REG_REPORT_KP_FOR_CBR
	SELECT cast(@repdt AS DATE) AS r_date
		,a.[№ п/п]
		,a.[Контрагент]
		,a.[Признак заемщика]
		,a.[Банкротство]
		,a.[МСП]
		,a.[Паспортные данные]
		,a.[Дата рождения]
		,a.[Адрес для расчет ПДН]
		,a.[Адрес проживания]
		,a.[Адрес регистрации]
		,a.[Финансовый продукт]
		,a.[Номер договора]
		,a.[Дата договора]
		,a.[Дата выдачи]
		,a.[Способ выдачи займа]
		,a.[Цессия (проданные займы)]
		,a.[Дата погашения]
		,a.[Дата погашения с учетом ДС]
		,a.[Дата окончания по КК]
		,a.[Срок договора в месяцах]
		,a.[Сумма займа]
		,a.[Наличие залога поручительства]
		,a.[Номер договора залога]
		,a.[Дата договора залога]
		,a.[Транспортное средство vin]
		,a.[Vin в договоре]
		,a.[Дата переоценки]
		,a.[Докредитование]
		,a.[Залоговая стоимость]
		,a.[Залоговая стоимость распределение]
		,a.[Справедливая стоимость]
		,a.[Справедливая стоимость распределенная по vin]
		,a.[ПДН на дату выдачи (НЕ для ЦБ)]
		,a.[Среднемесячный доход]
		,a.[Первичная сумма]
		,a.[Рефинансирование]
		,a.[Реструктуризирован]
		,a.[Реструктуризирован номер]
		,a.[Реструктуризирован дата]
		,a.[Реструктуризирован дата окончания]
		,a.[Реструктуризирован срок]
		,a.[Дата первой просрочки]
		,a.[Задолженность ОД]
		,a.[Задолженность проценты]
		,a.[Сумма пени счета]
		,a.[Сумма просрочки основной долг]
		,a.[Сумма просрочки проценты]
		,a.[Дней просрочки]
		,a.[Историческая просрочка]
		,a.[Итого дней просрочки общая]
		,a.[Максимальный срок просрочки по одному заемщику]
		,a.[Процент резерва ОД]
		,a.[Резерв ОД]
		,a.[Процент резерва проценты]
		,a.[Резерв проценты]
		,a.[Состояние]
		,a.[Дней просрочки1]
		,a.[Процент резерва ОД1]
		,a.[Процент резерва проценты1]
		,a.[Сумма резерв прочие НУ]
		,a.[Сумма резерва БУ ОД]
		----- v2
		,a.[Сумма резерва БУ проценты]
		,a.[Сумма резерва БУ пени и госпошлины]
		----- v2/
		,a.[Вид ДС]
		,a.[Ставка на дату выдачи]
		,a.[Ставка на дату формирования отчета]
		,a.[ПСК]
		,a.[Обеспеченный займ]
		,a.[ПДН текущий]
		,a.[Наличие просрочки]
		,a.[Счет учета основного долга]
		,a.[Счет учета начисления процентов]
		,a.[Счет учета обеспечения]
		,a.[Подразделение организации]
		,a.[Адрес подразделения]
		,a.[Контрагент код]
		,a.[ИНН]
		,a.[Дней просрочки за последний год]
		,a.[Дата закрыт]
		,a.[Номенклатурная группа]
		,a.[Дата последнего платежа по ОД]
		,a.[Сумма последнего платежа по ОД]
		,a.[Справедливая стоимость проверка обеспеченности]
		,a.[created]
		-- начало англ слона --
		,a.[Номер договора] AS external_id
		,a.[Контрагент] AS cli_name
		,a.[Признак заемщика] AS cli_type
		,a.[Номенклатурная группа] AS product_group
		,cast(replace(a.[Ставка на дату выдачи],',','') AS FLOAT) / 100 AS int_rate_iss
		,cast(a.[Ставка на дату формирования отчета] AS FLOAT) / 100 AS int_rate_cur
		,cast(replace(a.[ПСК],',','') AS FLOAT) / 100 AS int_rate_psk
		,cast(replace(a.[ПДН текущий],',','') AS FLOAT) AS pdn_curr
		-- просрочки счетчики
		,isnull(cast(replace(a.[Дней просрочки],',','') AS FLOAT), 0) AS dpd
		,isnull(cast(replace(a.[Историческая просрочка],',','') AS FLOAT), 0) AS dpd_hist
		,isnull(cast(replace(a.[Итого дней просрочки общая],',','') AS FLOAT), 0) AS dpd_prov
		,a.[Транспортное средство vin] AS vin
		,a.[Vin в договоре] AS vin_distrib
		-- флаги
		,CASE 
			WHEN a.[Признак заемщика] = 'ФЛ'
				THEN 1
			END AS flag_fl
		,CASE 
			WHEN a.Банкротство = 'Да'
				THEN 1
			END AS flag_bnkr
		,CASE 
			WHEN a.МСП = 'Да'
				THEN 1
			END AS flag_msp
		,CASE 
			WHEN a.[Реструктуризирован] = 'Да'
				THEN 1
			END AS flag_restruct
		,CASE 
			WHEN a.[Обеспеченный займ] = 'Да'
				THEN 1
			END AS flag_collateralized
		-- остатки 
		-- баланс
		,isnull(cast(replace(a.[Задолженность ОД],',','') AS FLOAT), 0) AS principal_rest
		,isnull(cast(replace(a.[Задолженность проценты],',','') AS FLOAT), 0) AS percents_rest
		,isnull(cast(replace(a.[Сумма пени счета],',','') AS FLOAT), 0) AS others_rest
		,isnull(cast(replace(a.[Задолженность ОД],',','') AS FLOAT), 0) 
			+ isnull(cast(replace(a.[Задолженность проценты],',','') AS FLOAT), 0)
			+ isnull(cast(replace(a.[Сумма пени счета],',','') AS FLOAT), 0) AS gross_rest
		-- резервы
		,isnull(cast(replace(a.[Резерв ОД],',','') AS FLOAT), 0) 
			+ isnull(cast(replace(a.[Резерв проценты],',','') AS FLOAT), 0)
			+ isnull(cast(replace(a.[Сумма резерв прочие НУ],',','') AS FLOAT), 0) AS prov_nu_gross
		
		
		,isnull(cast(replace(a.[Сумма резерва БУ ОД],',','') AS FLOAT), 0)
		--v2
			+isnull(cast(replace(a.[Сумма резерва БУ проценты],',','') AS FLOAT), 0)
			+isnull(cast(replace(a.[Сумма резерва БУ пени и госпошлины],',','') AS FLOAT), 0) 
		--v2/
			AS prov_bu_gross
		--
		,cast(isnull(replace(a.[Процент резерва ОД],',',''), 0) AS FLOAT) / 100 AS prov_rate_nu
		,round(CASE 
				WHEN (isnull(cast(replace(a.[Задолженность ОД],',','') AS FLOAT), 0) 
						+ isnull(cast(replace(a.[Задолженность проценты],',','') AS FLOAT), 0)
						+ isnull(cast(replace(a.[Сумма пени счета],',','') AS FLOAT), 0)) > 0
					THEN (isnull(cast(replace(a.[Сумма резерва БУ ОД],',','') AS FLOAT), 0)+
					--v2
			isnull(cast(replace(a.[Сумма резерва БУ проценты],',','') AS FLOAT), 0)+
			isnull(cast(replace(a.[Сумма резерва БУ пени и госпошлины],',','') AS FLOAT), 0)
			--v2/
			)/ (isnull(cast(replace(a.[Задолженность ОД],',','') AS FLOAT), 0) 
					+ isnull(cast(replace(a.[Задолженность проценты],',','') AS FLOAT), 0) 
					+ isnull(cast(replace(a.[Сумма пени счета],',','') AS FLOAT), 0))
				ELSE 0
				END, 6) AS prov_rate_bu
		--обеспечение
		,isnull(cast(replace(a.[Залоговая стоимость],',','') AS FLOAT), 0) AS collateral_value
		,isnull(cast(replace(a.[Залоговая стоимость распределение],',','') AS FLOAT), 0) collateral_value_distrib
		,isnull(cast(replace(a.[Справедливая стоимость],',','') AS FLOAT), 0) fair_value
		,isnull(cast(replace(a.[Справедливая стоимость распределенная по vin],',','') AS FLOAT), 0) fair_value_distrib
		,isnull(cast(replace(a.[Справедливая стоимость проверка обеспеченности],',','') as float),0) fair_value_distrib_gross
		,getdate() as dt_dml
	--FROM risk.stg_REG_REPORT_KP_FOR_CBR a
	from ##stg_REG_REPORT_KP_FOR_CBR a
	drop table if exists ##stg_REG_REPORT_KP_FOR_CBR

commit tran
end try
begin catch
	if @@TRANCOUNT>0
		rollback tran
	;throw
end catch
END;



-- до 05_09_2024 
--INSERT INTO risk.REG_REPORT_KP_FOR_CBR
--	SELECT cast(@repdt AS DATE) AS r_date
--		,a.[№ п/п]
--		,a.[Контрагент]
--		,a.[Признак заемщика]
--		,a.[Банкротство]
--		,a.[МСП]
--		,a.[Паспортные данные]
--		,a.[Дата рождения]
--		,a.[Адрес для расчет ПДН]
--		,a.[Адрес проживания]
--		,a.[Адрес регистрации]
--		,a.[Финансовый продукт]
--		,a.[Номер договора]
--		,a.[Дата договора]
--		,a.[Дата выдачи]
--		,a.[Способ выдачи займа]
--		,a.[Цессия (проданные займы)]
--		,a.[Дата погашения]
--		,a.[Дата погашения с учетом ДС]
--		,a.[Дата окончания по КК]
--		,a.[Срок договора в месяцах]
--		,a.[Сумма займа]
--		,a.[Наличие залога поручительства]
--		,a.[Номер договора залога]
--		,a.[Дата договора залога]
--		,a.[Транспортное средство vin]
--		,a.[Vin в договоре]
--		,a.[Дата переоценки]
--		,a.[Докредитование]
--		,a.[Залоговая стоимость]
--		,a.[Залоговая стоимость распределение]
--		,a.[Справедливая стоимость]
--		,a.[Справедливая стоимость распределенная по vin]
--		,a.[ПДН на дату выдачи]
--		,a.[Среднемесячный доход]
--		,a.[Первичная сумма]
--		,a.[Рефинансирование]
--		,a.[Реструктуризирован]
--		,a.[Реструктуризирован номер]
--		,a.[Реструктуризирован дата]
--		,a.[Реструктуризирован дата окончания]
--		,a.[Реструктуризирован срок]
--		,a.[Дата первой просрочки]
--		,a.[Задолженность ОД]
--		,a.[Задолженность проценты]
--		,a.[Сумма пени счета]
--		,a.[Сумма просрочки основной долг]
--		,a.[Сумма просрочки проценты]
--		,a.[Дней просрочки]
--		,a.[Историческая просрочка]
--		,a.[Итого дней просрочки общая]
--		,a.[Максимальный срок просрочки по одному заемщику]
--		,a.[Процент резерва ОД]
--		,a.[Резерв ОД]
--		,a.[Процент резерва проценты]
--		,a.[Резерв проценты]
--		,a.[Состояние]
--		,a.[Дней просрочки1]
--		,a.[Процент резерва ОД1]
--		,a.[Процент резерва проценты1]
--		,a.[Сумма резерв прочие НУ]
--		,a.[Сумма резерва БУ ОД]
--		----- v2
--		,a.[Сумма резерва БУ проценты]
--		,a.[Сумма резерва БУ пени и госпошлины]
--		----- v2/
--		,a.[Вид ДС]
--		,a.[Ставка на дату выдачи]
--		,a.[Ставка на дату формирования отчета]
--		,a.[ПСК]
--		,a.[Обеспеченный займ]
--		,a.[ПДН текущий]
--		,a.[Наличие просрочки]
--		,a.[Счет учета основного долга]
--		,a.[Счет учета начисления процентов]
--		,a.[Счет учета обеспечения]
--		,a.[Подразделение организации]
--		,a.[Адрес подразделения]
--		,a.[Контрагент код]
--		,a.[ИНН]
--		,a.[Дней просрочки за последний год]
--		,a.[Дата закрыт]
--		,a.[Номенклатурная группа]
--		,a.[Дата последнего платежа по ОД]
--		,a.[Сумма последнего платежа по ОД]
--		,a.[Справедливая стоимость проверка обеспеченности]
--		,a.[created]
--		-- начало англ слона --
--		,a.[Номер договора] AS external_id
--		,a.[Контрагент] AS cli_name
--		,a.[Признак заемщика] AS cli_type
--		,a.[Номенклатурная группа] AS product_group
--		,cast(replace(a.[Ставка на дату выдачи],',','') AS FLOAT) / 100 AS int_rate_iss
--		,cast(a.[Ставка на дату формирования отчета] AS FLOAT) / 100 AS int_rate_cur
--		,cast(replace(a.[ПСК],',','') AS FLOAT) / 100 AS int_rate_psk
--		,cast(replace(a.[ПДН текущий],',','') AS FLOAT) AS pdn_curr
--		-- просрочки счетчики
--		,isnull(cast(replace(a.[Дней просрочки],',','') AS FLOAT), 0) AS dpd
--		,isnull(cast(replace(a.[Историческая просрочка],',','') AS FLOAT), 0) AS dpd_hist
--		,isnull(cast(replace(a.[Итого дней просрочки общая],',','') AS FLOAT), 0) AS dpd_prov
--		,a.[Транспортное средство vin] AS vin
--		,a.[Vin в договоре] AS vin_distrib
--		-- флаги
--		,CASE 
--			WHEN a.[Признак заемщика] = 'ФЛ'
--				THEN 1
--			END AS flag_fl
--		,CASE 
--			WHEN a.Банкротство = 'Да'
--				THEN 1
--			END AS flag_bnkr
--		,CASE 
--			WHEN a.МСП = 'Да'
--				THEN 1
--			END AS flag_msp
--		,CASE 
--			WHEN a.[Реструктуризирован] = 'Да'
--				THEN 1
--			END AS flag_restruct
--		,CASE 
--			WHEN a.[Обеспеченный займ] = 'Да'
--				THEN 1
--			END AS flag_collateralized
--		-- остатки 
--		-- баланс
--		,isnull(cast(replace(a.[Задолженность ОД],',','') AS FLOAT), 0) AS principal_rest
--		,isnull(cast(replace(a.[Задолженность проценты],',','') AS FLOAT), 0) AS percents_rest
--		,isnull(cast(replace(a.[Сумма пени счета],',','') AS FLOAT), 0) AS others_rest
--		,isnull(cast(replace(a.[Задолженность ОД],',','') AS FLOAT), 0) 
--			+ isnull(cast(replace(a.[Задолженность проценты],',','') AS FLOAT), 0)
--			+ isnull(cast(replace(a.[Сумма пени счета],',','') AS FLOAT), 0) AS gross_rest
--		-- резервы
--		,isnull(cast(replace(a.[Резерв ОД],',','') AS FLOAT), 0) 
--			+ isnull(cast(replace(a.[Резерв проценты],',','') AS FLOAT), 0)
--			+ isnull(cast(replace(a.[Сумма резерв прочие НУ],',','') AS FLOAT), 0) AS prov_nu_gross
		
		
--		,isnull(cast(replace(a.[Сумма резерва БУ ОД],',','') AS FLOAT), 0)
--		--v2
--			+isnull(cast(replace(a.[Сумма резерва БУ проценты],',','') AS FLOAT), 0)
--			+isnull(cast(replace(a.[Сумма резерва БУ пени и госпошлины],',','') AS FLOAT), 0) 
--		--v2/
--			AS prov_bu_gross
--		--
--		,cast(isnull(replace(a.[Процент резерва ОД],',',''), 0) AS FLOAT) / 100 AS prov_rate_nu
--		,round(CASE 
--				WHEN (isnull(cast(replace(a.[Задолженность ОД],',','') AS FLOAT), 0) 
--						+ isnull(cast(replace(a.[Задолженность проценты],',','') AS FLOAT), 0)
--						+ isnull(cast(replace(a.[Сумма пени счета],',','') AS FLOAT), 0)) > 0
--					THEN (isnull(cast(replace(a.[Сумма резерва БУ ОД],',','') AS FLOAT), 0)+
--					--v2
--			isnull(cast(replace(a.[Сумма резерва БУ проценты],',','') AS FLOAT), 0)+
--			isnull(cast(replace(a.[Сумма резерва БУ пени и госпошлины],',','') AS FLOAT), 0)
--			--v2/
--			)/ (isnull(cast(replace(a.[Задолженность ОД],',','') AS FLOAT), 0) 
--					+ isnull(cast(replace(a.[Задолженность проценты],',','') AS FLOAT), 0) 
--					+ isnull(cast(replace(a.[Сумма пени счета],',','') AS FLOAT), 0))
--				ELSE 0
--				END, 6) AS prov_rate_bu
--		--обеспечение
--		,isnull(cast(replace(a.[Залоговая стоимость],',','') AS FLOAT), 0) AS collateral_value
--		,isnull(cast(replace(a.[Залоговая стоимость распределение],',','') AS FLOAT), 0) collateral_value_distrib
--		,isnull(cast(replace(a.[Справедливая стоимость],',','') AS FLOAT), 0) fair_value
--		,isnull(cast(replace(a.[Справедливая стоимость распределенная по vin],',','') AS FLOAT), 0) fair_value_distrib
--		,isnull(cast(replace(a.[Справедливая стоимость проверка обеспеченности],',','') as float),0) fair_value_distrib_gross
--		,getdate() as dt_dml
--	FROM risk.stg_REG_REPORT_KP_FOR_CBR a

--END;



--insert into risk.REG_REPORT_KP_FOR_CBR_NEW
--([r_date]
--,[№ п/п]
--,[Контрагент]
--,[Признак заемщика]
--,[Банкротство]
--,[МСП]
--,[Паспортные данные]
--,[Дата рождения]
--,[Адрес для расчет ПДН]
--,[Адрес проживания]
--,[Адрес регистрации]
--,[Финансовый продукт]
--,[Номер договора]
--,[Дата договора]
--,[Дата выдачи]
--,[Способ выдачи займа]
--,[Цессия (проданные займы)]
--,[Дата погашения]
--,[Дата погашения с учетом ДС]
--,[Дата окончания по КК]
--,[Срок договора в месяцах]
--,[Сумма займа]
--,[Наличие залога поручительства]
--,[Номер договора залога]
--,[Дата договора залога]
--,[Транспортное средство vin]
--,[Vin в договоре]
--,[Дата переоценки]
--,[Докредитование]
--,[Залоговая стоимость]
--,[Залоговая стоимость распределение]
--,[Справедливая стоимость]
--,[Справедливая стоимость распределенная по vin]
--,[ПДН на дату выдачи]
--,[Среднемесячный доход]
--,[Первичная сумма]
--,[Рефинансирование]
--,[Реструктуризирован]
--,[Реструктуризирован номер]
--,[Реструктуризирован дата]
--,[Реструктуризирован дата окончания]
--,[Реструктуризирован срок]
--,[Дата первой просрочки]
--,[Задолженность ОД]
--,[Задолженность проценты]
--,[Сумма пени счета]
--,[Сумма просрочки основной долг]
--,[Сумма просрочки проценты]
--,[Дней просрочки]
--,[Историческая просрочка]
--,[Итого дней просрочки общая]
--,[Максимальный срок просрочки по одному заемщику]
--,[Процент резерва ОД]
--,[Резерв ОД]
--,[Процент резерва проценты]
--,[Резерв проценты]
--,[Состояние]
--,[Дней просрочки1]
--,[Процент резерва ОД1]
--,[Процент резерва проценты1]
--,[Сумма резерв прочие НУ]
--,[Сумма резерва БУ ОД]
--,[Вид ДС]
--,[Ставка на дату выдачи]
--,[Ставка на дату формирования отчета]
--,[ПСК]
--,[Обеспеченный займ]
--,[ПДН текущий]
--,[Наличие просрочки]
--,[Счет учета основного долга]
--,[Счет учета начисления процентов]
--,[Счет учета обеспечения]
--,[Подразделение организации]
--,[Адрес подразделения]
--,[Контрагент код]
--,[ИНН]
--,[Дней просрочки за последний год]
--,[Дата закрыт]
--,[Номенклатурная группа]
--,[Дата последнего платежа по ОД]
--,[Сумма последнего платежа по ОД]
--,[Справедливая стоимость проверка обеспеченности]
--,[created]
--,[external_id]
--,[cli_name]
--,[cli_type]
--,[product_group]
--,[int_rate_iss]
--,[int_rate_cur]
--,[int_rate_psk]
--,[pdn_curr]
--,[dpd]
--,[dpd_hist]
--,[dpd_prov]
--,[vin]
--,[vin_distrib]
--,[flag_fl]
--,[flag_bnkr]
--,[flag_msp]
--,[flag_restruct]
--,[flag_collateralized]
--,[principal_rest]
--,[percents_rest]
--,[others_rest]
--,[gross_rest]
--,[prov_nu_gross]
--,[prov_bu_gross]
--,[prov_rate_nu]
--,[prov_rate_bu]
--,[collateral_value]
--,[collateral_value_distrib]
--,[fair_value]
--,[fair_value_distrib]
--,[fair_value_distrib_gross]
--,[dt_dml])
--select [r_date]
--,[№ п/п]
--,[Контрагент]
--,[Признак заемщика]
--,[Банкротство]
--,[МСП]
--,[Паспортные данные]
--,[Дата рождения]
--,[Адрес для расчет ПДН]
--,[Адрес проживания]
--,[Адрес регистрации]
--,[Финансовый продукт]
--,[Номер договора]
--,[Дата договора]
--,[Дата выдачи]
--,[Способ выдачи займа]
--,[Цессия (проданные займы)]
--,[Дата погашения]
--,[Дата погашения с учетом ДС]
--,[Дата окончания по КК]
--,[Срок договора]
--,[Сумма займа]
--,[Наличие залога поручительства]
--,[Номер договора залога]
--,[Дата договора залога]
--,[Транспортное средство vin]
--,[Vin в договоре]
--,[Дата переоценки]
--,[Докредитование]
--,[Залоговая стоимость]
--,[Залоговая стоимость распределение]
--,[Справедливая стоимость]
--,[Справедливая стоимость распределенная по vin]
--,[ПДН на дату выдачи]
--,[Среднемесячный доход]
--,[Первичная сумма]
--,[Рефинансирование]
--,[Реструктуризирован]
--,[Реструктуризирован номер]
--,[Реструктуризирован дата]
--,[Реструктуризирован дата окончания]
--,[Реструктуризирован срок]
--,[Дата первой просрочки]
--,[Задолженность ОД]
--,[Задолженность проценты]
--,[Сумма пени счета]
--,[Сумма просрочки основной долг]
--,[Сумма просрочки проценты]
--,[Дней просрочки]
--,[Историческая просрочка]
--,[Итого дней просрочки общая]
--,[Максимальный срок просрочки по одному заемщику]
--,[Процент резерва ОД]
--,[Резерв ОД]
--,[Процент резерва проценты]
--,[Резерв проценты]
--,[Состояние]
--,[Дней просрочки1]
--,[Процент резерва ОД1]
--,[Процент резерва проценты1]
--,[Сумма резерв прочие НУ]
--,[Сумма резерва БУ]
--,[Вид ДС]
--,[Ставка на дату выдачи]
--,[Ставка на дату формирования отчета]
--,[ПСК]
--,[Обеспеченный займ]
--,[ПДН текущий]
--,[Наличие просрочки]
--,[Счет учета основного долга]
--,[Счет учета начисления процентов]
--,[Счет учета обеспечения]
--,[Подразделение организации]
--,[Адрес подразделения]
--,[Контрагент код]
--,[ИНН]
--,[Дней просрочки за последний год]
--,[Дата закрыт]
--,[Номенклатурная группа]
--,[Дата последнего платежа по ОД]
--,[Сумма последнего платежа по ОД]
--,[Справедливая стоимость проверка обеспеченности]
--,[created]
--,[external_id]
--,[cli_name]
--,[cli_type]
--,[product_group]
--,[int_rate_iss]
--,[int_rate_cur]
--,[int_rate_psk]
--,[pdn_curr]
--,[dpd]
--,[dpd_hist]
--,[dpd_prov]
--,[vin]
--,[vin_distrib]
--,[flag_fl]
--,[flag_bnkr]
--,[flag_msp]
--,[flag_restruct]
--,[flag_collateralized]
--,[principal_rest]
--,[percents_rest]
--,[others_rest]
--,[gross_rest]
--,[prov_nu_gross]
--,[prov_bu_gross]
--,[prov_rate_nu]
--,[prov_rate_bu]
--,[collateral_value]
--,[collateral_value_distrib]
--,[fair_value]
--,[fair_value_distrib]
--,isnull([fair_value_distrib_gross],0)
--,isnull([dt_dml],getdate())
--from risk.REG_REPORT_KP_FOR_CBR;


--select distinct r_date from risk.REG_REPORT_KP_FOR_CBR_NEW
--order by 1 desc
